{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-18 08:17:08",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "0debf3da6e8594ebae13f06616406741",
      "title": "Previously unknown 76M-year-old, raccoon-sized dinosaur species discovered in Utah - KSL News",
      "source": "KSL News",
      "url": "https://www.ksl.com/article/51331384/previously-unknown-76m-year-old-raccoon-sized-dinosaur-species-discovered-in-utah-",
      "image_url": "https://img.ksl.com/slc/3089/308976/30897665.jpeg?filter=kslv2/responsive_story_lg",
      "summary": "Previously unknown 76M-year-old, raccoon-sized dinosaur species discovered in Utah By Carter Williams, KSL. com | Posted - June 17, 2025 at 9:02 p. m. An artist rendering of Bolg amondol roaming the Kaiparowits Formation in Utah back when it would have been a subtropical floodplain, 76 million years ago. The previously unknown species was identified in a study published on...",
      "published": "Wed, 18 Jun 2025 03:02:34 GMT"
    },
    {
      "id": "cb3edd3565ba98c3510cc2e31277f784",
      "title": "Mysterious deep-space radio signals reveal location of the universe's 'missing matter' - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/astronomy/mysterious-deep-space-radio-signals-reveal-location-of-the-universes-missing-matter",
      "image_url": "https://cdn.mos.cms.futurecdn.net/76VuasJcUak2nteHxirrz5.jpg",
      "summary": "How much gold is there in the world? 1,000-year-old Viking Age hoard Best air purifiers for allergies 2025 Mysterious deep-space radio signals reveal location of the universe's 'missing matter' By Skyler Ware published 12 hours ago Much of the universe's regular \"baryonic\" matter is spread through intergalactic space and in diffuse halos around galaxies, researchers proposed after studying the behavior...",
      "published": "Tue, 17 Jun 2025 20:18:28 GMT"
    },
    {
      "id": "aa30182c97a6573ef3bd12561ee1b1c1",
      "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral - Spaceflight Now",
      "source": "Spaceflight Now",
      "url": "https://spaceflightnow.com/2025/06/17/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-6/",
      "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250618_Starlink_Liftoff_PAD_AB-1.jpg",
      "summary": "SpaceX launches 26 Starlink satellites on Falcon 9 rocket from Vandenberg SFB SpaceX launches 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral June 17, 2025 Will Robinson-Smith A SpaceX Falcon 9 rocket lifts off from Space Launch Complex 40 to begin the Starlink 10-18 mission on June 18, 2025. Image: Adam Bernstein/Spaceflight Now Update June 18, 3:15 a.",
      "published": "Tue, 17 Jun 2025 23:18:12 GMT"
    },
    {
      "id": "af485fa6045e1cc54870e125c6078b4e",
      "title": "'Artificial intelligence is not a miracle cure': Nobel laureate raises questions about AI-generated image of black hole spinning at the heart of our galaxy - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/black-holes/artificial-intelligence-is-not-a-miracle-cure-nobel-laureate-raises-questions-about-ai-generated-image-of-black-hole-spinning-at-the-heart-of-our-galaxy",
      "image_url": "https://cdn.mos.cms.futurecdn.net/QAWFgud69GuxGNCkUE9pyi.jpg",
      "summary": "How much gold is there in the world? 1,000-year-old Viking Age hoard Best air purifiers for allergies 2025 'Artificial intelligence is not a miracle cure': Nobel laureate raises questions about AI-generated image of black hole spinning at the heart of our galaxy By Joanna Thompson published 15 hours ago Researchers have used an AI model to create a new image...",
      "published": "Tue, 17 Jun 2025 16:51:38 GMT"
    },
    {
      "id": "ce6e3b22e18f0d1ec732856903cf8542",
      "title": "China's next-gen astronaut capsule for moon missions aces crucial pad-abort test (video) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/moon/chinas-next-gen-astronaut-capsule-for-moon-missions-aces-crucial-pad-abort-test-video",
      "image_url": "https://cdn.mos.cms.futurecdn.net/n6CPLcEjBuvWZT3cP75VVE.jpg",
      "summary": "Astronomy Solar System The moon China's next-gen astronaut capsule for moon missions aces crucial pad-abort test (video) By Josh Dinner published 14 hours ago The country is hoping the next boots on the lunar surface will be those of a taikonaut, not an astronaut. When you purchase through links on our site, we may earn an affiliate commission. Here’s how...",
      "published": "Tue, 17 Jun 2025 18:00:00 GMT"
    },
    {
      "id": "7097dc7171e21b3b9afe2e849541177f",
      "title": "A Game-Changing Telescope Is About to Drop First Pics. Here's How to Watch. - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/a-game-changing-telescope-is-about-to-drop-first-pics-heres-how-to-watch",
      "image_url": "https://www.sciencealert.com/images/2025/06/rubin1.jpg",
      "summary": "A Game-Changing Telescope Is About to Drop First Pics. Here's How to Watch. The first collection of on-sky engineering data took place in April 2025. (RubinObs/NSF/DOE/NOIRLab/SLAC/AURA/Hernan Stockebrand) After more than 20 years in the making, we're finally about to see the first images from the Vera C. Rubin Observatory in Chile, an astronomical facility with the largest digital camera ever...",
      "published": "Tue, 17 Jun 2025 04:05:45 GMT"
    },
    {
      "id": "6cc07bb4cdd534b39cb21dcd972a1e8b",
      "title": "The administration’s anti-consensus Mars plan will fail - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/the-administrations-anti-consensus-mars-plan-will-fail/",
      "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/breaking-nasa-consensus.png?fit=900%2C400&quality=80&ssl=1",
      "summary": "Covering the business and politics of space The administration’s anti-consensus Mars plan will fail Credit: The Planetary Society; CC BY-NC-SA 4. 0 license The White House’s FY 2026 budget request for NASA proposes a radical shift in the agency’s direction, proposing extinction-level cuts to space science, severe cuts in other program areas and a dramatic pivot of human spaceflight focus...",
      "published": "Mon, 16 Jun 2025 11:00:00 GMT"
    },
    {
      "id": "979342aeb6bd4ce930f09f18312c50d4",
      "title": "Construction of ESA’s ambitious LISA mission begins - European Space Agency",
      "source": "European Space Agency",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/LISA/Construction_of_ESA_s_ambitious_LISA_mission_begins",
      "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/06/artwork_inspired_by_esa_s_mission_lisa/26742132-1-eng-GB/Artwork_inspired_by_ESA_s_mission_LISA_pillars.jpg",
      "summary": "We use cookies which are essential for you to access our website and/or to provide you with our services, enable you to share our website content via your social media accounts and allow us to measure and improve the performance of our website. ACCEPT ALL COOKIES ACCEPT ONLY ESSENTIAL COOKIES See our Cookie Notice Construction of ESA’s ambitious LISA mission...",
      "published": "Tue, 17 Jun 2025 10:16:23 GMT"
    },
    {
      "id": "8eb6d056dd4389bcccc02c362f219754",
      "title": "Octopuses’ 8 Arms Snoop on Microbiomes - The New York Times",
      "source": "The New York Times",
      "url": "https://www.nytimes.com/2025/06/17/science/octopus-arms-microbiome.html",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Tue, 17 Jun 2025 15:00:09 GMT"
    },
    {
      "id": "41e2723c1d574636d4aee9a9a5c6860f",
      "title": "Why This Recent Total Solar Eclipse Was the First of Its Kind - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/why-this-recent-total-solar-eclipse-was-the-first-of-its-kind-2000616898",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/proba-3-artificial-solar-eclipse-1200x675.jpg",
      "summary": "Why This Recent Total Solar Eclipse Was the First of Its Kind The European Space Agency’s Proba-3 mission just changed the game for solar scientists. Published June 17, 2025 | Comments (7) | The Sun’s inner corona appears green in this image taken on May 23, 2025 by the ASPIICS coronagraph aboard Proba-3 © ESA/Proba-3/ASPIICS/WOW algorithm The Sun’s outer atmosphere—the...",
      "published": "Tue, 17 Jun 2025 16:25:49 GMT"
    },
    {
      "id": "5db713164971d829407ed73b59b73539",
      "title": "Powerful solar flare erupts from sun triggering radio blackouts across North America (video) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/sun/powerful-solar-flare-erupts-from-sun-triggering-radio-blackouts-across-north-america-video",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Ddmb9rBgJJ78GbScDFcwuh.jpg",
      "summary": "Powerful solar flare erupts from sun triggering radio blackouts across North America (video) By Daisy Dobrijevic published 2 days ago The M-class flare was accompanied by a coronal mass ejection currently forecast to land Earth with a glancing blow on June 18. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.",
      "published": "Mon, 16 Jun 2025 14:13:01 GMT"
    },
    {
      "id": "fc14120ad9cc2a9bcaf644d3458c19d3",
      "title": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/hundreds-of-mysterious-giant-viruses-discovered-lurking-in-the-ocean",
      "image_url": "https://www.sciencealert.com/images/2025/06/pandora-virus.jpg",
      "summary": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean Pandoravirus salinus, a species of giant virus identified in 2013. (© IGS CNRS-AMU) Scientists have just discovered hundreds of new giant viruses, in a comprehensive study covering oceans across the globe. The team behind the study, marine biologist Benjamin Minch and virologist Mohammad Moniruzzaman from the University of Miami, used...",
      "published": "Mon, 16 Jun 2025 06:42:09 GMT"
    },
    {
      "id": "6b82fcd44065f65d280189782856bfa8",
      "title": "Scientists looked back in time to find the first signs of human-caused global warming. It’s far earlier than previously thought - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/fingerprint-human-caused-global-warming-190122197.html",
      "image_url": "https://media.zenfs.com/en/cnn_articles_875/96969667596173fa1e2980264f86a57c",
      "summary": "Scientists looked back in time to find the first signs of human-caused global warming. It’s far earlier than previously thought Mon, June 16, 2025 at 9:00 PM UTC An iron and steel works factory in England in 1880. - Print Collector/Hulton Archive/Getty Images The human fingerprint on global warming was likely evident in Earth’s atmosphere far earlier than previously thought—even...",
      "published": "Mon, 16 Jun 2025 21:00:16 GMT"
    },
    {
      "id": "a7c8c286ad4515a8f6adb7f09ca66796",
      "title": "A Fifth Force of Nature May Have Been Discovered Inside Atoms - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/a-fifth-force-of-nature-may-have-been-discovered-inside-atoms",
      "image_url": "https://www.sciencealert.com/images/2025/06/fifth_force_atom_header.jpg",
      "summary": "A Fifth Force of Nature May Have Been Discovered Inside Atoms Every action in physics is governed by some kind of push or pull. As far as we know, these all fall into one of just four categories; electromagnetism, gravity, and two kinds of nuclear force. Yet there could well be forces hidden deep within the tiny storms of particle...",
      "published": "Mon, 16 Jun 2025 13:02:27 GMT"
    },
    {
      "id": "b174d5636d438e8b25eb995e3cf4f10d",
      "title": "Apollo astronauts discovered the moon is covered in tiny orange glass beads. Now we finally know why. - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/the-moon/apollo-astronauts-discovered-the-moon-is-covered-in-tiny-orange-glass-beads-now-we-finally-know-why",
      "image_url": "https://cdn.mos.cms.futurecdn.net/CYCiEPraHLTgFGKH3pXFFB.jpg",
      "summary": "How much gold is there in the world? 1,000-year-old Viking Age hoard Best air purifiers for allergies 2025 Apollo astronauts discovered the moon is covered in tiny orange glass beads. Now we finally know why. By Mark Thompson published yesterday Tiny, orange glass beads discovered on the moon during the Apollo era may reveal an untold history of lunar volcanism.",
      "published": "Mon, 16 Jun 2025 21:52:37 GMT"
    },
    {
      "id": "6c3eefc9f10199c31061e9b4434c2e7d",
      "title": "Scientists Discover the Key to Axolotls’ Ability to Regenerate Limbs - WIRED",
      "source": "WIRED",
      "url": "https://www.wired.com/story/scientists-discover-the-key-to-axolotls-ability-to-regenerate-limbs/",
      "image_url": "https://media.wired.com/photos/68498b79c252285716e6a594/191:100/w_1280,c_limit/RmqjxW_g.jpeg",
      "summary": "Scientists Discover the Key to Axolotls’ Ability to Regenerate Limbs A new study reveals the key lies not in the production of a regrowth molecule, but in that molecule's controlled destruction. The discovery could inspire future regenerative medicine. Axolotls in Professor James Monaghan’s laboratory. PHOTOGRAPH: ALYSSA STONE/NORTHEASTERN UNIVERSITY THE AXOLOTL SEEMS like something out of science fiction. This perpetually youthful-looking...",
      "published": "Tue, 17 Jun 2025 09:00:00 GMT"
    },
    {
      "id": "91d5183d759794cc9d3745e482cebd5d",
      "title": "Scientists studying Earth's largest iron ore deposits uncover a 1.3-billion-year-old secret - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/earths-largest-iron-ore-deposits-reveal-a-1-3-billion-year-old-secret/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/17170629/iron-ore_deep-blue_Hamersley-Province_credit-Curtin-University_1.jpg",
      "summary": "Scientists studying Earth's largest iron ore deposits uncover a 1. 3-billion-year-old secret Steel is the skeleton of modern life, yet the iron that makes it has a backstory far older than the first nail. For decades, geologists thought the world’s richest and largest iron ore deposits formed not long after breathable oxygen spread through Earth’s air some 2. 2 billion...",
      "published": "Tue, 17 Jun 2025 23:45:01 GMT"
    },
    {
      "id": "0aa3052ccbb9fd0ff5c95aae8f835323",
      "title": "Northern lights and glowing noctilucent clouds collide in a rare night sky show over Alberta (photo) - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/northern-lights-and-glowing-noctilucent-clouds-collide-in-a-rare-night-sky-show-over-alberta-photo",
      "image_url": "https://cdn.mos.cms.futurecdn.net/9dfpcGHQPvmDYE9DmGatm4.jpg",
      "summary": "Northern lights and glowing noctilucent clouds collide in a rare night sky show over Alberta (photo) By Daisy Dobrijevic published 12 hours ago The surprise display was captured on June 9 by aurora chaser Harlan Thomas. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Northern lights and noctilucent clouds shining...",
      "published": "Tue, 17 Jun 2025 20:00:00 GMT"
    },
    {
      "id": "5cbaa00a0cb42f031d3ff486cab80125",
      "title": "Tiny primordial black holes created in the Big Bang may have rapidly grown to supermassive sizes - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/black-holes/tiny-primordial-black-holes-created-in-the-big-bang-may-have-rapidly-grown-to-supermassive-sizes",
      "image_url": "https://cdn.mos.cms.futurecdn.net/vzu7pFF4Hy9DdvYTn8hC2o.png",
      "summary": "Tiny ‘primordial’ black holes created in the Big Bang may have rapidly grown to supermassive sizes By Robert Lea published 11 hours ago \"Primordial black holes, if they exist, will be hiding in the extremes! \" When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. An illustration (not to scale) of...",
      "published": "Tue, 17 Jun 2025 21:00:00 GMT"
    },
    {
      "id": "0ad132648c2ef698af12308adb02685e",
      "title": "Mysterious radio pulses detected high above Antarctica may be evidence of an exotic new particle, scientists say - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/black-holes/mysterious-radio-pulses-detected-high-above-antarctica-may-be-evidence-of-an-exotic-new-particle-scientists-say",
      "image_url": "https://cdn.mos.cms.futurecdn.net/BwEgZnpx5Y4JPDp68ZhqXN.png",
      "summary": "Mysterious radio pulses detected high above Antarctica may be evidence of an exotic new particle, scientists say By Robert Lea published 16 hours ago \"We still don't have an explanation for what those anomalies are. \" When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. An illustration shows a strange signal...",
      "published": "Tue, 17 Jun 2025 16:42:08 GMT"
    }
  ]
}