{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-09 02:13:15",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "fa15320fd659b98952fd1c18a2601546",
      "title": "The NASA science missions that would be axed in Trump’s 2026 budget - The Washington Post",
      "source": "The Washington Post",
      "url": "https://www.washingtonpost.com/science/2025/06/08/nasa-budget-voyager-space/",
      "image_url": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6XVBICNZQ4LXBYRNUDIVQZJM5I.jpg&w=1440",
      "summary": "The NASA science missions that would be axed in Trump’s 2026 budget Deep cuts would upend missions to study other planets and Earth itself. The Laser Interferometer Space Antenna (LISA), a joint project with the European Space Agency, is designed to test technologies that could one day detect gravitational waves. (Nasa) By Joel Achenbach and Christian Davenport President Donald Trump’s...",
      "published": "Sun, 08 Jun 2025 17:00:03 GMT"
    },
    {
      "id": "9f2c5dfdf0a72fabf944a22d644f26ea",
      "title": "NASA's Parker Solar Probe spots powerful magnetic explosion aimed at the sun's surface - Live Science",
      "source": "Live Science",
      "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPZmRYU0dQRER4alVKY0YtdFp3MW5EOXNGT2F5NXU0b1Y0c3Q5dlFzWVVoMGV5ZGNiQkE5RXNJX1FENWFwaHBfYlZuMEFfWE1CZXoyTU5yZUZ5cEJGN3dnZmNDMVpYdXN4VFp1SEVGNWkzWE9kbGV5bEVzS3pXdHZuSjhmeFIxWm1BT29FUGZ5NExSOHF2VWRhdkdaemVuRVd0d1FVdGVBSzQzZm96eWV6bVRKSnpwM2dGSDJaX3hTeEdNc0RJ?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Sun, 08 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "668d10316956c4aa55f2dc56b56fd4cd",
      "title": "Vandenberg’s Next Mission: SpaceX Rocket Launch on Sunday - Noozhawk",
      "source": "Noozhawk",
      "url": "https://www.noozhawk.com/vandenbergs-next-mission-spacex-rocket-launch-on-sunday-060725/",
      "image_url": "https://i0.wp.com/www.noozhawk.com/wp-content/uploads/2022/12/social-fallback.png?fit=1200%2C630&quality=80&ssl=1",
      "summary": "The freshest news in Santa Barbara County Vandenberg’s Next Mission: SpaceX Rocket Launch on Sunday by Janene Scully | Noozhawk North County Editor What: Falcon 9 rocket launch from Vandenberg Space Force Base in Santa Barbara County. When: 6:34 a. m. Sunday with other options until 10:34 a. m., according to SpaceX. If needed, the team has backup opportunities starting...",
      "published": "Sat, 07 Jun 2025 17:33:02 GMT"
    },
    {
      "id": "7d8ac255265dace866911eb259bf44e9",
      "title": "China's Tianwen 2 spacecraft sends home 1st photo as it heads for mysterious 'quasi-moon' asteroid - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/missions/chinas-tianwen-2-spacecraft-sends-home-1st-photo-as-it-heads-for-mysterious-quasi-moon-asteroid",
      "image_url": "https://cdn.mos.cms.futurecdn.net/zAQWz5kLSrYAzR7sAkcrmi.jpg",
      "summary": "Fate of ispace moon lander in doubt China's Tianwen 2 spacecraft sends home 1st photo as it heads for mysterious 'quasi-moon' asteroid By Andrew Jones published 16 hours ago The deep-space mission is heading for Kamoʻoalewa, a strange asteroid that might be a piece of the moon. When you purchase through links on our site, we may earn an affiliate...",
      "published": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "e74f6c5b8991406169a04d628b0a52cc",
      "title": "Scientists photograph whales blowing 'bubble smoke rings' to communicate with humans - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/whales-blow-bubble-smoke-rings-near-humans-to-communicate/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/08105337/humpback-whales_bubble-smoke-rings_human-communication_montage_WhaleSETI_1m.jpg",
      "summary": "Scientists photograph whales blowing 'bubble smoke rings' to communicate with humans Whales are known to be intelligent. They use complex sounds, travel in social groups, and show strong memory. But what happens when they do something not tied to feeding or mating? Could they interact in a creative and playful way using bubble rings? For the first time, researchers from...",
      "published": "Sun, 08 Jun 2025 22:49:02 GMT"
    },
    {
      "id": "c561bf3da6348edee9b3df6922651492",
      "title": "NASA Spots Strange Towering Shape Breaking Through Mars’ Atmosphere - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/nasa-towering-shape-mars-atmosphere/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASA-Catches-Strange-Structure-Emerging-From-the-Martian-Fog.jpg",
      "summary": "NASA Spots Strange Towering Shape Breaking Through Mars’ Atmosphere A newly released NASA image captures a mysterious peak piercing through Mars’ morning clouds. Credit: NASA/JPL-Caltech/ASU | The Daily Galaxy --Great Discoveries Channel A new image from NASA’s Mars Odyssey orbiter reveals an extraordinary sight: a massive formation breaking through Mars’ early morning cloud cover. Taken just before dawn on May...",
      "published": "Sat, 07 Jun 2025 15:30:00 GMT"
    },
    {
      "id": "30cdd0f2bd6cec188cd7c2d0d7699b10",
      "title": "June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/junes-full-strawberry-moon-illuminates-the-night-sky-next-week-heres-how-to-see-it",
      "image_url": "https://cdn.mos.cms.futurecdn.net/6VxZZXmCHNJEVUwD7VBdBa.jpg",
      "summary": "Fate of ispace moon lander in doubt June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it By Anthony Wood published 2 days ago Don't miss the 2025 full \"Strawberry Moon\" when it rises above the southeastern horizon on June 10. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Sat, 07 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "1073cefbebf0107fef2790feb8876160",
      "title": "Pacific sediment cores unlock millions of years of climate history - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/pacific-sediment-cores-unlock-millions-of-years-of-climate-history/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/07134216/Pacific-sediment.jpg",
      "summary": "Pacific sediment cores unlock millions of years of climate history The deep sea guards secrets of Earth’s past. Its sediment layers silently record carbon cycles, climate shifts, and ecosystem upheavals. Among the vast oceans, the Pacific holds the most heat and carbon. Yet, it remains one of the least explored when it comes to long-term climate data. “It’s easy to...",
      "published": "Sat, 07 Jun 2025 20:05:17 GMT"
    },
    {
      "id": "1556e4cdbd8ccc2dd5e04b653883b792",
      "title": "Astronomers thought the Milky Way was doomed to crash into Andromeda. Now they're not so sure - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-astronomers-thought-milky-doomed-andromeda.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 13.85.43.186 : 87d82a16-5c31-479f-89d1-68728ecb",
      "published": "Sat, 07 Jun 2025 17:40:01 GMT"
    },
    {
      "id": "ab011ebd7bd75f4f76057971b1e2da4a",
      "title": "NASA’s Perseverance Rover Keeps Photographing a Tiny Maze on Mars – Here’s Why - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/nasas-perseverance-rover-tiny-maze-on-mars/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASAs-Perseverance-Rover-Keeps-Photographing-a-Tiny-Maze-on-Mars-–-Heres-Why.jpg",
      "summary": "NASA’s Perseverance Rover Keeps Photographing a Tiny Maze on Mars – Here’s Why A tiny etched maze on NASA’s Perseverance rover is a high-precision calibration tool critical to its search for ancient life on Mars. Image credit: NASA/JPL-Caltech | The Daily Galaxy --Great Discoveries Channel NASA’s Perseverance rover has sent back thousands of images from Mars, but one recurring subject...",
      "published": "Sun, 08 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "2958aaad7a615f3d26560b65a96528e0",
      "title": "SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (video, photos) - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-sirius-xm-radio-satellite-to-orbit-lands-rocket-on-ship-at-sea-photos",
      "image_url": "https://cdn.mos.cms.futurecdn.net/8tnDivxki5wvR4zRssWNFD.jpg",
      "summary": "Fate of ispace moon lander in doubt Space Exploration Launches & Spacecraft SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (video, photos) By Mike Wall published 2 days ago It was SpaceX's 69th Falcon 9 launch of the year already. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Sat, 07 Jun 2025 05:43:07 GMT"
    },
    {
      "id": "765c6acd4451be0b7cb8e6b3c803784f",
      "title": "Scientists learn how mosquitoes outsmart and evade human defenses - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/scientists-learn-how-mosquitoes-use-sound-to-outsmart-and-evade-human-defenses/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/08095844/mosquito_evade-human-traps-defenses_hearing_1m.jpg",
      "summary": "Scientists learn how mosquitoes outsmart and evade human defenses Mosquito swarms may sound like chaos, but male mosquitoes are incredible listeners. Despite the noise, they can hear the faint sounds made by female wingbeats. A new study from Nagoya University uncovers how male mosquitoes hear across a wider range of frequencies than females, helping them locate mates in buzzing clouds...",
      "published": "Sun, 08 Jun 2025 16:14:08 GMT"
    },
    {
      "id": "020dfcabe7cb5ebef49ab914e8c07396",
      "title": "Astronauts track huge dust clouds over Canada and US | On the ISS this week June 2-6, 2025 - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/international-space-station/astronauts-track-dust-clouds-us-iss-weekly-review-june-2-6-2025",
      "image_url": "https://cdn.mos.cms.futurecdn.net/KiH4UR56fyqYUow4ChTp4g.jpg",
      "summary": "Fate of ispace moon lander in doubt Space Exploration Missions International Space Station Astronauts track huge dust clouds over Canada and US | On the ISS this week June 2-6, 2025 By Robert Z. Pearlman published 12 hours ago A look back at the week's activities for the Expedition 73 crew. When you purchase through links on our site, we...",
      "published": "Sun, 08 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "114c479bf82d753c30caf6caed0fc06f",
      "title": "A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/one-planet-revealing-why-hard-140114753.html",
      "image_url": "https://media.zenfs.com/en/cnn_articles_875/422d58aa4c615937143c7adef9e22995",
      "summary": "A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story Sun, June 8, 2025 at 1:33 AM UTC An artist's concept shows what K2-18b might look like. Thought to be covered entirely in liquid water with a hydrogen-rich atmosphere, the exoplanet may be a good place to look for biological...",
      "published": "Sun, 08 Jun 2025 01:33:00 GMT"
    },
    {
      "id": "c22b1d28b5f6474de29c5f7f4eaf31c6",
      "title": "Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking - Spaceflight Now",
      "source": "Spaceflight Now",
      "url": "https://spaceflightnow.com/2025/06/07/further-delays-of-starliners-next-flight-mark-anniversary-of-its-first-crewed-space-station-docking/",
      "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250403_Starliner_CFT_rollout.jpeg",
      "summary": "SpaceX launches 26 Starlink satellites on Falcon 9 rocket from Vandenberg SFB Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking June 7, 2025 Will Robinson-Smith The Boeing Starliner spacecraft is lifted at the Vertical Integration Facility at Space...",
      "published": "Sat, 07 Jun 2025 03:17:16 GMT"
    },
    {
      "id": "7e7d5c3abebee4806ec994fd54242e09",
      "title": "Underwater Megavolcano Set to Release Millions of Tons of Lava, Experts Warn - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/underwater-volcano-millions-tons-lava/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Underwater-Megavolcano-Set-to-Release-Millions-of-Tons-of-Lava-Experts-Warn.jpg",
      "summary": "Underwater Megavolcano Set to Release Millions of Tons of Lava, Experts Warn Something massive is brewing beneath the ocean — and this underwater volcano might be closer to erupting than anyone thought. Credit: Schmidt Ocean Institute | The Daily Galaxy --Great Discoveries Channel A massive underwater volcano located approximately 300 miles off the coast of Oregon is on the verge...",
      "published": "Sat, 07 Jun 2025 18:00:00 GMT"
    },
    {
      "id": "2b2ed9fc556b0bc742ef59de069a644f",
      "title": "If books could kill: The poison legacy lurking in libraries - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g2y9xq58no",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b804/live/51328d10-42fa-11f0-9630-fd015488de94.jpg",
      "summary": "If books could kill: The poison legacy lurking in libraries BBC Scotland Arts Correspondent Green dye was widely used in Victorian publishing The Victorians loved the colour green. In particular, they loved a vibrant shade of emerald created by combining copper and arsenic, which was used in everything from wallpaper to children's toys. \"This colour was very popular for most...",
      "published": "Sat, 07 Jun 2025 08:20:48 GMT"
    },
    {
      "id": "a9798f16f4cd198eae42f438a6b8b549",
      "title": "Space photo of the week: James Webb telescope takes best look at 'Sombrero Galaxy' in 244 years - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-james-webb-telescope-takes-best-look-at-sombrero-galaxy-in-244-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/GRSu6KV2x4khJppUGqgXbD.jpg",
      "summary": "Physicists capture 'second sound' Space photo of the week: James Webb telescope takes best look at 'Sombrero Galaxy' in 244 years By Jamie Carter published 16 hours ago New near-infrared observations by the James Webb Space Telescope highlight a tightly packed group of stars at the peculiar galaxy's center as well as dust on its outer fringes. When you purchase...",
      "published": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "ce4966475502a6504c3c94c47a38d734",
      "title": "Scientists Just Found an Ingredient for Life in a Newborn Planet System - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-ingredient-newborn-planet/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Just-Found-an-Ingredient-for-Life-in-a-Newborn-Planet-System.jpg",
      "summary": "Scientists Just Found an Ingredient for Life in a Newborn Planet System A rare molecule spotted in a young planet system could be a missing link in the story of life’s origins. Scientists are now piecing together what this means for our own solar system. Credit: CfA/M. Weiss | The Daily Galaxy --Great Discoveries Channel Astronomers have uncovered a rare...",
      "published": "Sat, 07 Jun 2025 12:15:00 GMT"
    },
    {
      "id": "43e74f1f95e4d481c8c62bef2df01d15",
      "title": "Astronomers Astonished by Largest Explosion Since the Big Bang - futurism.com",
      "source": "futurism.com",
      "url": "https://futurism.com/astronomers-largest-explosion-big-bang",
      "image_url": "https://wordpress-assets.futurism.com/2025/06/astronomers-largest-explosion-big-bang.jpg",
      "summary": "JUN 7, 10:30 AM EDT by FRANK LANDYMORE Astronomers Astonished by Largest Explosion Since the Big Bang Behold: extreme nuclear transients. / Off World/ Black Holes/ Stars/ Supermassive Black Holes You've heard of how mighty supernovas are, or of the ungodly amounts of energy released by gamma ray bursts. But astronomers have just discovered a type of cosmic blast that...",
      "published": "Sat, 07 Jun 2025 14:30:40 GMT"
    }
  ]
}