{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-02 21:02:46",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "385a8b7e81d2966604548e4f439ebf02",
      "title": "The Milky Way may not collide with neighboring galaxy Andromeda after all: 'From near-certainty to a coin flip' - Space",
      "source": "Space",
      "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQbEJaa25nSEFCQWZKYXkyOFplQUktdWFzYTF6dzBRQ2g3Nk9DamxZT0VXQkhxZEhuVDNENV9PbFJLSE9RdHFpNGxIbklZNHJqa1ZNUm1UaVJLRWQyMm1pdkRuZ2htMG1IS1JzTlRkT3VROE1hRmVWODJPOEExbmRqc3RHbEphanNrQjI1WW1yeXR5em1UMUNFdVJBVVIwNjBVSzI1THJjQmNuMzlla0xjZUx6aVNwcHZ0NUhBc3B4Q0RrYnJXTU1Qd0kwWkJuS2tFaXJRUHNydw?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Mon, 02 Jun 2025 15:01:00 GMT"
    },
    {
      "id": "5c794800c11437e157352c5978af24ae",
      "title": "Proposed NASA cuts to space science: “Staggering” - EarthSky",
      "source": "EarthSky",
      "url": "https://earthsky.org/human-world/proposed-nasa-cuts-decimate-us-space-science-petition/",
      "image_url": "https://earthsky.org/upl/2025/05/science-fleet-proposed-cuts-Paul-Byrne-NASAs-Goddard-Space-Flight-Center-e1748713006375.jpg",
      "summary": "Proposed NASA cuts to space science: “Staggering” View larger. | Proposed NASA cuts would mean a 47% loss to the planetary science budget in 2026. The Planetary Society – under the leadership of CEO Bill Nye – called these possible cuts a “staggering” loss. “If this proposed budget is enacted,” the society said, “dozens of space missions would be terminated,...",
      "published": "Sun, 01 Jun 2025 12:01:55 GMT"
    },
    {
      "id": "0768fdbc75d2567a43f5eb476cd03cd4",
      "title": "NYC summer stargazing seasons kicks off with triangle, meteor showers - Gothamist",
      "source": "Gothamist",
      "url": "https://gothamist.com/news/nyc-summer-stargazing-seasons-kicks-off-with-triangle-meteor-showers",
      "image_url": "https://api-prod.gothamist.com/images/351534/fill-1200x650|format-webp|webpquality-85/",
      "summary": "A non-profit newsroom, powered by WNYC. NYC summer stargazing seasons kicks off with triangle, meteor showers Alan Dyer/VWPics/Universal Images Group via Getty Images We rely on your support to make local news available to all Make your contribution now and help Gothamist thrive in 2025. Donate today The summer triangle — the quintessential astronomical sign that days are getting longer...",
      "published": "Mon, 02 Jun 2025 19:28:00 GMT"
    },
    {
      "id": "44cb9f8c492e1eed3cae0d9d84711767",
      "title": "SpaceX adds 27 Starlink satellites to constellation after successful launch from California (video) - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/spacex-adds-27-starlink-satellites-202304758.html",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/KjZcdWJG2hhoooMGOum20Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/757d29bbd3c3d62af6cd5b6b9230ff32",
      "summary": "'King of the Hill' voice actor killed Senators tackle Trump's big bill Poll: Trump’s ratings since tariffs Speaker Johnson on Medicaid cuts SpaceX adds 27 Starlink satellites to constellation after successful launch from California (video) Sat, May 31, 2025 at 8:23 PM UTC When you buy through links on our articles, Future and its syndication partners may earn a commission.",
      "published": "Sat, 31 May 2025 20:23:04 GMT"
    },
    {
      "id": "7153a03541e5a05096502eab7104753e",
      "title": "Tiny Pebbles Created One of The Most Extreme Worlds in The Galaxy - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/tiny-pebbles-created-one-of-the-most-extreme-worlds-in-the-galaxy",
      "image_url": "https://www.sciencealert.com/images/2025/06/tylos-formation.jpg",
      "summary": "Tiny Pebbles Created One of The Most Extreme Worlds in The Galaxy An artist's impression of the formation of Tylos. (T. Müller/MPIA/HdA/CC BY-SA) The tiny pebbles left over from a star's formation fed the growth of one of the strangest, wildest worlds humanity has ever known. It's a famous one, Tylos, or WASP-121b, a gas giant exoplanet some 880 light-years...",
      "published": "Mon, 02 Jun 2025 09:01:20 GMT"
    },
    {
      "id": "4a6278d254fc227fd9fd7fcda41deb48",
      "title": "Two Ocean Bands Are Warming Faster Than Ever — What This Means for Our Climate - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/two-ocean-bands-warming-faster-than-ever/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Two-Ocean-Bands-Are-Warming-Faster-Than-Ever-—-What-This-Means-for-Our-Climate.jpg",
      "summary": "Two Ocean Bands Are Warming Faster Than Ever — What This Means for Our Climate Two mysterious ocean bands near 40 degrees latitude are heating faster than ever, reshaping our climate and threatening marine life worldwide. Credit: Shutterstock | The Daily Galaxy --Great Discoveries Channel A recent study published in the Journal of Climate reveals that two distinct bands in...",
      "published": "Mon, 02 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "6a1aa69f6e9206f7a7e84c429a24bd96",
      "title": "Scientists Predict a Million-Fold Drop in Oxygen — Here’s What it Means for Earth’s Future - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-million-fold-drop-oxygen-earth/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Predict-a-Million-Fold-Drop-in-Oxygen-—-Heres-What-it-Means-for-Earths-Future.jpg",
      "summary": "Scientists Predict a Million-Fold Drop in Oxygen — Here’s What it Means for Earth’s Future Scientists warn that Earth’s oxygen levels could plummet a million-fold, threatening the survival of complex life as we know it. Credit: Canva | The Daily Galaxy --Great Discoveries Channel A recent study published in Nature Geoscience explores the future of Earth’s atmosphere, revealing that a...",
      "published": "Mon, 02 Jun 2025 16:00:00 GMT"
    },
    {
      "id": "40411b97825241cf683ed1862dd662c2",
      "title": "Scientists Spot Mysterious Object in Our Galaxy Pulsing Every 44 Minutes - futurism.com",
      "source": "futurism.com",
      "url": "https://futurism.com/mysterious-object-radio-x-ray-pulses",
      "image_url": "https://wordpress-assets.futurism.com/2025/05/mysterious-object-radio-x-ray-pulses.jpg",
      "summary": "JUN 1, 8:30 AM EDT by NOOR AL-SIBAI Scientists Spot Mysterious Object in Our Galaxy Pulsing Every 44 Minutes \"Unlike anything we have seen before. \" / Off World/ Long Period Transients/ Radio Telescope/ Radio Waves Image by ROBERTA CIUCCIO/AFP via Getty Images Astronomers have spotted something strange and spectacular: a mysterious object that keeps emitting pulses every 44 minutes.",
      "published": "Sun, 01 Jun 2025 12:30:32 GMT"
    },
    {
      "id": "b6081e7687016b068f257527e8889c1f",
      "title": "Solar Storms Are Pushing Elon Musk’s Satellites Back to Earth - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/solar-storms-are-pushing-elon-musks-satellites-back-to-earth-2000608452",
      "image_url": "https://gizmodo.com/app/uploads/2025/05/venus-and-starlink-satellites.jpg",
      "summary": "Solar Storms Are Pushing Elon Musk’s Satellites Back to Earth As Earth’s orbit becomes increasingly crowded, we need more data on how space weather impacts their reentries, researchers say. Published June 1, 2025 | Comments (42) | Venus and Starlink satellites © Mike Lewinski/Wikimedia Commons New research suggests that heightened solar activity shortens the lifespans of SpaceX’s Starlink satellites, and...",
      "published": "Sun, 01 Jun 2025 10:00:34 GMT"
    },
    {
      "id": "f4ce6c94e616e2d51b0020f7f0459aaf",
      "title": "Scientific Discoveries, and Dreams, in the Balance - The New York Times",
      "source": "The New York Times",
      "url": "https://www.nytimes.com/2025/06/02/science/trump-science-research-nsf.html",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Mon, 02 Jun 2025 09:01:00 GMT"
    },
    {
      "id": "4cb139e5f5eba6b259615f594f600335",
      "title": "Forgotten in a collection, the discovery of this fossil presents a real problem for scientists as it doesn't belong to any known living family. - Farmingdale Observer",
      "source": "Farmingdale Observer",
      "url": "https://farmingdale-observer.com/2025/06/02/forgotten-in-a-collection-the-discovery-of-this-fossil-presents-a-real-problem-for-scientists-as-it-doesnt-belong-to-any-known-living-family/",
      "image_url": "https://farmingdale-observer.com/wp-content/uploads/2025/05/089181515048-1024x683.webp",
      "summary": "Forgotten In A Collection, The Discovery Of This Fossil Presents A Real Problem For Scientists As It Doesn’T Belong To Any Known Living Family. In a remarkable scientific discovery, researchers have unearthed a plant fossil that defies conventional botanical classification. This 47-million-year-old specimen, named Othniophyton elongatum, has left paleobotanists puzzled as it appears to belong to no known plant family,...",
      "published": "Mon, 02 Jun 2025 18:38:00 GMT"
    },
    {
      "id": "b325104eead646326b93b030d0fc2322",
      "title": "Vienna calling: Strauss's 'Blue Danube' waltzes into outer space - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-vienna-strauss-blue-danube-waltzes.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 20.42.48.116 : 3e9e3e9b-78c3-4b5f-9760-ec49df96",
      "published": "Sun, 01 Jun 2025 10:27:11 GMT"
    },
    {
      "id": "2fb6d618c64ff469af5bb5052f6aa50b",
      "title": "Scientists Stunned by Evidence of Ancient Birds Nested in the Arctic - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-evidence-ancient-birds-nested-arctic/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Stunned-by-Evidence-of-Ancient-Birds-Nested-in-the-Arctic.jpg",
      "summary": "Scientists Stunned by Evidence of Ancient Birds Nested in the Arctic A remote dig in frozen Alaska has revealed a prehistoric surprise. The Arctic’s earliest bird nests might date back far longer than previously believed. Credit: Shutterstock | The Daily Galaxy --Great Discoveries Channel Tiny fossil fragments discovered in northern Alaska have revealed that ancient birds were nesting in the...",
      "published": "Sun, 01 Jun 2025 18:30:00 GMT"
    },
    {
      "id": "bb0d571b01497f54e9fd8ef6a69f87ee",
      "title": "Turning the Red Planet green? It's time to take terraforming Mars seriously, scientists say - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/mars/turning-the-red-planet-green-its-time-to-take-terraforming-mars-seriously-scientists-say",
      "image_url": "https://cdn.mos.cms.futurecdn.net/7zWzTQ8nWnmTK7d7vHfjV6.jpg",
      "summary": "Starship Flight 9 Launch Failure Turning the Red Planet green? It's time to take terraforming Mars seriously, scientists say By Stefanie Waldek published 11 hours ago New research suggests that the idea of transforming the Red Planet might not be so far-fetched after all. When you purchase through links on our site, we may earn an affiliate commission. Here’s how...",
      "published": "Mon, 02 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "35e4cecb33300bb7315f6f4bd4222016",
      "title": "MIT’s Chilling Experiment That Could Prove Gravity Is Quantum - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/mits-chilling-experiment-that-could-prove-gravity-is-quantum/",
      "image_url": "https://scitechdaily.com/images/Quantum-Gravity-Physics-Experiment-Concept.jpg",
      "summary": "Home»Physics»MIT’s Chilling Experiment That Could Prove Gravity Is Quantum MIT’s Chilling Experiment That Could Prove Gravity Is Quantum In a dramatic twist on classical physics, scientists have cooled a mirror to near absolute zero with lasers to see if gravity might be quantum. This breakthrough could reshape how we understand the universe. Credit: SciTechDaily. com MIT researchers have found a...",
      "published": "Sun, 01 Jun 2025 02:55:40 GMT"
    },
    {
      "id": "12eb0501074c70173d4c06f97cc5bf76",
      "title": "'Rock Showman' uncovers sandstone stegosaur near Whitby - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cd7g4y21envo",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/05fd/live/00f20270-3d25-11f0-b1db-7b03bfaa8894.jpg",
      "summary": "'Rock Showman' uncovers sandstone stegosaur Steve Cousins/www. YorkshireCoast. rocks Steve Cousins - aka the Rock Showman - regularly leads fossil walks along the Yorkshire coast A geology tour guide has discovered a fossilised dinosaur footprint believed to be 170m years old along the coast near Whitby. Steve Cousins, aka the \"Rock Showman\", was taking a school trip on an educational...",
      "published": "Sun, 01 Jun 2025 09:04:11 GMT"
    },
    {
      "id": "cc2804c6518357d1c87e24ddaf49b9e4",
      "title": "Space photo of the week: Pink 'raindrops' on the sun captured in greatest detail ever - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/the-sun/space-photo-of-the-week-pink-raindrops-on-the-sun-captured-in-greatest-detail-ever",
      "image_url": "https://cdn.mos.cms.futurecdn.net/AMcyuNkeBkeVHyeQMCpg4.jpg",
      "summary": "Ancient DNA reveals collapsed civilization Buried cave 'trash' surprises researchers Space photo of the week: Pink 'raindrops' on the sun captured in greatest detail ever By Jamie Carter published yesterday Solar scientists have unveiled spectacular new images of plasma \"rain\" in the sun's corona using adaptive optics. When you purchase through links on our site, we may earn an affiliate...",
      "published": "Sun, 01 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "999a69bd504bca5f221adf140b33c65a",
      "title": "Infrared contact lens enables humans to see in dark - DW",
      "source": "DW",
      "url": "https://www.dw.com/en/infrared-contact-lens-enables-humans-to-see-in-dark/a-72749143",
      "image_url": "https://static.dw.com/image/63495525_6.jpg",
      "summary": "DW uses cookies and similar technologies to measure usage, display personalized advertising and share personal data and information with up to 186 third parties. You decide for yourself whether you agree to this use of your data. You can adjust individual details under “Settings” and change them at any time. You can view all of DW's content without agreeing. Social...",
      "published": "Sun, 01 Jun 2025 12:45:06 GMT"
    },
    {
      "id": "4fa8cdba5567a3aaaff3e11121e30223",
      "title": "Discovery of Earth’s Oldest Living Creature: A 700-Million-Year-Old Species That Changes Our Understanding of Evolution - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/oldest-living-creature-700-million-year/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/discovery-of-earths-oldest-living-creature-a-700-million-year-evolutionary-breakthrough.jpg",
      "summary": "Discovery of Earth’s Oldest Living Creature: A 700-Million-Year-Old Species That Changes Our Understanding of Evolution Discovery of a 700-million-year-old creature rewrites the story of animal evolution, revealing surprising new origins of life’s complexity. Credit: MBARI - copyright Shutterstock Recent research published in Nature has transformed our understanding of animal evolution by revealing that ctenophores, also known as comb jellies, represent...",
      "published": "Mon, 02 Jun 2025 17:55:00 GMT"
    },
    {
      "id": "f6819bde9560d4757159bb1ed162816e",
      "title": "Prints Aren't the Only Stable Thing About Your Fingers - Newser",
      "source": "Newser",
      "url": "https://www.newser.com/story/369328/our-wet-fingers-prune-the-exact-same-way-each-time.html",
      "image_url": "https://img2-azrcdn.newser.com/image/1613481-12-20250601083502.jpeg",
      "summary": "Prints Aren't the Only Stable Thing About Your Fingers Scientists say blood vessels under skin cause wet fingers to wrinkle the exact same way each time Stock photo. (Getty Images/indra rizky firmansyah) A new study sheds light on why fingers wrinkle in water—and why those wrinkles appear in the same places every time. Biomedical engineer Guy German of Binghamton University...",
      "published": "Sun, 01 Jun 2025 13:05:00 GMT"
    }
  ]
}