{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-07-01 20:19:47",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "27d7cac321c5f1f86e1371ffca01bc7e",
      "title": "Space Cargo of Human Remains And Cannabis Lost at Sea Following Mission Failure - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/space-cargo-of-human-remains-and-cannabis-lost-at-sea-following-mission-failure",
      "image_url": "https://www.sciencealert.com/images/2025/07/nyx_capsule_entry.jpg",
      "summary": "Space Cargo of Human Remains And Cannabis Lost at Sea Following Mission Failure By MATTHEW WILLIAMS, UNIVERSE TODAY Artist's impression of The Exploration Company's Nyx capsule in orbit. (The Exploration Company) We've sent some pretty interesting payloads to space since the first satellite (Sputnik 1) launched on October 4th, 1957. As access to space has increased, thanks largely to the...",
      "published": "Tue, 01 Jul 2025 03:05:20 GMT"
    },
    {
      "id": "329ba4628f7276eafe1c96d3c5cd5f8a",
      "title": "Near Antarctica, Saltier Seas Mean Less Ice, Study Finds - The New York Times",
      "source": "The New York Times",
      "url": "https://www.nytimes.com/2025/06/30/climate/antarctic-sea-ice-salinity.html",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Mon, 30 Jun 2025 21:04:22 GMT"
    },
    {
      "id": "532939d3e4dfee95a0fca69cdcb4bdf4",
      "title": "Scientists discover never-before-seen part of human cells — and it looks like a snowman wearing a scarf - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/health/scientists-discover-never-before-seen-part-of-human-cells-and-it-looks-like-a-snowman-wearing-a-scarf",
      "image_url": "https://cdn.mos.cms.futurecdn.net/bsU3QQqVucvhcYbdcmPFHA.jpg",
      "summary": "Reconstruction of Stone Age woman Scientists discover never-before-seen part of human cells — and it looks like a snowman wearing a scarf By Christoph Schwaiger published 22 hours ago Scientists say they captured 3D images of a new organelle they're calling a \"hemifusome,\" which may be a recycling center in human cells. When you purchase through links on our site,...",
      "published": "Mon, 30 Jun 2025 22:00:00 GMT"
    },
    {
      "id": "c328a1bf3fc9e3100ae91b3ba1aaa7ab",
      "title": "First Glimpse of a Cotton Candy Nebula: New Images from Vera C. Rubin Observatory Reveal Stunning Cosmic Beauty - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/cotton-candy-nebula-vera-c-rubin/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/First-Glimpse-of-a-Cotton-Candy-Nebula-New-Images-from-Vera-C.-Rubin-Observatory-Reveal-Stunning-Cosmic-Beauty.jpg",
      "summary": "First Glimpse of a Cotton Candy Nebula: New Images from Vera C. Rubin Observatory Reveal Stunning Cosmic Beauty The Trifid Nebula shines in stunning detail in the first close-up image from the Vera C. Rubin Observatory, offering a breathtaking view of cosmic creation. Image credit: RubinObs/NOIRLab/SLAC/NSF/DOE/AURA | The Daily Galaxy --Great Discoveries Channel The Vera C. Rubin Observatory has unveiled...",
      "published": "Mon, 30 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "10e257f40d89b89440bb9c3f786b3efe",
      "title": "CNSA releases images of Earth and Moon by Tianwen-2 from 590,000 km in deep space - Times of India",
      "source": "Times of India",
      "url": "https://timesofindia.indiatimes.com/science/cnsa-releases-images-of-earth-and-moon-by-tianwen-2-from-590000-km-in-deep-space/articleshow/122178546.cms",
      "image_url": "https://static.toiimg.com/thumb/msid-122178586,width-1070,height-580,imgsize-40136,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "summary": "CNSA Releases Images Of Earth And Moon By Tianwen-2 From 590,000 Km In Deep Space CNSA releases images of Earth and Moon by Tianwen-2 from 590,000 km in deep space TOI Science Desk / TIMESOFINDIA. COM / Jul 1, 2025, 14:09 IST China's Tianwen-2 probe has commenced its decade-long deep space mission, capturing a stunning image of Earth and the...",
      "published": "Tue, 01 Jul 2025 08:39:00 GMT"
    },
    {
      "id": "89d02d49ebf8fe55f7dad110fa631e66",
      "title": "Launch Roundup: Gilmour Space to make debut, SpaceX plans east coast doubleheader - NASASpaceFlight.com -",
      "source": "NASASpaceFlight.com -",
      "url": "https://www.nasaspaceflight.com/2025/06/launch-roundup-063025/",
      "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/06/DSC_2521-scaled.jpeg",
      "summary": "Launch Roundup: Gilmour Space to make debut, SpaceX plans east coast doubleheader written by Tyler Gray June 30, 2025 With the month of June coming to a close and July on the horizon, the global launch manifest remains jam-packed. SpaceX is set to kick off the week with two Falcon 9 launches from Florida, with a Starlink mission and the...",
      "published": "Mon, 30 Jun 2025 17:03:50 GMT"
    },
    {
      "id": "d49658d522b6dad66f03278bc38ee04a",
      "title": "Budget Protest: People Spoke Out – Advocacy Groups Did Nothing - NASA Watch",
      "source": "NASA Watch",
      "url": "https://nasawatch.com/activism/budget-protest-people-spoke-out-advocacy-groups-did-nothing/",
      "image_url": null,
      "summary": "Verify you are human by completing the action below. nasawatch.com needs to review the security of your connection before proceeding. Performance & security by Cloudflare",
      "published": "Mon, 30 Jun 2025 16:33:02 GMT"
    },
    {
      "id": "6ba172b30c98804933bf4e277209f5be",
      "title": "Scientists Just Discovered a Creature That Breaks the Rules of Life - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/scientists-just-discovered-creature-breaks-053515983.html",
      "image_url": "https://media.zenfs.com/en/men_s_journal_718/7afd515b6032e44a252bcc3975c1cad6",
      "summary": "Scientists Just Discovered a Creature That Breaks the Rules of Life Tue, July 1, 2025 at 5:35 AM UTC In the ever-expanding universe of microscopic life, scientists have uncovered something that might force us to redraw the boundaries of what counts as “alive. ” Meet Sukunaarchaeum mirabile, a tiny cellular oddity recently discovered by researchers in Canada and Japan, according...",
      "published": "Tue, 01 Jul 2025 05:35:00 GMT"
    },
    {
      "id": "8cc024f65a85f1adf1031578b84942ad",
      "title": "Was ancient Mars habitable? NASA's Perseverance rover is grinding into a 'weird, uncooperative' rock to find out - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/mars-rovers/was-ancient-mars-habitable-nasas-perseverance-rover-is-grinding-into-a-weird-uncooperative-rock-to-find-out",
      "image_url": "https://cdn.mos.cms.futurecdn.net/7UrHy3yVTnMC2eM4NcCKqL.png",
      "summary": "Daytime fireball meteorite hits house! Space Exploration Missions Mars Rovers Was ancient Mars habitable? NASA's Perseverance rover is grinding into a 'weird, uncooperative' rock to find out By Samantha Mathewson published yesterday NASA's Perseverance rover is digging deeper into Mars' geologic past as it begins grinding into rock surfaces to expose material that could hold clues to the planet's ancient...",
      "published": "Mon, 30 Jun 2025 19:00:00 GMT"
    },
    {
      "id": "9772b3bd8730f469025b73f1fa6714bb",
      "title": "World Asteroid Day 2025: Watch live views of near-Earth asteroids for free online on June 30 - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/world-asteroid-day-2025",
      "image_url": "https://cdn.mos.cms.futurecdn.net/8w59hzqWAvnRUyPCS5ng5n.jpg",
      "summary": "Daytime fireball meteorite hits house! World Asteroid Day 2025: Watch live views of near-Earth asteroids for free online on June 30 By Anthony Wood published yesterday Because you don’t wanna miss a thing. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A visualization of near-Earth asteroids (Image credit: NASA) World...",
      "published": "Mon, 30 Jun 2025 13:33:05 GMT"
    },
    {
      "id": "058230d016cea80c0731eea92f3daee1",
      "title": "Look: NASA Satellite Images Reveal Mysterious Blast Site of 1908 Tunguska Event that Scorched Remote Siberia - The Debrief",
      "source": "The Debrief",
      "url": "https://thedebrief.org/look-nasa-satellite-images-reveal-mysterious-blast-site-of-1908-tunguska-event-that-scorched-remote-siberia/",
      "image_url": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/06/Tunguska-blast-EO-image-boxed.jpg",
      "summary": "(Credit: NASA/Earth Observatory) A fiery explosion tore through the skies over Eastern Siberia on the morning of June 30, 1908, decimating more than 830 square miles of frozen taiga in what remains the largest asteroid-related blast in recorded history. Known as the Tunguska event, today it serves as a stark reminder of potential dangers presented by space objects that cross...",
      "published": "Mon, 30 Jun 2025 19:12:52 GMT"
    },
    {
      "id": "b7e807d0b09e90d61c31a1ab32ab59d8",
      "title": "How can the James Webb Space Telescope see so far? - The Conversation",
      "source": "The Conversation",
      "url": "https://theconversation.com/how-can-the-james-webb-space-telescope-see-so-far-257421",
      "image_url": "https://images.theconversation.com/files/672026/original/file-20250603-56-52fim0.png?ixlib=rb-4.1.0&rect=0%2C723%2C4159%2C2079&q=45&auto=format&w=1356&h=668&fit=crop",
      "summary": "This is a James Webb Space Telescope image of NGC 604, a star-forming region about 2. 7 million light-years from Earth. NASA/ESA/CSA/STScI How can the James Webb Space Telescope see so far? Published: June 30, 2025 8:31am EDT Assistant Professor of Astronomy and Astrophysics, University of Maryland, Baltimore County Adi Foord does not work for, consult, own shares in or...",
      "published": "Mon, 30 Jun 2025 12:31:18 GMT"
    },
    {
      "id": "5a2fbe66e7092283e938ac193d45c96a",
      "title": "'This is the holy grail of theoretical physics.' Is the key to quantum gravity hiding in this new way to make black holes? - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/black-holes/this-is-the-holy-grail-of-theoretical-physics-is-the-key-to-quantum-gravity-hiding-in-this-new-way-to-make-black-holes",
      "image_url": "https://cdn.mos.cms.futurecdn.net/S5ST72DPBYHiUXEH7eNTUQ.png",
      "summary": "Daytime fireball meteorite hits house! 'This is the holy grail of theoretical physics. ' Is the key to quantum gravity hiding in this new way to make black holes? By Robert Lea published 7 hours ago \"This work is a step toward understanding how quantum mechanics and gravity work together, a major unsolved problem in physics. \" When you purchase...",
      "published": "Tue, 01 Jul 2025 13:00:00 GMT"
    },
    {
      "id": "1ee2fa26089d0ee904ca88563be034a6",
      "title": "Geologists say these rocks are the oldest ever found on Earth - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/earths-oldest-known-rocks-formed-over-four-billion-years-ago/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/27102230/old-rocks.jpg",
      "summary": "Geologists say these rocks are the oldest ever found on Earth The story of Earth begins long before forests, oceans, or even life itself. Deep beneath our feet lie ancient stones that silently preserve the secrets of our planet’s earliest days. These fragments of Earth’s crust, forged during a time of violent formation and fiery beginnings, are nearly impossible to...",
      "published": "Mon, 30 Jun 2025 07:00:00 GMT"
    },
    {
      "id": "123f111abf42b83ef1022191d08724c9",
      "title": "Tuesday Telescope: A howling wolf in the night sky - Ars Technica",
      "source": "Ars Technica",
      "url": "https://arstechnica.com/space/2025/07/tuesday-telescope-a-howling-wolf-in-the-night-sky/",
      "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/WR134-2560x1440.jpg",
      "summary": "Tuesday Telescope: A howling wolf in the night sky \"Ever since I saw it for the first time, it's been high on my list. \" WR 134, a Wolf-Rayet Star in the constellation Cygnus. Credit: Chris McGrew Welcome to the Tuesday Telescope. There is a little too much darkness in this world and not enough light—a little too much pseudoscience...",
      "published": "Tue, 01 Jul 2025 11:00:59 GMT"
    },
    {
      "id": "5d50257b09dc06b46914f79f28fd5ed6",
      "title": "Astronomers discover 'raw materials for life' can form in planetary systems even before stars - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/astronomers-discover-raw-materials-for-life-can-form-in-planetary-systems-even-before-stars",
      "image_url": "https://cdn.mos.cms.futurecdn.net/VtpadrXv2SyLpykkHSwJzT.jpg",
      "summary": "Daytime fireball meteorite hits house! Astronomers discover 'raw materials for life' can form in planetary systems even before stars By Victoria Corless published yesterday \"Each new detection brings us closer to understanding the origins of complex organic chemistry in the universe — and perhaps, the origins of the building blocks of life themselves. \" When you purchase through links on...",
      "published": "Mon, 30 Jun 2025 16:00:00 GMT"
    },
    {
      "id": "70d3e6e32b789ed9cedf5e6a36f5ca35",
      "title": "Long-dead satellite emits strong radio signal, puzzling astronomers - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/long-dead-satellite-emits-strong-005251266.html",
      "image_url": "https://media.zenfs.com/en/cnn_articles_875/bc5c3e57708f8dfb00c890e19c20e398",
      "summary": "Tillis retiring after Trump attack Long-dead satellite emits strong radio signal, puzzling astronomers Tue, July 1, 2025 at 12:52 AM UTC The ASKAP radio telescope in Western Australia picked up a powerful radio signal from a NASA satellite that stopped working in 1967. - Alex Cherney/CSIRO Astronomers in Australia picked up a strange radio signal in June 2024 — one...",
      "published": "Tue, 01 Jul 2025 00:52:00 GMT"
    },
    {
      "id": "32fa294e99a65949c83fe9bfb9de92a5",
      "title": "'Never been seen before': First images from new ISS solar telescope reveal subtle 'fluctuations' in sun's outer atmosphere - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/the-sun/never-been-seen-before-first-images-from-new-iss-solar-telescope-reveal-subtle-fluctuations-in-suns-outer-atmosphere",
      "image_url": "https://cdn.mos.cms.futurecdn.net/xwxP95ak8QyvqFn6Ebjnbi.gif",
      "summary": "'Never been seen before': First images from new ISS solar telescope reveal subtle 'fluctuations' in sun's outer atmosphere By Harry Baker published yesterday NASA's new \"CODEX\" telescope has snapped its first photos of the sun's outer atmosphere, revealing previously imperceptible changes that could help scientists better predict potentially dangerous space weather events. When you purchase through links on our site,...",
      "published": "Mon, 30 Jun 2025 16:38:25 GMT"
    },
    {
      "id": "cbca71167260afc360f0578dc8c7865a",
      "title": "'Like finding a tropical seed in Arctic ice,' how a surprise mineral could change the history of asteroid Ryugu - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/asteroids/like-finding-a-tropical-seed-in-arctic-ice-how-a-surprise-mineral-could-change-the-history-of-asteroid-ryugu",
      "image_url": "https://cdn.mos.cms.futurecdn.net/BzXLC4u4TiN3PbXFsn3yYd.jpg",
      "summary": "Daytime fireball meteorite hits house! Astronomy Solar System Asteroids 'Like finding a tropical seed in Arctic ice': How a surprise mineral could change the history of asteroid Ryugu By Keith Cooper published 10 hours ago \"Its occurrence is like finding a tropical seed in Arctic ice – indicating either an unexpected local environment or long-distance transport in the early solar...",
      "published": "Tue, 01 Jul 2025 10:00:00 GMT"
    },
    {
      "id": "0c1f9302787ab015c6e39560a5d2f6ed",
      "title": "“Scariest Fact You Know”: 50 Posts From A Page That Isn’t Afraid To Dive Into The Darkest Topics - Bored Panda",
      "source": "Bored Panda",
      "url": "https://www.boredpanda.com/dark-themes-questions-answers/",
      "image_url": "https://www.boredpanda.com/blog/wp-content/uploads/2025/07/dark-themes-questions-answers-fb-6863d0baf0751.png",
      "summary": "If you wish to opt-out of the sale, sharing to third parties, or processing of your personal information for targeted advertising by us, please use the opt-out section in Manage Preferences section . Please note that after your opt-out request is processed you may continue seeing interest-based ads based on personal information utilized by us or personal information disclosed to...",
      "published": "Tue, 01 Jul 2025 02:25:30 GMT"
    }
  ]
}