{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-07 06:39:01",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "c404f0b0253f24b48ba7318db88e27e3",
      "title": "James Webb telescope unveils largest-ever map of the universe, stretching from present day to the dawn of time - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/cosmology/scientists-unveil-the-largest-map-of-the-universe-spanning-over-13-billion-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/j4odWTSBih9XMXxBtG9Lkf.jpg",
      "summary": "Physicists capture 'second sound' James Webb telescope unveils largest-ever map of the universe, spanning over 13 billion years By Damien Pine published 7 hours ago The largest map of the universe, created with data from the James Webb Space Telescope, shows almost 800,000 galaxies crammed into a tiny piece of sky and spanning almost all of time. When you purchase...",
      "published": "Fri, 06 Jun 2025 23:06:00 GMT"
    },
    {
      "id": "6975fdb8175d6d48ff9bd26f4754ad87",
      "title": "A Japanese lander crashed on the Moon after losing track of its location - Ars Technica",
      "source": "Ars Technica",
      "url": "https://arstechnica.com/space/2025/06/a-japanese-lander-crashed-on-the-moon-after-losing-track-of-its-location/",
      "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/ispace_ceo-1152x648.jpeg",
      "summary": "A Japanese lander crashed on the Moon after losing track of its location \"It’s not impossible, so how do we overcome our hurdles? \" Takeshi Hakamada, founder and CEO of ispace, attends a press conference in Tokyo on June 6, 2025, to announce the outcome of his company's second lunar landing attempt. Credit: Kazuhiro Nogi/AFP via Getty Images A robotic...",
      "published": "Fri, 06 Jun 2025 17:30:15 GMT"
    },
    {
      "id": "0beac0d44cbbbbacad012dbf8e73b482",
      "title": "Saving Gateway, SLS and Orion? Sen. Ted Cruz proposes $10 billion more for NASA's moon and Mars efforts - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/saving-gateway-sls-and-orion-sen-ted-cruz-proposes-usd10-billion-more-for-nasas-moon-and-mars-efforts",
      "image_url": "https://cdn.mos.cms.futurecdn.net/fYpfiMXCii2kVGExBEekvZ.jpg",
      "summary": "Fate of ispace moon lander in doubt Saving Gateway, SLS and Orion? Sen. Ted Cruz proposes $10 billion more for NASA's moon and Mars efforts By Leonard David published 10 hours ago Sen. Ted Cruz's newly unveiled legislative directives for Senate Republicans’ budget reconciliation bill would dedicate almost $10 billion to help win the \"new space race\" with China. When...",
      "published": "Fri, 06 Jun 2025 20:16:32 GMT"
    },
    {
      "id": "2b2ed9fc556b0bc742ef59de069a644f",
      "title": "If books could kill: The poison legacy lurking in libraries - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g2y9xq58no",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b804/live/51328d10-42fa-11f0-9630-fd015488de94.jpg",
      "summary": "If books could kill: The poison legacy lurking in libraries BBC Scotland Arts Correspondent Green dye was widely used in Victorian publishing The Victorians loved the colour green. In particular, they loved a vibrant shade of emerald created by combining copper and arsenic, which was used in everything from wallpaper to children's toys. \"This colour was very popular for most...",
      "published": "Fri, 06 Jun 2025 21:57:09 GMT"
    },
    {
      "id": "c14d9b806c2abdd21c7b70d3d310a789",
      "title": "How NASA Plans To Deal With Death In Space - Jalopnik",
      "source": "Jalopnik",
      "url": "https://www.jalopnik.com/1879088/how-nasa-plans-to-deal-with-death-in-space/",
      "image_url": "https://www.jalopnik.com/img/gallery/how-nasa-plans-to-deal-with-death-in-space/l-intro-1749181628.jpg",
      "summary": "© 2025 Static Media. All Rights Reserved How NASA Plans To Deal With Death In Space While America's space program has endured several tragedies, no mission has left the remains of a lost astronaut floating in the final frontier. NASA is understandably prepared if that worst-case scenario ever arises. The agency organized protocols if an astronaut were to die on...",
      "published": "Fri, 06 Jun 2025 19:25:00 GMT"
    },
    {
      "id": "2536547287e8aec60c2ec7b33949eaaf",
      "title": "Live coverage: SpaceX to launch SXM-10 satellite for SiriusXM on Falcon 9 rocket from Cape Canaveral - Spaceflight Now",
      "source": "Spaceflight Now",
      "url": "https://spaceflightnow.com/2025/06/06/live-coverage-spacex-to-launch-sxm-10-satellite-for-siriusxm-on-falcon-9-rocket-from-cape-canaveral/",
      "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_SXM-10_satellite_small.jpeg",
      "summary": "SpaceX launches SXM-10 satellite for SiriusXM on Falcon 9 rocket from Cape Canaveral SpaceX launches SXM-10 satellite for SiriusXM on Falcon 9 rocket from Cape Canaveral June 6, 2025 Will Robinson-Smith SpaceX launches its Falcon 9 rocket on June 7, 2025 at 12:54 a. m. EDT (0454 UTC) in support of the SXM-10 mission from Space Launch Complex 40 at...",
      "published": "Fri, 06 Jun 2025 05:11:04 GMT"
    },
    {
      "id": "e8fd3d6fb84ff02fa16ccebb7f08410c",
      "title": "NASA Mars Orbiter Captures Volcano Peeking Above Morning Cloud Tops - NASA Jet Propulsion Laboratory (JPL) (.gov)",
      "source": "NASA Jet Propulsion Laboratory (JPL) (.gov)",
      "url": "https://www.jpl.nasa.gov/news/nasa-mars-orbiter-captures-volcano-peeking-above-morning-cloud-tops/",
      "image_url": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/PIA26557-THEMIS-Views-Mars-Arsia-Mons-Volcano-crop1.jpg",
      "summary": "NASA Mars Orbiter Captures Volcano Peeking Above Morning Cloud Tops Arsia Mons, an ancient Martian volcano, was captured before dawn on May 2, 2025, by NASA’s 2001 Mars Odyssey orbiter while the spacecraft was studying the Red Planet’s atmosphere, which appears here as a greenish haze. come Credit: NASA/JPL-Caltech/ASU The 2001 Odyssey spacecraft captured a first-of-its-kind look at Arsia Mons,...",
      "published": "Fri, 06 Jun 2025 17:24:44 GMT"
    },
    {
      "id": "24645bd893845f39753f05071841f103",
      "title": "Worms Caught Creating Superorganisms in the Wild for the First Time - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/worms-caught-creating-superorganisms/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/worms-caught-creating-superorganisms-in-the-wild-for-the-first-time.jpg",
      "summary": "Worms Caught Creating Superorganisms in the Wild for the First Time Scientists capture tiny worms creating towering “superorganisms” in the wild. Image credit: Daniela Perez | Indian Defence Review In a groundbreaking discovery, scientists have observed tiny nematode worms forming “superorganisms” by creating towering structures in the wild, a behavior previously only observed under experimental conditions. This phenomenon, captured by...",
      "published": "Fri, 06 Jun 2025 19:45:00 GMT"
    },
    {
      "id": "ce296db4c6a0865bbe550274c53964bb",
      "title": "Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time - Daily Mail",
      "source": "Daily Mail",
      "url": "https://www.dailymail.co.uk/sciencetech/article-14787095/Earth-CO2-hits-highest-human-history.html",
      "image_url": "https://i.dailymail.co.uk/1s/2025/06/06/13/99109319-0-image-m-7_1749213192584.jpg",
      "summary": "Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time ever READ MORE: Experts call for urgent action as Britain records its hottest spring By JONATHAN CHADWICK FOR MAILONLINE PUBLISHED: 08:33 EDT, 6 June 2025 | UPDATED: 11:40 EDT, 6 June 2025 There's now more carbon dioxide (CO2) in the atmosphere...",
      "published": "Fri, 06 Jun 2025 12:33:23 GMT"
    },
    {
      "id": "dcbd44372719545dc30203dd925e99ba",
      "title": "Astronomers Discover Most Energetic Cosmic Explosions Ever Observed - Gizmodo",
      "source": "Gizmodo",
      "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOTkFlMHZhdmFYSF9pLVVCTlRUMm43QTlCYVp6NkpSZ0xzVXllRmRiNkFDUGZPOEdTdy1iczRrV2lkaEVtZzA2TEFzaVgwT0VHSVE5R18xclV1Vnd2cEJ3LVNMdnZmMTdPb3dzVlZMdFNHa3JaeWozNkxiazBrZGFhSVcyZGp0QTJfVWQ0c3NJS0VWbHRiSXU4V3oyX05HTUk?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Thu, 05 Jun 2025 19:35:29 GMT"
    },
    {
      "id": "f53f0a64282c1c2fb122815511f16535",
      "title": "Asteroid 2024 YR4 Could Strike the Moon: NASA’s Webb Telescope Warns - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/asteroid-2024-yr4-could-strike-the-moon/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Asteroid-2024-YR4-Could-Strike-the-Moon-NASAs-Webb-Telescope-Warns.jpg",
      "summary": "Asteroid 2024 YR4 Could Strike the Moon: NASA’s Webb Telescope Warns NASA’s Webb Telescope has raised the alarm as asteroid 2024 YR4’s odds of striking the Moon soar. Credit: NASA/JPL Center for Near-Earth Object Studies | The Daily Galaxy --Great Discoveries Channel NASA’s James Webb Space Telescope has provided a new update on asteroid 2024 YR4, revealing important findings that...",
      "published": "Fri, 06 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "43d97c157c875f497e61bda52b8ff66b",
      "title": "Rocket Report: SpaceX’s 500th Falcon launch; why did UK’s Reaction Engines fail? - Ars Technica",
      "source": "Ars Technica",
      "url": "https://arstechnica.com/space/2025/06/rocket-report-spacexs-500th-falcon-launch-why-did-uks-reaction-engines-fail/",
      "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/GettyImages-2218001075-1152x648.jpg",
      "summary": "Rocket Report: SpaceX’s 500th Falcon launch; why did UK’s Reaction Engines fail? SpaceX's rockets make a lot more noise, but the machinations of Texas' newest city are underway. Prefabricated homes painted black, white, and gray are set against the backdrop of SpaceX's Starship rocket factory at Starbase, Texas. Credit: Sergio Flores/AFP via Getty Images Welcome to Edition 7. 47 of...",
      "published": "Fri, 06 Jun 2025 11:00:17 GMT"
    },
    {
      "id": "565b560d27244988b33f3442144c51f6",
      "title": "Milky Way has 50-50 chance of colliding with neighbor galaxy - NewsNation",
      "source": "NewsNation",
      "url": "https://www.newsnationnow.com/space/milky-way-collision-andromeda/",
      "image_url": "https://www.newsnationnow.com/wp-content/themes/the-hill/assets/the-hill-logo-horizontal.svg",
      "summary": "Press & Hold to confirm you are Reference ID f49e89ee-4369-11f0-b514-a1adceca0190",
      "published": "Thu, 05 Jun 2025 20:17:41 GMT"
    },
    {
      "id": "9fd45209aa2143b13eac927f847fb57a",
      "title": "500-Million-Year-Old Mystery Fossil Rewrites Early Animal Evolution - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/500-million-year-old-mystery-fossil-rewrites-early-animal-evolution/",
      "image_url": "https://scitechdaily.com/images/3D-Spine-Arrangement-and-Apical-Orifice-Structure-in-the-Top-End-of-a-Shishania-Fossil-Specimen-scaled.jpg",
      "summary": "Home»Science»500-Million-Year-Old Mystery Fossil Rewrites Early Animal Evolution 500-Million-Year-Old Mystery Fossil Rewrites Early Animal Evolution The top end of a specimen of Shishania, showing the three-dimensionality of its spines and their arrangement around an apical orifice. Credit: Zhang Xiguang A Cambrian fossil once thought to be a mollusk ancestor is now identified as a chancelloriid relative, reshaping ideas about early animal...",
      "published": "Sat, 07 Jun 2025 01:43:44 GMT"
    },
    {
      "id": "5bc8d745aeeffe29745c994f534f9350",
      "title": "Astronomers Discover Giant Planet Orbiting Tiny Star, Defying Planet Formation Theories - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/giant-planet-orbiting-tiny-star/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Astronomers-Discover-Giant-Planet-Orbiting-Tiny-Star-Defying-Planet-Formation-Theories.jpg",
      "summary": "Astronomers Discover Giant Planet Orbiting Tiny Star, Defying Planet Formation Theories Astronomers have discovered a giant planet orbiting an incredibly small star. Credit: University of Warwick/Mark Garlick | The Daily Galaxy --Great Discoveries Channel A groundbreaking discovery in the field of exoplanet research is forcing scientists to reconsider long-held theories about how planets form. An international team of astronomers, led...",
      "published": "Thu, 05 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "2e4aee6701e9e5b498e6d3274beca4de",
      "title": "ESA’s Bug-Eyed Robot Telescope Just Spotted Its First Asteroid — And It Could Save the Planet - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/esa-bug-eyed-robot-telescope-asteroid/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/ESAs-Bug-Eyed-Robot-Telescope-Just-Spotted-Its-First-Asteroid-—-And-It-Could-Save-the-Planet.jpg",
      "summary": "ESA’s Bug-Eyed Robot Telescope Just Spotted Its First Asteroid — And It Could Save the Planet ESA’s new Flyeye telescope has opened its eye to the cosmos, kicking off a bold, automated mission to spot dangerous asteroids before they spot us. Credit: ESA / Pietro Moliterni | The Daily Galaxy --Great Discoveries Channel The European Space Agency (ESA) has officially...",
      "published": "Fri, 06 Jun 2025 15:35:00 GMT"
    },
    {
      "id": "884e71a22def625a9c9e68b5f1ded694",
      "title": "\"It Was a Crazy Idea\": James Webb Space Telescope Confirms Dramatic Phenomenon On Pluto - The Debrief",
      "source": "The Debrief",
      "url": "https://thedebrief.org/it-was-a-crazy-idea-james-webb-space-telescope-confirms-dramatic-phenomenon-on-pluto/",
      "image_url": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/06/James-Webb-Space-Telescope-Pluto.jpeg",
      "summary": "James Webb Space Telescope (JWST) observations indicate that Pluto’s atmosphere is unlike any other in the solar system, confirming a 2017 hypothesis and potentially revealing how the early Earth developed a habitable atmosphere from its nitrogen and hydrocarbon beginnings. Pluto is covered in a haze of nitrogen, methane, and carbon dioxide, whose individual particles regulate the atmosphere’s energy balance as...",
      "published": "Fri, 06 Jun 2025 14:24:02 GMT"
    },
    {
      "id": "ff013881574e138fe6115c03ca6f6bf9",
      "title": "A surprising study revealed biological activity on a distant planet. Weeks later, scientists say there’s more to the story - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/06/science/k218b-studies-planet-habitability",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/230914141939-exoplanet-k2-18b.jpg?c=16x9&q=w_800,c_fill",
      "summary": "A surprising study revealed biological activity on a distant planet. Weeks later, scientists say there’s more to the story Updated 10:54 AM EDT, Fri June 6, 2025 An artist's concept shows what K2-18b might look like. Thought to be covered entirely in liquid water with a hydrogen-rich atmosphere, the exoplanet may be a good place to look for biological activity.",
      "published": "Fri, 06 Jun 2025 14:54:00 GMT"
    },
    {
      "id": "189039c87625f5393614ce4126d468ff",
      "title": "First Map Made of a Solid’s Secret Quantum Geometry - Quanta Magazine",
      "source": "Quanta Magazine",
      "url": "https://www.quantamagazine.org/first-map-made-of-a-solids-secret-quantum-geometry-20250606/",
      "image_url": "https://www.quantamagazine.org/wp-content/uploads/2025/06/Quantum-Information-Shape_crMark-Belan-Social.jpg",
      "summary": "First Map Made of a Solid’s Secret Quantum Geometry Physicists recently mapped the hidden shape that underlies the quantum behaviors of a crystal, using a new method that’s expected to become ubiquitous. The possible quantum states of a crystal carve out a curved shape. Famously, at the quantum scale, particles can be in multiple possible locations at once. A particle’s...",
      "published": "Fri, 06 Jun 2025 14:15:00 GMT"
    },
    {
      "id": "27bc811a3383f735da5598c927e091c5",
      "title": "NASA withdraws support for conferences - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/nasa-withdraws-support-for-conferences/",
      "image_url": "https://spacenews.com/wp-content/uploads/2025/06/issrdc-montalbano.webp",
      "summary": "Covering the business and politics of space NASA withdraws support for conferences NASA had used the ISS Research and Development Conference to discuss the status and future plans for the station, such as this panel discussion at the 2023 event. Credit: SpaceNews/Jeff Foust Updated 9:20 a. m. Eastern with LPI statement. WASHINGTON — A space station research conference has been...",
      "published": "Thu, 05 Jun 2025 11:37:10 GMT"
    }
  ]
}