{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-09 12:59:53",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "8469cf69ab40a41f9134e2dcff37cb82",
      "title": "'What a waste.' US scientists decry Trump's 47% cuts to NASA science budget - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/what-a-waste-us-scientists-decry-trumps-47-percent-cuts-to-nasa-science-budget",
      "image_url": "https://cdn.mos.cms.futurecdn.net/sk9xpGRCo5nZA4HkuhbXBd.jpg",
      "summary": "Fate of ispace moon lander in doubt 'What a waste:' US scientists decry Trump's 47% cuts to NASA science budget By Monisha Ravisetti published 4 hours ago \"I don't think it is an overstatement to say that morale among U. S.-based scientists is at an all-time low. \" Since January, when President Donald Trump took office for the second time,...",
      "published": "Mon, 09 Jun 2025 09:00:00 GMT"
    },
    {
      "id": "6d86c80abae21c62b9c92da603cf173f",
      "title": "Monster black hole M87 is spinning at 80% of the cosmic speed limit — and pulling in matter even faster - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/black-holes/monster-black-hole-m87-is-spinning-at-80-percent-of-the-cosmic-speed-limit-and-pulling-in-matter-even-faster",
      "image_url": "https://cdn.mos.cms.futurecdn.net/2YNt5o9mjhzRLEoanE2T8D.jpg",
      "summary": "Monster black hole M87 is spinning at 80% of the cosmic speed limit — and pulling in matter even faster By Mark Thompson published yesterday The famous black hole M87 keeps surprising us. New research calculates its spin speed to be at 80% of the theoretical limit, with matter falling into its maw even faster. When you purchase through links...",
      "published": "Sun, 08 Jun 2025 12:00:00 GMT"
    },
    {
      "id": "416e421777a9f6bdb922d8449235c39c",
      "title": "Get ready for June’s strawberry moon - WTOP",
      "source": "WTOP",
      "url": "https://wtop.com/the-space-place/2025/06/get-ready-for-junes-strawberry-moon/",
      "image_url": "https://wtop.com/wp-content/uploads/2025/05/GettyImages-1325452488-scaled.jpg",
      "summary": "This website utilizes technologies such as cookies to enable essential site functionality, as well as for analytics, personalization, and targeted advertising. Privacy Policy This website utilizes technologies such as cookies to enable essential site functionality, as well as for analytics, personalization, and targeted advertising. Privacy Policy This website utilizes technologies such as cookies to enable essential site functionality, as well...",
      "published": "Mon, 09 Jun 2025 08:11:37 GMT"
    },
    {
      "id": "96709473e67eedd12c72447936779c39",
      "title": "Mars Orbiter Captures Rare View of Ancient Volcano Poking Above the Clouds - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/mars-orbiter-captures-rare-view-of-ancient-volcano-poking-above-the-clouds-2000612585",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/NASA_volcano-1200x675.jpg",
      "summary": "Mars Orbiter Captures Rare View of Ancient Volcano Poking Above the Clouds One of Mars' tallest volcanoes peeps over a thick layer of clouds, in Odyssey’s first picture of Arsia Mons peering over the Red Planet's horizon. Published June 9, 2025 | Comments (1) | Arsia Mons, an ancient Martian volcano, was captured before dawn on May 2, 2025, by...",
      "published": "Mon, 09 Jun 2025 10:00:41 GMT"
    },
    {
      "id": "9f2c5dfdf0a72fabf944a22d644f26ea",
      "title": "NASA's Parker Solar Probe spots powerful magnetic explosion aimed at the sun's surface - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/the-sun/nasas-parker-solar-probe-spots-powerful-magnetic-explosion-aimed-at-the-suns-surface",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Zpi5utcf7zdggoutDiBEgB.jpg",
      "summary": "Physicists capture 'second sound' NASA's Parker Solar Probe spots powerful magnetic explosion aimed at the sun's surface By Damien Pine published 22 hours ago NASA's Parker Solar Probe has directly observed a powerful magnetic explosion in the sun's corona that could help us predict geomagnetic storms on Earth. When you purchase through links on our site, we may earn an...",
      "published": "Sun, 08 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "c8309de7b3738a099abd2c88100d67a4",
      "title": "China's Tianwen 2 spacecraft sends home 1st photo as it heads for mysterious 'quasi-moon' asteroid - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/chinas-tianwen-2-spacecraft-sends-100000241.html",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/n0lRKX.5Y4Omop1wrzMcTA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/774a220893924e075a6dba5711eb1cc1",
      "summary": "Trump's travel ban takes effect Travis Decker manhunt: New images China's Tianwen 2 spacecraft sends home 1st photo as it heads for mysterious 'quasi-moon' asteroid Sun, June 8, 2025 at 10:00 AM UTC When you buy through links on our articles, Future and its syndication partners may earn a commission. One of the Tianwen 2 asteroid probe's solar arrays, photographed...",
      "published": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "668d10316956c4aa55f2dc56b56fd4cd",
      "title": "Vandenberg’s Next Mission: SpaceX Rocket Launch on Sunday - Noozhawk",
      "source": "Noozhawk",
      "url": "https://www.noozhawk.com/vandenbergs-next-mission-spacex-rocket-launch-on-sunday-060725/",
      "image_url": "https://i0.wp.com/www.noozhawk.com/wp-content/uploads/2022/12/social-fallback.png?fit=1200%2C630&quality=80&ssl=1",
      "summary": "The freshest news in Santa Barbara County Vandenberg’s Next Mission: SpaceX Rocket Launch on Sunday by Janene Scully | Noozhawk North County Editor What: Falcon 9 rocket launch from Vandenberg Space Force Base in Santa Barbara County. When: 6:34 a. m. Sunday with other options until 10:34 a. m., according to SpaceX. If needed, the team has backup opportunities starting...",
      "published": "Sat, 07 Jun 2025 17:33:02 GMT"
    },
    {
      "id": "321f3179db923a8571b9e4f9448886de",
      "title": "The Dogs of Chernobyl Are Experiencing Rapid Evolution, Study Suggests - MSN",
      "source": "MSN",
      "url": "https://www.msn.com/en-us/news/technology/the-dogs-of-chernobyl-are-experiencing-rapid-evolution-study-suggests/ar-AA1Gjeiy",
      "image_url": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1uRziS.img?w=612&h=307&m=4&q=75",
      "summary": "Upgrade your Chrome browser with MSN New Tab Get localized weather, trending news, AI powered search and more The Dogs of Chernobyl Are Experiencing Rapid Evolution, Study Suggests Story by Darren Orf • 1d • 3 min read A study analyzed the DNA of feral dogs living near Chernobyl, compared the animals to others living 10 miles away, and found...",
      "published": "Sun, 08 Jun 2025 14:08:26 GMT"
    },
    {
      "id": "1556e4cdbd8ccc2dd5e04b653883b792",
      "title": "Astronomers thought the Milky Way was doomed to crash into Andromeda. Now they're not so sure - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-astronomers-thought-milky-doomed-andromeda.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 20.161.78.104 : 59005b86-a0e0-4990-9553-5ed9c6f5",
      "published": "Sat, 07 Jun 2025 17:40:01 GMT"
    },
    {
      "id": "b918cb135f0f1988a9e85fc761093630",
      "title": "Librarians breathe easy as tool spots toxic book pigment - The Times",
      "source": "The Times",
      "url": "https://www.thetimes.com/uk/science/article/scientists-protect-librarians-poisonous-books-containing-arsenic-rb6pvkbs5",
      "image_url": "https://www.thetimes.com/imageserver/image/%2Fc0aea6e8-29f5-45a6-8355-3fedf3ba2ce9.jpg?crop=720%2C405%2C0%2C288&resize=1200",
      "summary": "Now showing content from the last twelve months, not just the past six days. Librarians breathe easy as tool spots toxic book pigment Scientists have developed a scanner to find arsenic-laced green pigment after thousands of Victorian tomes were removed from public shelves for health reasons The handheld device is able to detect the toxic pigment through light reflections Nicola...",
      "published": "Sun, 08 Jun 2025 17:00:53 GMT"
    },
    {
      "id": "325cb5b56ac7196cfa5d19ba6c5d7571",
      "title": "Starliner future plans still in limbo - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/starliner-future-plans-still-in-limbo/",
      "image_url": "https://spacenews.com/wp-content/uploads/2025/02/53988402529_bec93e5a26_k.jpg",
      "summary": "Covering the business and politics of space Starliner future plans still in limbo Boeing's Starliner undocks from the International Space Station at the conclusion of the Crew Flight Test mission. Credit: NASA WASHINGTON — A year after the launch of a flawed crewed test flight of Boeing’s CST-100 Starliner, NASA has yet to determine the next mission for the spacecraft...",
      "published": "Sun, 08 Jun 2025 22:15:33 GMT"
    },
    {
      "id": "f67e74253d8049b060ebd19fbc5a7840",
      "title": "New map shows Bay Area locations with highest risk of ember-driven wildfires - East Bay Times",
      "source": "East Bay Times",
      "url": "https://www.eastbaytimes.com/2025/06/07/flying-embers-my-god-new-map-bay-area-highest-risk-firebrand-wildfires/",
      "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2025/06/SJM-L-NASAEMBERS-0607-2-1.jpg?w=1024&h=683",
      "summary": "New map shows Bay Area locations with highest risk of ember-driven wildfires Recent deadly firestorms highlight danger of smoldering fragments spread by winds Embers fly in the high winds as a firefighter battles the Franklin Fire in Malibu, Calif. , on Tuesday, Dec. 10, 2024. Embers can send spot fires far ahead of a main blaze, ignite yard plants, and...",
      "published": "Sat, 07 Jun 2025 23:42:35 GMT"
    },
    {
      "id": "e05f5ff30533548db7a20a6d255b4afa",
      "title": "New evidence suggests cosmic expansion may reverse and cause the Universe to implode in a spectacular finale - BBC Sky at Night Magazine",
      "source": "BBC Sky at Night Magazine",
      "url": "https://www.skyatnightmagazine.com/news/cosmic-expansion-may-reverse-cause-universe-implode",
      "image_url": "https://c02.purpledshub.com/uploads/sites/48/2022/02/big-bang-1bbaa5c.jpg?w=1200",
      "summary": "New Evidence Suggests Cosmic Expansion May Reverse And Cause The Universe To Implode In A Spectacular Finale",
      "published": "Sun, 08 Jun 2025 05:34:04 GMT"
    },
    {
      "id": "114c479bf82d753c30caf6caed0fc06f",
      "title": "A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/one-planet-revealing-why-hard-140114753.html",
      "image_url": "https://media.zenfs.com/en/cnn_articles_875/422d58aa4c615937143c7adef9e22995",
      "summary": "Trump's travel ban takes effect Travis Decker manhunt: New images A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story Sun, June 8, 2025 at 1:33 AM UTC An artist's concept shows what K2-18b might look like. Thought to be covered entirely in liquid water with a hydrogen-rich atmosphere, the...",
      "published": "Sun, 08 Jun 2025 01:33:00 GMT"
    },
    {
      "id": "e74f6c5b8991406169a04d628b0a52cc",
      "title": "Scientists photograph whales blowing 'bubble smoke rings' to communicate with humans - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/whales-blow-bubble-smoke-rings-near-humans-to-communicate/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/08105337/humpback-whales_bubble-smoke-rings_human-communication_montage_WhaleSETI_1m.jpg",
      "summary": "Scientists photograph whales blowing 'bubble smoke rings' to communicate with humans Whales are known to be intelligent. They use complex sounds, travel in social groups, and show strong memory. But what happens when they do something not tied to feeding or mating? Could they interact in a creative and playful way using bubble rings? For the first time, researchers from...",
      "published": "Sun, 08 Jun 2025 22:49:02 GMT"
    },
    {
      "id": "43e74f1f95e4d481c8c62bef2df01d15",
      "title": "Astronomers Astonished by Largest Explosion Since the Big Bang - futurism.com",
      "source": "futurism.com",
      "url": "https://futurism.com/astronomers-largest-explosion-big-bang",
      "image_url": "https://wordpress-assets.futurism.com/2025/06/astronomers-largest-explosion-big-bang.jpg",
      "summary": "JUN 7, 10:30 AM EDT by FRANK LANDYMORE Astronomers Astonished by Largest Explosion Since the Big Bang Behold: extreme nuclear transients. / Off World/ Black Holes/ Stars/ Supermassive Black Holes You've heard of how mighty supernovas are, or of the ungodly amounts of energy released by gamma ray bursts. But astronomers have just discovered a type of cosmic blast that...",
      "published": "Sat, 07 Jun 2025 14:30:40 GMT"
    },
    {
      "id": "f58c14c2195e5df233f27dd3f42aef93",
      "title": "We interrupt the Musk-Trump feud with a teensy bit of news from the climate front - Daily Kos",
      "source": "Daily Kos",
      "url": "https://www.dailykos.com/stories/2025/6/7/2326505/-We-interrupt-the-Musk-Trump-feud-with-a-teensy-bit-of-news-from-the-climate-front",
      "image_url": "https://cdn.prod.dailykos.com/images/411226/story_image/burning-earth.1496345948.jpg?1497043592",
      "summary": "ACTION NEEDED: All across America, Trump and his MAGA allies are pushing hateful bills designed to roll back LGBTQ+ rights and harm LGBTQ+ communities. We need your help fighting back. Will you donate today? This Pride, there has never been a more important time to fight for equality for ALL. Our fundamental freedoms – and our very existence – are...",
      "published": "Sat, 07 Jun 2025 17:54:56 GMT"
    },
    {
      "id": "2b1d727203cb84a329bd4df85490406c",
      "title": "Scientists are attempting to resurrect the woolly mammoth but have just brought an unusual creature to life. - Stewartville Star",
      "source": "Stewartville Star",
      "url": "https://thinkstewartville.com/2025/06/08/scientists-are-attempting-to-resurrect-the-woolly-mammoth-but-have-just-brought-an-unusual-creature-to-life/",
      "image_url": "https://thinkstewartville.com/wp-content/uploads/2025/06/thinkstewartville.com-auto-draft-4819az0f4ra89zf45654.jpg",
      "summary": "Scientists are attempting to resurrect the woolly mammoth but have just brought an unusual creature to life. Published on 06/08/2025 at 10:31 pm· © Stewartville Star - Scientists are attempting to resurrect the woolly mammoth but have just brought an unusual creature to life. In a groundbreaking scientific endeavor that pushes the boundaries of genetic engineering, researchers have created woolly...",
      "published": "Mon, 09 Jun 2025 02:31:00 GMT"
    },
    {
      "id": "7d2ec03f4b425fc2f8192be0eb404a4e",
      "title": "Space photo of the week: James Webb telescope peeks under the brim of a 'peculiar' Sombrero - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-james-webb-telescope-takes-best-look-at-sombrero-galaxy-in-244-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/GRSu6KV2x4khJppUGqgXbD.jpg",
      "summary": "Space photo of the week: James Webb telescope takes best look at 'Sombrero Galaxy' in 244 years By Jamie Carter published yesterday New near-infrared observations by the James Webb Space Telescope highlight a tightly packed group of stars at the peculiar galaxy's center as well as dust on its outer fringes. When you purchase through links on our site, we...",
      "published": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "fea2df5be6132f69bf943f5e4e7c27ae",
      "title": "Study debunks 100-year-old understanding of what brain cells look like, forcing rewrite of biology textbooks - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/study-debunks-understanding-of-what-brain-cells-axons-look-like-pearl-structure/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/08194845/brain-cells_nerve-cells_axons_pearl-shaped-membranes_1m.jpg",
      "summary": "Study debunks 100-year-old understanding of what brain cells look like, disproving what we've been taught For decades, biology textbooks have told us that axons – the threadlike extensions of nerve cells – are smooth, cylindrical tubes. These axons are responsible for ferrying messages between neurons at lightning speed, playing a critical role in everything from moving your fingers to forming...",
      "published": "Mon, 09 Jun 2025 02:14:10 GMT"
    }
  ]
}