{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-16 20:53:35",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "d08c9c9cff746b1e7e2b3773fdd2acae",
      "title": "A look at the first artificial solar eclipses created by two European satellites - AP News",
      "source": "AP News",
      "url": "https://apnews.com/article/artificial-solar-eclipse-esa-474fe13392398e247f3ba501bf4fe191",
      "image_url": "https://apnews.com/favicon.ico",
      "summary": "Verify you are human by completing the action below. apnews.com needs to review the security of your connection before proceeding. Performance & security by Cloudflare",
      "published": "Mon, 16 Jun 2025 17:38:00 GMT"
    },
    {
      "id": "7036c0ff7f5189b73dfacf6b516bc95f",
      "title": "Scientists find universe's missing matter while watching fast radio bursts shine through 'cosmic fog' - Space",
      "source": "Space",
      "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQUkNZbFphMTJKVzl1YTh4WUdrYVdpVGxVdXZrcEpwNUQwbjZ4QlFnam9uU1VDdzhFblBMZVdyUlRjN1UyX0l1c1RpMktrZDl0UThCdng5WFh1bmNBR2pCbmIzVGZod1B0aU1qUENhQ3JlMDB1ZTEzcVFUMFR2V3hvaG9PMXJyS2xxcmVYenFRQUd0TE1hYVZ6QlBVVE0zZWJKN0FaNm5IMzFfZG42aFk4QVN3V0FFcmEyTlJkVTlKMFZoUk1VR2gwVUhn?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Mon, 16 Jun 2025 12:00:00 GMT"
    },
    {
      "id": "b11592d5809dd7372be0e7762c96858b",
      "title": "Scientists in Antarctica Detect Deep-Earth Signals That Defy Known Physics - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/scientists-in-antarctica-detect-deep-earth-signals-that-defy-known-physics-2000616356",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/ANITA-1200x675.jpg",
      "summary": "Scientists in Antarctica Detect Deep-Earth Signals That Defy Known Physics The anomalies, which can’t be explained by known particle-based signals, have baffled scientists. Published June 16, 2025 | Comments (20) | The Antarctic Impulsive Transient Antenna (ANITA) experiment, designed to detect radio waves from cosmic rays hitting the atmosphere, picked up the bizarre signals © Stephanie Wissel/Penn State A balloon-borne...",
      "published": "Mon, 16 Jun 2025 16:35:49 GMT"
    },
    {
      "id": "a7c8c286ad4515a8f6adb7f09ca66796",
      "title": "A Fifth Force of Nature May Have Been Discovered Inside Atoms - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/a-fifth-force-of-nature-may-have-been-discovered-inside-atoms",
      "image_url": "https://www.sciencealert.com/images/2025/06/fifth_force_atom_header.jpg",
      "summary": "A Fifth Force of Nature May Have Been Discovered Inside Atoms Every action in physics is governed by some kind of push or pull. As far as we know, these all fall into one of just four categories; electromagnetism, gravity, and two kinds of nuclear force. Yet there could well be forces hidden deep within the tiny storms of particle...",
      "published": "Mon, 16 Jun 2025 13:02:27 GMT"
    },
    {
      "id": "6cc07bb4cdd534b39cb21dcd972a1e8b",
      "title": "The administration’s anti-consensus Mars plan will fail - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/the-administrations-anti-consensus-mars-plan-will-fail/",
      "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/breaking-nasa-consensus.png?fit=900%2C400&quality=80&ssl=1",
      "summary": "Covering the business and politics of space The administration’s anti-consensus Mars plan will fail Credit: The Planetary Society; CC BY-NC-SA 4. 0 license The White House’s FY 2026 budget request for NASA proposes a radical shift in the agency’s direction, proposing extinction-level cuts to space science, severe cuts in other program areas and a dramatic pivot of human spaceflight focus...",
      "published": "Mon, 16 Jun 2025 11:00:00 GMT"
    },
    {
      "id": "9b5d919c4595a406c1e1965b49b69839",
      "title": "Exploring the cosmos fills us with wonder, Pope tells scientists - Vatican News",
      "source": "Vatican News",
      "url": "https://www.vaticannews.va/en/pope/news/2025-06/exploring-the-cosmos-fills-us-with-wonder-pope-tells-scientists.html",
      "image_url": "https://www.vaticannews.va/content/dam/vaticannews/agenzie/images/reuters/2024/12/09/18/1733766892322.JPG/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg",
      "summary": "The portal Vatican News uses technical or similar cookies to make navigation easier and guarantee the use of the services. Furthermore, technical and analysis cookies from third parties may be used. If you want to know more click here. By closing this banner you consent to the use of cookies. FILE PHOTO: Spiral galaxy NGC 628, located 32 million light-years...",
      "published": "Mon, 16 Jun 2025 09:41:32 GMT"
    },
    {
      "id": "0cd3ca039dd77bd82f9d2faa27c397ac",
      "title": "New model helps to figure out which distant planets may host life - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/solar-system/new-model-helps-to-figure-out-which-distant-planets-may-host-life",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Q5mZXzCUvvGcDDBXxTZZ6A.jpg",
      "summary": "New model helps to figure out which distant planets may host life By Daniel Apai published yesterday The search for life beyond Earth is a holy grail quest for many experts, but finding where to look is a core issue. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. An artist's...",
      "published": "Sun, 15 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "b1fe5a868908090fa0d442d9e5342c34",
      "title": "Meet the \"prince of dragons,\" closest T-rex relative that started the tyrannosaur dynasty - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/meet-the-prince-of-dragons-khankhuuluu-mongoliensis-started-tyrannosaur-dynasty/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/15174959/dinosaur_t-rex-cousin_Khankhuuluu-mongoliensis_paleontologists_credit-UCalgary_1m.jpg",
      "summary": "Meet the \"prince of dragons,\" closest T-rex relative that started the tyrannosaur dynasty Dinosaurs have long captivated human imagination. From towering giants to quick-footed hunters, these creatures ruled the prehistoric world for millions of years. Each fossil discovery brings new understanding. A recent find has added a key piece to the tyrannosaur story. Named Khankhuuluu mongoliensis, this newly identified dinosaur...",
      "published": "Mon, 16 Jun 2025 10:47:49 GMT"
    },
    {
      "id": "9bb909717b8a71945713b0f875d1d89a",
      "title": "Famous 'ice-age puppies' are not actually dogs, according to new study - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/famous-ice-age-puppies-are-not-actually-dogs-according-to-new-study/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/15181553/ice-age-puppies-tumat_wolves_credit-University-of-York_1m.jpg",
      "summary": "Famous 'ice-age puppies' are not actually dogs, according to new study Two small cubs that died more than 14,000 years ago, were initially considered to be early domesticated dogs. New findings now confirm that these so-called “puppies” were actually wolf cubs. Their final nap, curled up in their den, turned them into scientific time capsules. Their frozen remains – discovered...",
      "published": "Mon, 16 Jun 2025 10:24:28 GMT"
    },
    {
      "id": "49a0a73846a74fbd969302c3b75cce32",
      "title": "James Webb telescope discovers 'a new kind of climate' on Pluto, unlike anything else in our solar system - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/pluto/james-webb-telescope-discovers-a-new-kind-of-climate-on-pluto-unlike-anything-else-in-our-solar-system",
      "image_url": "https://cdn.mos.cms.futurecdn.net/hDbLfUwnt2FrZu9NJMDKig.jpg",
      "summary": "California's faults overdue earthquakes James Webb telescope discovers 'a new kind of climate' on Pluto, unlike anything else in our solar system By Sharmila Kuthunur published yesterday New James Webb Space Telescope data reveal Pluto's high-altitude haze is a key driver of the climate on the dwarf planet, offering clues to Earth's ancient atmosphere. When you purchase through links on...",
      "published": "Sun, 15 Jun 2025 11:00:00 GMT"
    },
    {
      "id": "5db713164971d829407ed73b59b73539",
      "title": "Powerful solar flare erupts from sun triggering radio blackouts across North America (video) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/sun/powerful-solar-flare-erupts-from-sun-triggering-radio-blackouts-across-north-america-video",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Ddmb9rBgJJ78GbScDFcwuh.jpg",
      "summary": "Powerful solar flare erupts from sun triggering radio blackouts across North America (video) By Daisy Dobrijevic published 7 hours ago The M-class flare was accompanied by a coronal mass ejection currently forecast to land Earth with a glancing blow on June 18. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.",
      "published": "Mon, 16 Jun 2025 14:13:01 GMT"
    },
    {
      "id": "cac040e0ce819b76ebb44f971a8ba213",
      "title": "NASA Teams Up With India to Launch First-of-Its-Kind $1.5 Billion Satellite - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/nasa-teams-up-with-india-to-launch-first-of-its-kind-1-5-billion-satellite",
      "image_url": "https://www.sciencealert.com/images/2025/06/SatelliteOverEarth.jpg",
      "summary": "NASA Teams Up With India to Launch First-of-Its-Kind $1. 5 Billion Satellite By STEVE PETRIE, THE CONVERSATION Artist’s concept of the NISAR satellite in orbit over Earth. (NASA/JPL-Caltech) In a few days, a new satellite that can detect changes on Earth's surface down to the centimetre, in almost real time and no matter the time of day or weather conditions,...",
      "published": "Mon, 16 Jun 2025 01:48:48 GMT"
    },
    {
      "id": "c0a2f5e7d43d03ba847dd9bb2ca66351",
      "title": "NASA sets new potential launch date for Ax-4 mission to ISS - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/nasa-sets-new-potential-launch-date-for-ax-4-mission-to-iss/",
      "image_url": "https://spacenews.com/wp-content/uploads/2024/07/International-Space-Station-in-2021-scaled.webp",
      "summary": "Covering the business and politics of space NASA sets new potential launch date for Ax-4 mission to ISS The International Space Station, photographed in 2021. Credit: NASA PARIS — NASA says a private astronaut mission could launch to the International Space Station as soon as June 19 as it works to understand an air leak on the Russian segment of...",
      "published": "Sun, 15 Jun 2025 09:12:14 GMT"
    },
    {
      "id": "fc858a66ec1b358241f03bf2631c7373",
      "title": "Scientists Detect Unusual Airborne Toxin in the United States for the First Time - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/scientists-detect-unusual-airborne-toxin-in-the-united-states-for-the-first-time/",
      "image_url": "https://scitechdaily.com/images/Dust-Cloud-Over-Farm.jpg",
      "summary": "Home»Earth»Scientists Detect Unusual Airborne Toxin in the United States for the First Time Scientists Detect Unusual Airborne Toxin in the United States for the First Time Researchers unexpectedly discovered toxic airborne pollutants in Oklahoma. The image above depicts a field in Oklahoma. Credit: Shutterstock University of Colorado Boulder researchers made the first-ever airborne detection of Medium Chain Chlorinated Paraffins (MCCPs)...",
      "published": "Mon, 16 Jun 2025 03:57:38 GMT"
    },
    {
      "id": "e513d29c5fd87ac4ed01da7014714fe3",
      "title": "Study finds creature that may hold the key to bring limb regeneration to humans - WKEF",
      "source": "WKEF",
      "url": "https://dayton247now.com/news/nation-world/study-finds-creature-key-limb-regeneration-future-advancement-new-possibilities-regenerative-medicine-unlock-process-acid-understanding-abilities-humans",
      "image_url": "https://dayton247now.com/resources/media2/16x9/1914/986/3x0/90/e29550c3-f6c2-4fec-9d65-3047cb74173e-1.PNG",
      "summary": "Study finds creature that may hold the key to bring limb regeneration to humans by WKRC/CNN NewsourceSun, June 15th 2025 at 10:52 PM The axolotl, a small salamander known for its remarkable ability to regrow entire limbs, is at the center of groundbreaking research that could unlock new possibilities in regenerative medicine. (CNN Newsource) UNDATED (WKRC/CNN Newsource) - The axolotl,...",
      "published": "Sun, 15 Jun 2025 02:52:36 GMT"
    },
    {
      "id": "4f513d971fee4f3996596aacbc7a4a2f",
      "title": "520-million-year-old fossil discovered with brains and guts still intact, stunning the lead scientist - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/fossil-euarthropod-youti-yuanshi-lived-520-million-years-ago-insect-evolution/",
      "image_url": "https://cff2.earth.com/uploads/2024/08/15144514/fossil-discovery_Youti-yuanshi_guts_520-million-years_1m.jpg",
      "summary": "520-million-year-old fossil discovered with brains and guts still intact, stunning the lead scientist The Cambrian period, around 520 million years ago, was an age of experimentation. Life in the seas was trying out every possible body plan, searching for combinations that worked. One line of creatures, the euarthropods, hit on a winner: segmented bodies, paired jointed limbs, and a knack...",
      "published": "Sun, 15 Jun 2025 21:04:26 GMT"
    },
    {
      "id": "fc14120ad9cc2a9bcaf644d3458c19d3",
      "title": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/hundreds-of-mysterious-giant-viruses-discovered-lurking-in-the-ocean",
      "image_url": "https://www.sciencealert.com/images/2025/06/pandora-virus.jpg",
      "summary": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean Pandoravirus salinus, a species of giant virus identified in 2013. (© IGS CNRS-AMU) Scientists have just discovered hundreds of new giant viruses, in a comprehensive study covering oceans across the globe. The team behind the study, marine biologist Benjamin Minch and virologist Mohammad Moniruzzaman from the University of Miami, used...",
      "published": "Mon, 16 Jun 2025 06:42:09 GMT"
    },
    {
      "id": "7eb41ecc2faa4d02640e320a5373fd24",
      "title": "Early Humans Settled in Cities. Bedbugs Followed Them. - The New York Times",
      "source": "The New York Times",
      "url": "https://www.nytimes.com/2025/06/12/science/bedbugs-humans-urbanization-study.html",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Sun, 15 Jun 2025 07:00:00 GMT"
    },
    {
      "id": "be5c9650050bc298c5cd76842e9e5f6f",
      "title": "Astronomers discover ultrapowerful black hole jet as bright as 10 trillion suns lit by Big Bang's afterglow - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/black-holes/astronomers-discover-ultrapowerful-black-hole-jet-as-bright-as-10-trillion-suns-lit-by-big-bangs-afterglow",
      "image_url": "https://cdn.mos.cms.futurecdn.net/bcQjv2aCfjXEUB4kaNk8vc.png",
      "summary": "Astronomers discover ultrapowerful black hole jet as bright as 10 trillion suns lit by Big Bang's afterglow By Sharmila Kuthunur published yesterday \"It's like looking for candlelight in close vicinity to a flashlight that's blazing toward us. \" When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A powerful black hole...",
      "published": "Sun, 15 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "93178987b8f367bf32747bdc9cc4dc88",
      "title": "Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/carbon-dioxide-removal-ocean-oxygen-crisis/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/study-warns-carbon-dioxide-removal-methods-could-trigger-ocean-oxygen-crisis-1200x727.jpg",
      "summary": "Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis Marine carbon dioxide removal methods could dangerously accelerate ocean oxygen depletion. Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis | Indian Defence Review A recent study published in Environmental Research Letters explores the potentially harmful consequences of certain marine carbon dioxide removal (mCDR) techniques, particularly their...",
      "published": "Sun, 15 Jun 2025 15:45:00 GMT"
    }
  ]
}