{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-07 18:39:39",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "a70d2bf7464d8df8ca0ce77c600b6e20",
      "title": "Trump’s war on science hits home: NASA Glenn Research Center faces “extinction level” cuts - Cleveland.com",
      "source": "Cleveland.com",
      "url": "https://www.cleveland.com/news/2025/06/trumps-war-on-science-hits-home-nasa-glenn-research-center-faces-extinction-level-cuts.html",
      "image_url": "https://www.cleveland.com/resizer/v2/NN5X3AAVGRCXRAHMQIU3HTHKHQ.jpg?auth=53974084921f704bd4c9109ee3d200c0a310900a3f37574fd79861a946c91f51&width=1280&quality=90",
      "summary": "Summer Sale - Start Today for $1 - Expires 6/30/25 Trump’s war on science hits home: NASA Glenn Research Center faces “extinction level” cuts Updated: Jun. 07, 2025, 6:02 a. m.|Published: Jun. 07, 2025, 6:00 a. m. Northeast Ohio's premier scientific institution could lose 40 percent of its workforce under Trump's proposed NASA cuts, part of what Today in Ohio...",
      "published": "Sat, 07 Jun 2025 10:02:00 GMT"
    },
    {
      "id": "2958aaad7a615f3d26560b65a96528e0",
      "title": "SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (video, photos) - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-sirius-xm-radio-satellite-to-orbit-lands-rocket-on-ship-at-sea-photos",
      "image_url": "https://cdn.mos.cms.futurecdn.net/8tnDivxki5wvR4zRssWNFD.jpg",
      "summary": "Fate of ispace moon lander in doubt Space Exploration Launches & Spacecraft SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (video, photos) By Mike Wall published 13 hours ago It was SpaceX's 69th Falcon 9 launch of the year already. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Sat, 07 Jun 2025 05:43:07 GMT"
    },
    {
      "id": "b270ed45b60f6e339f391720571d371c",
      "title": "NASA Mars Orbiter Captures Volcano Peeking Above Morning Cloud Tops - NASA (.gov)",
      "source": "NASA (.gov)",
      "url": "https://www.nasa.gov/missions/odyssey/nasa-mars-orbiter-captures-volcano-peeking-above-morning-cloud-tops/",
      "image_url": "https://www.nasa.gov/wp-content/uploads/2025/06/1-themis-views-mars-arsia-mons-volcano-crop1.jpg",
      "summary": "NASA Mars Orbiter Captures Volcano Peeking Above Morning Cloud Tops Arsia Mons, an ancient Martian volcano, was captured before dawn on May 2, 2025, by NASA’s 2001 Mars Odyssey orbiter while the spacecraft was studying the Red Planet’s atmosphere, which appears here as a greenish haze. The 2001 Odyssey spacecraft captured a first-of-its-kind look at Arsia Mons, which dwarfs Earth’s...",
      "published": "Fri, 06 Jun 2025 17:20:52 GMT"
    },
    {
      "id": "ff013881574e138fe6115c03ca6f6bf9",
      "title": "A surprising study revealed biological activity on a distant planet. Weeks later, scientists say there’s more to the story - CNN",
      "source": "CNN",
      "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBLVzhGY2w2bXRYVWxFNVdsU3lCTWp5U2Fvd3hDT3FjcExfNy1VU1VPTktHV0twY3lNdHFOQnJFZUlMblJRRUxyOVo2azNISHZPTnZ5QUtPZmRtWE5tT0Rwc3p5bFF0cFRyYW9ZZjlEeko2ZEtpTEN0WmJ4bzXSAYIBQVVfeXFMTTMxN0d4UThDYXBNbmVubFZsZHpHMFdzMzB3MEd1N2pldjBBZFMtbjFHRENWSDQzNU95U01LWW82N1FEVTN2TXo3M2xJZURJOXhGUVkxbEVuSTJXaWZGeDgxYm1jblc3TmRkeVM3am9walAzb2U4U2h0bHVZQ3pQYlBoQQ?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Fri, 06 Jun 2025 14:54:00 GMT"
    },
    {
      "id": "c22b1d28b5f6474de29c5f7f4eaf31c6",
      "title": "Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking - Spaceflight Now",
      "source": "Spaceflight Now",
      "url": "https://spaceflightnow.com/2025/06/07/further-delays-of-starliners-next-flight-mark-anniversary-of-its-first-crewed-space-station-docking/",
      "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250403_Starliner_CFT_rollout.jpeg",
      "summary": "Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking June 7, 2025 Will Robinson-Smith The Boeing Starliner spacecraft is lifted at the Vertical Integration Facility at Space Launch Complex-41 at Cape Canaveral Space Force Station in Florida on Tuesday,...",
      "published": "Sat, 07 Jun 2025 03:17:16 GMT"
    },
    {
      "id": "c404f0b0253f24b48ba7318db88e27e3",
      "title": "James Webb telescope unveils largest-ever map of the universe, stretching from present day to the dawn of time - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/cosmology/scientists-unveil-the-largest-map-of-the-universe-spanning-over-13-billion-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/j4odWTSBih9XMXxBtG9Lkf.jpg",
      "summary": "Physicists capture 'second sound' James Webb telescope unveils largest-ever map of the universe, spanning over 13 billion years By Damien Pine published 20 hours ago The largest map of the universe, created with data from the James Webb Space Telescope, shows almost 800,000 galaxies crammed into a tiny piece of sky and spanning almost all of time. When you purchase...",
      "published": "Fri, 06 Jun 2025 23:06:00 GMT"
    },
    {
      "id": "ce296db4c6a0865bbe550274c53964bb",
      "title": "Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time - Daily Mail",
      "source": "Daily Mail",
      "url": "https://www.dailymail.co.uk/sciencetech/article-14787095/Earth-CO2-hits-highest-human-history.html",
      "image_url": "https://i.dailymail.co.uk/1s/2025/06/06/13/99109319-0-image-m-7_1749213192584.jpg",
      "summary": "Saturday, Jun 7th 2025 12PM 75°F Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time ever READ MORE: Experts call for urgent action as Britain records its hottest spring By JONATHAN CHADWICK FOR MAILONLINE PUBLISHED: 08:33 EDT, 6 June 2025 | UPDATED: 11:40 EDT, 6 June 2025 There's now more...",
      "published": "Fri, 06 Jun 2025 12:33:23 GMT"
    },
    {
      "id": "30cdd0f2bd6cec188cd7c2d0d7699b10",
      "title": "June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/junes-full-strawberry-moon-illuminates-the-night-sky-next-week-heres-how-to-see-it",
      "image_url": "https://cdn.mos.cms.futurecdn.net/6VxZZXmCHNJEVUwD7VBdBa.jpg",
      "summary": "Fate of ispace moon lander in doubt June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it By Anthony Wood published 9 hours ago Don't miss the 2025 full \"Strawberry Moon\" when it rises above the southeastern horizon on June 10. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Sat, 07 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "c14d9b806c2abdd21c7b70d3d310a789",
      "title": "How NASA Plans To Deal With Death In Space - Jalopnik",
      "source": "Jalopnik",
      "url": "https://www.jalopnik.com/1879088/how-nasa-plans-to-deal-with-death-in-space/",
      "image_url": "https://www.jalopnik.com/img/gallery/how-nasa-plans-to-deal-with-death-in-space/l-intro-1749181628.jpg",
      "summary": "© 2025 Static Media. All Rights Reserved How NASA Plans To Deal With Death In Space While America's space program has endured several tragedies, no mission has left the remains of a lost astronaut floating in the final frontier. NASA is understandably prepared if that worst-case scenario ever arises. The agency organized protocols if an astronaut were to die on...",
      "published": "Fri, 06 Jun 2025 19:25:00 GMT"
    },
    {
      "id": "3a61b490b45036bfbab177bbacb9e71b",
      "title": "15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/15000-light-years-away-something-is-blinking-and-it-might-rewrite-physics/",
      "image_url": "https://scitechdaily.com/images/ASKAP-J1832-0911.jpg",
      "summary": "Home»Space»15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics 15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics An image of the sky showing the region around ASKAP J1832-0911. X-rays from NASA’s Chandra X-ray Observatory, radio data from the South African MeerKAT radio telescope, and infrared data from NASA’s Spitzer Space Telescope. Credit: Ziteng...",
      "published": "Sat, 07 Jun 2025 07:09:59 GMT"
    },
    {
      "id": "ce4966475502a6504c3c94c47a38d734",
      "title": "Scientists Just Found an Ingredient for Life in a Newborn Planet System - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-ingredient-newborn-planet/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Just-Found-an-Ingredient-for-Life-in-a-Newborn-Planet-System.jpg",
      "summary": "Scientists Just Found an Ingredient for Life in a Newborn Planet System A rare molecule spotted in a young planet system could be a missing link in the story of life’s origins. Scientists are now piecing together what this means for our own solar system. Credit: CfA/M. Weiss | The Daily Galaxy --Great Discoveries Channel Astronomers have uncovered a rare...",
      "published": "Sat, 07 Jun 2025 12:15:00 GMT"
    },
    {
      "id": "2b2ed9fc556b0bc742ef59de069a644f",
      "title": "If books could kill: The poison legacy lurking in libraries - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g2y9xq58no",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b804/live/51328d10-42fa-11f0-9630-fd015488de94.jpg",
      "summary": "If books could kill: The poison legacy lurking in libraries BBC Scotland Arts Correspondent Green dye was widely used in Victorian publishing The Victorians loved the colour green. In particular, they loved a vibrant shade of emerald created by combining copper and arsenic, which was used in everything from wallpaper to children's toys. \"This colour was very popular for most...",
      "published": "Sat, 07 Jun 2025 08:20:48 GMT"
    },
    {
      "id": "966f4e5cc55b7582d728dd84f0902f94",
      "title": "65 Extremely Rare Historical Pictures That Will Completely And Totally Change Your Perspective On The Universe - BuzzFeed",
      "source": "BuzzFeed",
      "url": "https://www.buzzfeed.com/daves4/interesting-photos-of-space-2025",
      "image_url": "https://img.buzzfeed.com/buzzfeed-static/static/2025-06/07/11/thumb/9nOpega93.jpg?crop=2490:1660;5,0&resize=1250:830",
      "summary": "Internet Finds·Posted 7 hours ago Subscribe to BuzzFeed Daily Newsletter 65 Absolutely Breaktaking Historical Pictures That Will Completely And Totally Change Your Perspective On The Universe The truth is out there. .. and right here. 1. This is a picture of Earth from ONE HOUR ago: 2. And this is a picture of Mars that was taken THIS WEEK: Weather...",
      "published": "Sat, 07 Jun 2025 12:05:54 GMT"
    },
    {
      "id": "24645bd893845f39753f05071841f103",
      "title": "Worms Caught Creating Superorganisms in the Wild for the First Time - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/worms-caught-creating-superorganisms/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/worms-caught-creating-superorganisms-in-the-wild-for-the-first-time.jpg",
      "summary": "Worms Caught Creating Superorganisms in the Wild for the First Time Scientists capture tiny worms creating towering “superorganisms” in the wild. Image credit: Daniela Perez | Indian Defence Review In a groundbreaking discovery, scientists have observed tiny nematode worms forming “superorganisms” by creating towering structures in the wild, a behavior previously only observed under experimental conditions. This phenomenon, captured by...",
      "published": "Fri, 06 Jun 2025 19:45:00 GMT"
    },
    {
      "id": "69844aa3f5df55624d9fcf4c8b7f08ce",
      "title": "Astronomers Just Discovered The Biggest Explosions Since The Big Bang - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/astronomers-just-discovered-the-biggest-explosions-since-the-big-bang",
      "image_url": "https://www.sciencealert.com/images/2025/06/kaboom.jpg",
      "summary": "Astronomers Just Discovered The Biggest Explosions Since The Big Bang An artist's impression of an ENT. (W. M. Keck Observatory/Adam Makarenko) A never-before-seen type of giant space explosion – the biggest bangs since the Big Bang – has been accidentally captured by the Gaia space telescope. From the hearts of distant galaxies, the mapping telescope recorded sudden, extreme increases in...",
      "published": "Fri, 06 Jun 2025 04:03:58 GMT"
    },
    {
      "id": "39b26494483747a2c267fb87c23e08d5",
      "title": "Catch Jupiter and Mercury side by side in the evening sky this week - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/catch-jupiter-and-mercury-side-by-side-in-the-evening-sky-this-week",
      "image_url": "https://cdn.mos.cms.futurecdn.net/tkfP4vgUPa4pGmsB3fkvUm.jpg",
      "summary": "Fate of ispace moon lander in doubt Catch Jupiter and Mercury side by side in the evening sky this week By Anthony Wood published yesterday The solar system's largest and smallest planets will greet one another in the eastern sky. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Mercury and...",
      "published": "Fri, 06 Jun 2025 16:00:00 GMT"
    },
    {
      "id": "90da191776f7881b93de578c08e5a4e2",
      "title": "650-foot mega-tsunami sends seismic waves around world and satellites captured the action - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/650-foot-mega-tsunami-sends-seismic-waves-around-world-dickson-fjord-swot-mission/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/06095249/greenland-mega-tsunami_dickson-fjord_landslide_seismic-waves_1.jpg",
      "summary": "650-foot mega-tsunami sends seismic waves around world and satellites captured the action Greenland’s eastern edge rarely causes a stir, yet instruments across the world lit up at the same time with a slow, steady beat that lasted nine full days. The pulse rose and fell every ninety-two seconds – far too sluggish for people to feel but strong enough to...",
      "published": "Fri, 06 Jun 2025 16:31:19 GMT"
    },
    {
      "id": "ec1d894b189c84fe50ff3abe9e3a2088",
      "title": "This is the safest place to hide when a nuclear bomb strikes - The Brighter Side of News",
      "source": "The Brighter Side of News",
      "url": "https://www.thebrighterside.news/discoveries/this-is-the-safest-place-to-hide-when-a-nuclear-bomb-strikes/",
      "image_url": "https://www.thebrighterside.news/uploads/2025/06/nuclear-blast.jpg?auto=webp",
      "summary": "This is the safest place to hide when a nuclear bomb strikes In buildings that remain standing beyond the blast’s epicenter, the threat shifts from collapsing structures to something less visible but still deadly. Published Jun 7, 2025 4:51 AM PDT Researchers have taken a hard look at what happens to people who shelter inside buildings within the so-called moderate...",
      "published": "Sat, 07 Jun 2025 11:51:00 GMT"
    },
    {
      "id": "f53f0a64282c1c2fb122815511f16535",
      "title": "Asteroid 2024 YR4 Could Strike the Moon: NASA’s Webb Telescope Warns - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/asteroid-2024-yr4-could-strike-the-moon/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Asteroid-2024-YR4-Could-Strike-the-Moon-NASAs-Webb-Telescope-Warns.jpg",
      "summary": "Asteroid 2024 YR4 Could Strike the Moon: NASA’s Webb Telescope Warns NASA’s Webb Telescope has raised the alarm as asteroid 2024 YR4’s odds of striking the Moon soar. Credit: NASA/JPL Center for Near-Earth Object Studies | The Daily Galaxy --Great Discoveries Channel NASA’s James Webb Space Telescope has provided a new update on asteroid 2024 YR4, revealing important findings that...",
      "published": "Fri, 06 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "4367ef76d716d4f549abd9141ab9e5f5",
      "title": "Scientists Create 'World's Smallest Violin' - Slashdot",
      "source": "Slashdot",
      "url": "https://news.slashdot.org/story/25/06/07/0121245/scientists-create-worlds-smallest-violin",
      "image_url": "https://a.fsdn.com/sd/topics/news_64.png",
      "summary": "Want to read Slashdot from your mobile device? Point it at m. slashdot.org and keep reading! Protect your devices with award-winning Avast Free Antivirus — packed with cutting-edge privacy and security tools. Stay safe from even the toughest online threats, backed by the world’s largest cybersecurity network. Trusted and recognized globally, it’s security you can count on — at no...",
      "published": "Sat, 07 Jun 2025 02:35:13 GMT"
    }
  ]
}