{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-08 06:40:28",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "6f5ccc20ff0e82a003f09d6be8594750",
      "title": "This ‘smoke’ ring was formed by one of the biggest creatures on Earth. Scientists say it has never been documented before - BBC Wildlife Magazine",
      "source": "BBC Wildlife Magazine",
      "url": "https://www.discoverwildlife.com/animal-facts/marine-animals/humpback-whale-bubble-ring-communication",
      "image_url": "https://c02.purpledshub.com/uploads/sites/62/2025/06/Humpback-whale-bubble-ring.jpeg?w=1200",
      "summary": "This ‘Smoke’ Ring Was Formed By One Of The Biggest Creatures On Earth. Scientists Say It Has Never Been Documented Before This ‘smoke’ ring was formed by one of the biggest creatures on Earth. Scientists say it has never been documented before A study has revealed that humpback whales approach humans and blow bubble ‘smoke’ rings – a newly documented...",
      "published": "Fri, 06 Jun 2025 17:59:08 GMT"
    },
    {
      "id": "baee8628f95a6e6bfbae41d059bab50c",
      "title": "Trump-Musk row fuels 'biggest crisis ever' at Nasa - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c87jq0djw00o",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2ce9/live/dd7579c0-43c4-11f0-835b-310c7b938e84.jpg",
      "summary": "Trump-Musk row fuels 'biggest crisis ever' at Nasa The heart-shape on Pluto was captured by a spacecraft that will be turned off mid-mission if Nasa cuts are approved The row between Donald Trump and Elon Musk over a major spending bill has exacerbated uncertainty over the future of Nasa's budget, which is facing deep cuts. The space agency has published...",
      "published": "Sat, 07 Jun 2025 23:29:56 GMT"
    },
    {
      "id": "c561bf3da6348edee9b3df6922651492",
      "title": "NASA Spots Strange Towering Shape Breaking Through Mars’ Atmosphere - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/nasa-towering-shape-mars-atmosphere/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASA-Catches-Strange-Structure-Emerging-From-the-Martian-Fog.jpg",
      "summary": "NASA Spots Strange Towering Shape Breaking Through Mars’ Atmosphere A newly released NASA image captures a mysterious peak piercing through Mars’ morning clouds. Credit: NASA/JPL-Caltech/ASU | The Daily Galaxy --Great Discoveries Channel A new image from NASA’s Mars Odyssey orbiter reveals an extraordinary sight: a massive formation breaking through Mars’ early morning cloud cover. Taken just before dawn on May...",
      "published": "Sat, 07 Jun 2025 15:30:00 GMT"
    },
    {
      "id": "8ee91b3123273da7b60768edf239b9d9",
      "title": "NASA is launching a $488 million mission with its new telescope, which is expected to provide a lot of data. - Farmingdale Observer",
      "source": "Farmingdale Observer",
      "url": "https://farmingdale-observer.com/2025/06/07/nasa-is-launching-a-488-million-mission-with-its-new-telescope-which-is-expected-to-provide-a-lot-of-data/",
      "image_url": "https://farmingdale-observer.com/wp-content/uploads/2025/06/6480846130354-2025-06-05t150651.995-1024x683.jpg",
      "summary": "NASA Is Launching A $488 Million Mission With Its New Telescope, Which Is Expected To Provide A Lot Of Data. NASA’s ambitious SPHEREx telescope project represents a significant leap forward in our understanding of the cosmos. With a price tag of $488 million, this revolutionary instrument is designed to create an unprecedented three-dimensional map of our universe. The Spectro-Photometer for...",
      "published": "Sun, 08 Jun 2025 02:36:00 GMT"
    },
    {
      "id": "3a61b490b45036bfbab177bbacb9e71b",
      "title": "15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/15000-light-years-away-something-is-blinking-and-it-might-rewrite-physics/",
      "image_url": "https://scitechdaily.com/images/ASKAP-J1832-0911.jpg",
      "summary": "Home»Space»15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics 15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics An image of the sky showing the region around ASKAP J1832-0911. X-rays from NASA’s Chandra X-ray Observatory, radio data from the South African MeerKAT radio telescope, and infrared data from NASA’s Spitzer Space Telescope. Credit: Ziteng...",
      "published": "Sat, 07 Jun 2025 07:09:59 GMT"
    },
    {
      "id": "2958aaad7a615f3d26560b65a96528e0",
      "title": "SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (video, photos) - Space",
      "source": "Space",
      "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNOHVFTkxIMVVGN1VxYXVLSzlaYVEtbURTbUN6YldJMnZvdndneEl4RWVtbzlVeWJZR012X01Xd0Q5V2RNRUcxTG56VXBMSk80X2tyZW81THZHdThXMURCTUhRanlrR29aV2RseTBiT3pFanNoT2pYUHV6b01LaFJPQU51QnE5ZDFRZ3FPczc1N01wdEUxOEdfeUxyYVJoXzhhb2d1TElLUnZQNUtRbHN2UmJRODN1aERINnJHeEM5b01ybC1uYldrMHk3OHUtWmE0dGRqaXNwd0tvNWRuQmc?oc=5",
      "image_url": "https://via.placeholder.com/300x150?text=No+Image",
      "summary": "No content available for summarization.",
      "published": "Sat, 07 Jun 2025 05:43:07 GMT"
    },
    {
      "id": "119f68461d56ae308097acd53787ef5d",
      "title": "A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/06/science/k218b-studies-planet-habitability",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/230914141939-exoplanet-k2-18b.jpg?c=16x9&q=w_800,c_fill",
      "summary": "A surprising study found hints of biological activity on a distant planet. Now, scientists say there’s more to the story Updated 9:33 PM EDT, Sat June 7, 2025 An artist's concept shows what K2-18b might look like. Thought to be covered entirely in liquid water with a hydrogen-rich atmosphere, the exoplanet may be a good place to look for biological...",
      "published": "Sun, 08 Jun 2025 01:33:00 GMT"
    },
    {
      "id": "c22b1d28b5f6474de29c5f7f4eaf31c6",
      "title": "Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking - Spaceflight Now",
      "source": "Spaceflight Now",
      "url": "https://spaceflightnow.com/2025/06/07/further-delays-of-starliners-next-flight-mark-anniversary-of-its-first-crewed-space-station-docking/",
      "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250403_Starliner_CFT_rollout.jpeg",
      "summary": "Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking Further delays of Starliner’s next flight mark anniversary of its first crewed Space Station docking June 7, 2025 Will Robinson-Smith The Boeing Starliner spacecraft is lifted at the Vertical Integration Facility at Space Launch Complex-41 at Cape Canaveral Space Force Station in Florida on Tuesday,...",
      "published": "Sat, 07 Jun 2025 03:17:16 GMT"
    },
    {
      "id": "ce4966475502a6504c3c94c47a38d734",
      "title": "Scientists Just Found an Ingredient for Life in a Newborn Planet System - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-ingredient-newborn-planet/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Just-Found-an-Ingredient-for-Life-in-a-Newborn-Planet-System.jpg",
      "summary": "Scientists Just Found an Ingredient for Life in a Newborn Planet System A rare molecule spotted in a young planet system could be a missing link in the story of life’s origins. Scientists are now piecing together what this means for our own solar system. Credit: CfA/M. Weiss | The Daily Galaxy --Great Discoveries Channel Astronomers have uncovered a rare...",
      "published": "Sat, 07 Jun 2025 12:15:00 GMT"
    },
    {
      "id": "c14d9b806c2abdd21c7b70d3d310a789",
      "title": "How NASA Plans To Deal With Death In Space - Jalopnik",
      "source": "Jalopnik",
      "url": "https://www.jalopnik.com/1879088/how-nasa-plans-to-deal-with-death-in-space/",
      "image_url": "https://www.jalopnik.com/img/gallery/how-nasa-plans-to-deal-with-death-in-space/l-intro-1749181628.jpg",
      "summary": "© 2025 Static Media. All Rights Reserved How NASA Plans To Deal With Death In Space While America's space program has endured several tragedies, no mission has left the remains of a lost astronaut floating in the final frontier. NASA is understandably prepared if that worst-case scenario ever arises. The agency organized protocols if an astronaut were to die on...",
      "published": "Fri, 06 Jun 2025 19:25:00 GMT"
    },
    {
      "id": "1556e4cdbd8ccc2dd5e04b653883b792",
      "title": "Astronomers thought the Milky Way was doomed to crash into Andromeda. Now they're not so sure - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-astronomers-thought-milky-doomed-andromeda.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 20.102.199. 208 : 39a878fc-6ad4-4d1c-842c-b32f9cbf",
      "published": "Sat, 07 Jun 2025 17:40:01 GMT"
    },
    {
      "id": "c404f0b0253f24b48ba7318db88e27e3",
      "title": "James Webb telescope unveils largest-ever map of the universe, stretching from present day to the dawn of time - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/cosmology/scientists-unveil-the-largest-map-of-the-universe-spanning-over-13-billion-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/j4odWTSBih9XMXxBtG9Lkf.jpg",
      "summary": "Physicists capture 'second sound' James Webb telescope unveils largest-ever map of the universe, spanning over 13 billion years By Damien Pine published yesterday The largest map of the universe, created with data from the James Webb Space Telescope, shows almost 800,000 galaxies crammed into a tiny piece of sky and spanning almost all of time. When you purchase through links...",
      "published": "Fri, 06 Jun 2025 23:06:00 GMT"
    },
    {
      "id": "ce296db4c6a0865bbe550274c53964bb",
      "title": "Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time - Daily Mail",
      "source": "Daily Mail",
      "url": "https://www.dailymail.co.uk/sciencetech/article-14787095/Earth-CO2-hits-highest-human-history.html",
      "image_url": "https://i.dailymail.co.uk/1s/2025/06/06/13/99109319-0-image-m-7_1749213192584.jpg",
      "summary": "Saturday, Jun 7th 2025 12AM 62°F Earth's CO2 hits highest recorded level in human history - exceeding 430 parts per million for the first time ever READ MORE: Experts call for urgent action as Britain records its hottest spring By JONATHAN CHADWICK FOR MAILONLINE PUBLISHED: 08:33 EDT, 6 June 2025 | UPDATED: 11:40 EDT, 6 June 2025 There's now more...",
      "published": "Fri, 06 Jun 2025 12:33:23 GMT"
    },
    {
      "id": "7e7d5c3abebee4806ec994fd54242e09",
      "title": "Underwater Megavolcano Set to Release Millions of Tons of Lava, Experts Warn - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/underwater-volcano-millions-tons-lava/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Underwater-Megavolcano-Set-to-Release-Millions-of-Tons-of-Lava-Experts-Warn.jpg",
      "summary": "Underwater Megavolcano Set to Release Millions of Tons of Lava, Experts Warn Subscribe to our newsletter « Daily Galaxy » We are an independent media outlet that relies on advertising revenue to continue providing you with quality content. By watching a short ad, you directly contribute to our funding while keeping free access to our articles.",
      "published": "Sat, 07 Jun 2025 18:00:00 GMT"
    },
    {
      "id": "43e74f1f95e4d481c8c62bef2df01d15",
      "title": "Astronomers Astonished by Largest Explosion Since the Big Bang - futurism.com",
      "source": "futurism.com",
      "url": "https://futurism.com/astronomers-largest-explosion-big-bang",
      "image_url": "https://wordpress-assets.futurism.com/2025/06/astronomers-largest-explosion-big-bang.jpg",
      "summary": "JUN 7, 10:30 AM EDT by FRANK LANDYMORE Astronomers Astonished by Largest Explosion Since the Big Bang Behold: extreme nuclear transients. / Off World/ Black Holes/ Stars/ Supermassive Black Holes You've heard of how mighty supernovas are, or of the ungodly amounts of energy released by gamma ray bursts. But astronomers have just discovered a type of cosmic blast that...",
      "published": "Sat, 07 Jun 2025 14:30:40 GMT"
    },
    {
      "id": "30cdd0f2bd6cec188cd7c2d0d7699b10",
      "title": "June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/junes-full-strawberry-moon-illuminates-the-night-sky-next-week-heres-how-to-see-it",
      "image_url": "https://cdn.mos.cms.futurecdn.net/6VxZZXmCHNJEVUwD7VBdBa.jpg",
      "summary": "Fate of ispace moon lander in doubt June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it By Anthony Wood published 21 hours ago Don't miss the 2025 full \"Strawberry Moon\" when it rises above the southeastern horizon on June 10. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Sat, 07 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "24645bd893845f39753f05071841f103",
      "title": "Worms Caught Creating Superorganisms in the Wild for the First Time - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/worms-caught-creating-superorganisms/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/worms-caught-creating-superorganisms-in-the-wild-for-the-first-time.jpg",
      "summary": "Worms Caught Creating Superorganisms in the Wild for the First Time Scientists capture tiny worms creating towering “superorganisms” in the wild. Image credit: Daniela Perez | Indian Defence Review In a groundbreaking discovery, scientists have observed tiny nematode worms forming “superorganisms” by creating towering structures in the wild, a behavior previously only observed under experimental conditions. This phenomenon, captured by...",
      "published": "Fri, 06 Jun 2025 19:45:00 GMT"
    },
    {
      "id": "2b2ed9fc556b0bc742ef59de069a644f",
      "title": "If books could kill: The poison legacy lurking in libraries - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g2y9xq58no",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b804/live/51328d10-42fa-11f0-9630-fd015488de94.jpg",
      "summary": "If books could kill: The poison legacy lurking in libraries BBC Scotland Arts Correspondent Green dye was widely used in Victorian publishing The Victorians loved the colour green. In particular, they loved a vibrant shade of emerald created by combining copper and arsenic, which was used in everything from wallpaper to children's toys. \"This colour was very popular for most...",
      "published": "Sat, 07 Jun 2025 08:20:48 GMT"
    },
    {
      "id": "2d493638c81c0ba7bd6ae81fede87558",
      "title": "Oxford study finds 'extraordinary' tremors caused by tsunamis - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ce80p1rpe97o",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/a78c/live/1ab786f0-415b-11f0-9fa8-5dd0050201bd.jpg",
      "summary": "'Extraordinary' tremors caused by tsunamis - study The tsunamis became trapped in the Dickson Fjord, in Greenland A series of \"extraordinary\" tremors observed across the globe were caused by two tsunamis stranded within a fjord in Greenland, a new study has confirmed. During September and October 2023, the \"bizarre\" seismic activity was observed every 90 seconds over intermittent periods each...",
      "published": "Sat, 07 Jun 2025 08:17:20 GMT"
    },
    {
      "id": "5e38cca67217882b54a8117bb9470d96",
      "title": "DNA from 9,000-year-old skeletons disproves migratory waves theory from South Africa - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/dna-from-9000-year-old-skeletons-disproves-migratory-waves-theory-from-south-africa/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/05041908/south-africa-ancient-dna-skeletons-no-migration-waves.jpg",
      "summary": "DNA from 9,000-year-old skeletons disproves migratory waves theory from South Africa DNA from nine prehistoric skeletons, dated as far back as about 9,000 years ago, shows that early inhabitants near the southern Cape Province of South Africa experienced minimal population changes over many millennia. The site, known as Oakhurst rockshelter, is located about 4 miles (6. 4 km) from the...",
      "published": "Fri, 06 Jun 2025 19:24:52 GMT"
    }
  ]
}