{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-21 13:45:47",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "568c16c88752579354e12023325bbdab",
      "title": "NASA spacecraft around the moon photographs the crash site of a Japanese company's lunar lander - AP News",
      "source": "AP News",
      "url": "https://apnews.com/article/ispace-lunar-lander-moon-99765029f85bae58a15fd2231706ec86",
      "image_url": "https://apnews.com/favicon.ico",
      "summary": "Verify you are human by completing the action below. apnews.com needs to review the security of your connection before proceeding. Performance & security by Cloudflare",
      "published": "Fri, 20 Jun 2025 17:52:00 GMT"
    },
    {
      "id": "f1b74bcd03137603a85babd1bf0be286",
      "title": "Plants have a secret, second set of roots deep underground that scientists didn't know about - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/planet-earth/plants/plants-have-a-secret-second-set-of-roots-deep-underground-that-scientists-didnt-know-about",
      "image_url": "https://cdn.mos.cms.futurecdn.net/nRyQSxmx3L3FETiKS2K8Jc.jpg",
      "summary": "Vera C. Rubin Observatory pictures Plants have a secret, second set of roots deep underground that scientists didn't know about By Olivia Ferrari published 22 hours ago A global analysis deep in soil found 20% of plants studied have an unexpected deeper set of roots more than 3 feet underground. When you purchase through links on our site, we may...",
      "published": "Fri, 20 Jun 2025 15:54:13 GMT"
    },
    {
      "id": "31fc9ccdfca2e1da74049ce54d364578",
      "title": "The ocean is changing colors, researchers say. Here's what it means. - MSN",
      "source": "MSN",
      "url": "https://www.msn.com/en-us/weather/topstories/the-ocean-is-changing-colors-researchers-say-here-s-what-it-means/vi-AA1H389V",
      "image_url": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1H2WGJ.img?w=532&h=299&q=60&m=6&f=jpg&u=t",
      "summary": "The ocean is changing colors, researchers say. Here's what it means. Warming waters are causing the colors of the ocean to change -- a trend that could impact humans if it were to continue, according to new research. Watch: Sunken British superyacht raised from seabed The cause of the sinking, which killed seven of the 22 people onboard, is still...",
      "published": "Fri, 20 Jun 2025 20:21:02 GMT"
    },
    {
      "id": "ee51328c84a08fe0e352468179310912",
      "title": "1st images from the Vera C Rubin Observatory will drop on June 23. Here's why that's such a big deal - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/1st-images-from-the-vera-c-rubin-observatory-will-drop-on-june-23-heres-why-scientists-are-so-excited",
      "image_url": "https://cdn.mos.cms.futurecdn.net/jiTPEANzpaCXv2YPNkrto5.png",
      "summary": "Universe's 'missing' matter found! 1st images from the Vera C Rubin Observatory will drop on June 23. Here's why that's such a big deal By Robert Lea published 20 hours ago \"People are going to be amazed at what we're able to see already. \" When you purchase through links on our site, we may earn an affiliate commission. Here’s...",
      "published": "Fri, 20 Jun 2025 18:00:00 GMT"
    },
    {
      "id": "8d514ae8adbd2c89fa541ca5395d2f54",
      "title": "Ancient ‘Dragon Man’ DNA reveals mysterious human relative - Euronews.com",
      "source": "Euronews.com",
      "url": "https://www.euronews.com/culture/2025/06/20/ancient-dragon-man-dna-reveals-mysterious-human-relative",
      "image_url": "https://static.euronews.com/articles/stories/09/33/53/76/1200x675_cmsv2_5ede72f9-8ccb-5e01-a32c-ee2a3d939438-9335376.jpg",
      "summary": "With your agreement, we and our 190 partners use cookies or similar technologies to store, access, and process personal data like your visit on this website, IP addresses and cookie identifiers. Some partners do not ask for your consent to process your data and rely on their legitimate business interest. You can withdraw your consent or object to data processing...",
      "published": "Fri, 20 Jun 2025 13:25:50 GMT"
    },
    {
      "id": "42b3358efa9ef4cf8a49714d08c8b8bc",
      "title": "It turns out weather on other planets is a lot like on Earth - The Washington Post",
      "source": "The Washington Post",
      "url": "https://www.washingtonpost.com/science/2025/06/21/planets-weather-storms-earth-similarities-models/",
      "image_url": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JA5UURNX3BFTNPWZE2HMTALMAQ.jpg&w=1440",
      "summary": "It turns out weather on other planets is a lot like on Earth If you looked at the churning clouds near Jupiter’s pole, they appear like ocean currents on Earth — as if you’re looking at small edges and meandering fronts in the Baltic Sea. Ammonia-rich clouds, which are governed by similar laws of physics as ocean eddies on Earth,...",
      "published": "Sat, 21 Jun 2025 11:31:53 GMT"
    },
    {
      "id": "1568548abdba8ad1a89b4b14a87a4177",
      "title": "Sea spiders found farming methane-eating microbes in cultivated biofilm - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-sea-spiders-farming-methane-microbes.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 20.161.78.129 : eb30e6f4-e528-41f2-b931-a4121153",
      "published": "Fri, 20 Jun 2025 13:13:20 GMT"
    },
    {
      "id": "2a430c338f2fc28a5062cf82f633e8f3",
      "title": "Scientists say a tiny brown moth navigates 600 miles using stars — just like humans and birds - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/20/science/bogong-moth-star-navigation",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/bogong-moth.jpg?c=16x9&q=w_800,c_fill",
      "summary": "Scientists say a tiny brown moth navigates 600 miles using stars — just like humans and birds Published 12:46 PM EDT, Fri June 20, 2025 The nocturnal Bogong moth makes an epic journey to cool caves in the Australian Alps, a study found. Ajay Narendra (CNN) — Each year, a tiny species in Australia makes a grueling 620-mile (1,000-kilometer) nighttime...",
      "published": "Fri, 20 Jun 2025 16:46:00 GMT"
    },
    {
      "id": "be8707a798ae40dd2522f0a6d4adf05f",
      "title": "Two mathematicians discover a new way to count prime numbers - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/two-mathematicians-discover-a-new-way-to-count-prime-numbers/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/19061204/prime-numbers_math-systems_1m.jpg",
      "summary": "Two mathematicians discover a new way to count prime numbers Prime numbers captivate number theory lovers because these basic blocks influence so many areas of mathematics. Even though their distribution might look unpredictable, these special numbers follow patterns that are still coming to light. In 300 BCE, Euclid proved there are infinitely many primes. He revealed that no matter how...",
      "published": "Thu, 19 Jun 2025 12:15:42 GMT"
    },
    {
      "id": "0d248374ef1939483fe3fa9045d0dade",
      "title": "NASA’s Voyager 1 Is Set to Shatter Space Records – Becoming the First Object to Travel a Light-Day From Earth! - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/nasas-voyager-1-to-shatter-space-records/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASAs-Voyager-1-Is-Set-to-Shatter-Space-Records-–-Becoming-the-First-Object-to-Travel-a-Light-Day-From-Earth.jpg",
      "summary": "NASA’s Voyager 1 Is Set to Shatter Space Records – Becoming the First Object to Travel a Light-Day From Earth! By 2026, NASA’s Voyager 1 will achieve the unthinkable, becoming the first human-made object to travel a light-day from Earth! Image credit: NASA Science | The Daily Galaxy --Great Discoveries Channel In November 2026, NASA’s Voyager 1 spacecraft will achieve...",
      "published": "Fri, 20 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "50c9cd1b1e0f3379ab63580683b9211b",
      "title": "This galaxy cluster has mysterious cosmic tendrils over 200,000 light-years long (image) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/galaxies/this-galaxy-cluster-has-mysterious-cosmic-tendrils-over-200-000-light-years-long-image",
      "image_url": "https://cdn.mos.cms.futurecdn.net/KfJxx6NpvqDcpifsKN4jnP.png",
      "summary": "Universe's 'missing' matter found! This galaxy cluster has mysterious cosmic tendrils over 200,000 light-years long (image) By Robert Lea published 19 hours ago They're related to galaxies dominated by supermassive black holes. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The radio emission of Tailed Radio Galaxy, observed at 144...",
      "published": "Fri, 20 Jun 2025 19:00:00 GMT"
    },
    {
      "id": "807e65cfa8fae84ce7c5e8a02cdd8dc1",
      "title": "Passing star could send Earth into the sun - The Independent",
      "source": "The Independent",
      "url": "https://www.independent.co.uk/bulletin/news/earth-orbit-hit-sun-star-b2773494.html",
      "image_url": "https://static.independent.co.uk/2025/01/12/12/iStock-1365125730.jpg?width=1200&height=800&crop=1200:800",
      "summary": "We are 8 logo (opens in a new tab) Passing star could send Earth into the sun A new study published in the journal Icarus suggests that passing field stars could cause more instability in our solar system than previously believed. Astronomers Nathan Kaib and Sean Raymond found that isolated models underestimate future orbital changes of giant planets, indicating that...",
      "published": "Fri, 20 Jun 2025 10:42:00 GMT"
    },
    {
      "id": "e85769a5b5ce0079479f50f3c53ae73d",
      "title": "Something Big Is Twisting Mercury’s Crust - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/whats-twisting-mercurys-crust-scientists-have-a-new-suspect-2000618162",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/mercury-1-1200x675.jpg",
      "summary": "Something Big Is Twisting Mercury’s Crust As the closest planet to the Sun, Mercury is exposed to the star's enormous gravitational field. And it's really stressful. Published June 20, 2025 | Comments (10) | NASA's MESSENGER spacecraft captured Mercury's southern hemisphere during its mission between 2011 to 2015. NASA/Johns Hopkins University Applied Physics Laboratory/Carnegie Institution of Washington Mercury has it...",
      "published": "Fri, 20 Jun 2025 18:00:50 GMT"
    },
    {
      "id": "89da2e5f163a144df3c6fce3328026e2",
      "title": "Powerful X-class solar flare erupts from sun, knocking out radio signals across the Pacific (video) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/sun/powerful-x-class-solar-flare-erupts-from-sun-knocking-out-radio-signals-across-the-pacific-video",
      "image_url": "https://cdn.mos.cms.futurecdn.net/zRZ6kGssWktrZTvpcJ7qiU.jpg",
      "summary": "Powerful X-class solar flare erupts from sun, knocking out radio signals across the Pacific (video) By Daisy Dobrijevic published yesterday Sunspot region 4114 has done it again! This time unleashing a colossal X1. 9 solar flare. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Click here for more Space. com...",
      "published": "Fri, 20 Jun 2025 11:51:20 GMT"
    },
    {
      "id": "357b4f5cf2426f761f997547887cb2e0",
      "title": "Thousands of Previously Unseen Colors Captured in the Sculptor Galaxy by ESO’s VLT – Very Large Telescope - Good News Network",
      "source": "Good News Network",
      "url": "https://www.goodnewsnetwork.org/thousands-of-previously-unseen-colors-captured-in-the-sculptor-galaxy-by-esos-very-large-telescope/",
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/06/Thousands-of-previously-unseen-colors-captured-in-the-Sculptor-Galaxy-–-ESO-VLT-Very-Large-Telescope.jpg",
      "summary": "Home All News Science Thousands of Previously Unseen Colors Captured in the Sculptor Galaxy by ESO’s. .. Thousands of Previously Unseen Colors Captured in the Sculptor Galaxy by ESO’s VLT – Very Large Telescope Thousands of previously unseen colors captured in the Sculptor Galaxy by ESO’s VLT – Very Large Telescope / ESO This image of the Sculptor Galaxy was...",
      "published": "Fri, 20 Jun 2025 11:00:27 GMT"
    },
    {
      "id": "c4b98872fb97ac082ff4ac066696cdf0",
      "title": "Satellite streaks block out the Arctic sky photo of the day for June 20, 2025 - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/earth/satellite-streaks-block-out-canadian-skies-space-photo-of-the-day-for-june-20-2025",
      "image_url": "https://cdn.mos.cms.futurecdn.net/fQiRut3eSaZSEB8KxNj2DB.jpg",
      "summary": "Universe's 'missing' matter found! Satellite streaks block out the Arctic sky | Space photo of the day for June 20, 2025 By Kenna Hughes-Castleberry published 23 hours ago Researchers created a satellite tracking system to track satellite streaks across the Arctic for the first time ever. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Fri, 20 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "2ba2a8cb5288b5b300efc109b4d957ea",
      "title": "ESA’s Proba-3 Mission Reveals Unseen Secrets of the Sun’s Hidden Corona - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/proba-3-mission-unseen-sun-hidden-corona/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/ESAs-Proba-3-Mission-Reveals-Unseen-Secrets-of-the-Suns-Hidden-Corona.jpg",
      "summary": "ESA’s Proba-3 Mission Reveals Unseen Secrets of the Sun’s Hidden Corona ESA’s Proba-3 mission captures unprecedented images of the Sun’s corona. Credit: ESA-P. Carril | The Daily Galaxy --Great Discoveries Channel On June 16, 2025, the European Space Agency (ESA) unveiled groundbreaking images of the Sun’s outer atmosphere, the solar corona, thanks to its Proba-3 mission. This mission achieved an...",
      "published": "Fri, 20 Jun 2025 19:30:00 GMT"
    },
    {
      "id": "b1636948a8e225e9108971350edf2c77",
      "title": "ESA signs agreement for potential use of Orbital Reef - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/esa-signs-agreement-for-potential-use-of-orbital-reef/",
      "image_url": "https://spacenews.com/wp-content/uploads/2022/04/Orbital-Reef_FullColor_ExternalHD-scaled.jpeg",
      "summary": "Covering the business and politics of space ESA signs agreement for potential use of Orbital Reef Blue Origin and Sierra Space announced Orbital Reef in October 2021 as part of a partnership with Boeing, Redwire Space and several other companies and organizations. The station will ultimately feature a series of laboratory and habitation modules. PARIS — The European Space Agency...",
      "published": "Fri, 20 Jun 2025 11:22:21 GMT"
    },
    {
      "id": "19c94c31b5706d9d50b6c8f69f4f5861",
      "title": "Strange signals detected from Antarctic ice seem to defy laws of physics. Scientists are searching for an answer - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/20/science/anomalous-signals-antarctica-neutrino-detectors",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/anita-internal1-sized.jpg?c=16x9&q=w_800,c_fill",
      "summary": "Strange signals detected from Antarctic ice seem to defy laws of physics. Scientists are searching for an answer Updated 8:49 PM EDT, Fri June 20, 2025 NASA’s Antarctic Impulsive Transient Antenna, or ANITA, experiment flew over stretches of Antarctic ice via a balloon. Stephanie Wissel/Penn State Sign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on...",
      "published": "Sat, 21 Jun 2025 00:49:00 GMT"
    },
    {
      "id": "1b63e8e3fdb5d3d1a03f4f40ee253c55",
      "title": "New Clues Emerge on How Life Survived 'Snowball Earth' - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/new-clues-emerge-on-how-life-survived-snowball-earth",
      "image_url": "https://www.sciencealert.com/images/2025/06/snowball-earth-pond-1.jpg",
      "summary": "New Clues Emerge on How Life Survived 'Snowball Earth' Astonishing diversity of life has been found in tiny pools of melted ice in Antarctica. (Detailfoto/Getty Images) Earth has not always been so hospitable to live. During several ice ages, the planet's surface was almost completely frozen over, creating what has been dubbed \"Snowball Earth\". Liquid water appears to be the...",
      "published": "Fri, 20 Jun 2025 22:51:07 GMT"
    }
  ]
}