{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-25 03:09:19",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "c6023e8277670bd694ab6fe16d69cb44",
      "title": "Can you spot these hidden cosmic jewels in the Vera C. Rubin Observatory's groundbreaking first image? - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/astronomy/6-incredible-objects-hidden-in-vera-c-rubin-observatorys-mind-boggling-first-image",
      "image_url": "https://cdn.mos.cms.futurecdn.net/MS882g5d5fEAndAyvRtKYn.jpg",
      "summary": "Vera C. Rubin Observatory 1st pictures Salmon-hat wearing orcas massage with kelp Mystery of Queen Hapshepsut's statues 6 incredible objects hidden in Vera C. Rubin Observatory's mind-boggling first image By Brandon Specktor published 6 hours ago The Vera C. Rubin Observatory's first image release includes a 'staggering' view of 10 million galaxies in and around the Virgo Cluster. Here are...",
      "published": "Tue, 24 Jun 2025 20:57:54 GMT"
    },
    {
      "id": "39f9dd5303597a7598c76c3c0753147f",
      "title": "Final photo from iconic US satellite shows how Las Vegas has 'doubled' in size over the last 25 years - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/planet-earth/final-photo-from-iconic-us-satellite-shows-how-las-vegas-has-doubled-in-size-over-the-last-25-years-earth-from-space",
      "image_url": "https://cdn.mos.cms.futurecdn.net/N3JkcdbvT9yo6kf4fyDZMi.gif",
      "summary": "Vera C. Rubin Observatory 1st pictures 'Ghost' plume under Middle East Final photo from iconic US satellite shows how Las Vegas has 'doubled' in size over the last 25 years — Earth from space By Harry Baker published 18 hours ago The final image captured by the recently decommissioned Landsat 7 satellite shows how \"Sin City\" has nearly doubled in...",
      "published": "Tue, 24 Jun 2025 09:27:40 GMT"
    },
    {
      "id": "1b5e42e4e25d458ebb9b81e33e67f7ee",
      "title": "Mars rover captures first close-up photos of giant 'spiderwebs' on the Red Planet - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/mars/mars-rover-captures-first-close-up-photos-of-giant-spiderwebs-on-the-red-planet",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Gm2dhk3n2cBZzqoLPPMCy3.jpg",
      "summary": "Vera C. Rubin Observatory 1st pictures Salmon-hat wearing orcas massage with kelp Mystery of Queen Hapshepsut's statues Mars rover captures first close-up photos of giant 'spiderwebs' on the Red Planet By Harry Baker published 13 hours ago NASA's Curiosity rover has snapped its first images of web-like \"boxwork\" features on the surface of Mars. The zig-zagging rocks could provide clues...",
      "published": "Tue, 24 Jun 2025 13:37:22 GMT"
    },
    {
      "id": "c13d4adbe6e7a2c0364274d9515f7745",
      "title": "Laser rangefinder problems blamed for second ispace lunar lander crash - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/laser-rangefinder-problems-blamed-for-second-ispace-lunar-lander-crash/",
      "image_url": "https://spacenews.com/wp-content/uploads/2024/09/ispace-m2lander.jpg",
      "summary": "Covering the business and politics of space Laser rangefinder problems blamed for second ispace lunar lander crash Resilience, the second lunar lander by Japanese company ispace, during prelaunch preparations. Credit: ispace WASHINGTON — Japanese company ispace says it believes its second lunar lander mission crashed because of problems with a laser rangefinder used to determine altitude during its descent. At...",
      "published": "Tue, 24 Jun 2025 08:28:20 GMT"
    },
    {
      "id": "944fda3f0c9c22a9b220735e8830642c",
      "title": "Stunning amber fossil reveals ‘Last of Us’-type fungus likely lived alongside dinosaurs - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/24/science/amber-insect-zombie-fungi-fossil",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/2021-03-10-21-33-03-b-radius8-smoothing4.jpg?c=16x9&q=w_800,c_fill",
      "summary": "Stunning amber fossil reveals ‘Last of Us’-type fungus likely lived alongside dinosaurs Published 2:34 PM EDT, Tue June 24, 2025 Fungus can be seen growing out of the head of a fly encased in 99 million-year-old amber. Nanjing Institute of Geology and Palaeontology; Chinese Academy of Sciences/NIGPAS Sign up for CNN’s Wonder Theory science newsletter. Explore the universe with news...",
      "published": "Tue, 24 Jun 2025 18:34:00 GMT"
    },
    {
      "id": "ead0965c6b52fc132bd7808426611636",
      "title": "Northern lights may be visible in these 14 US States on June 25 - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/auroras/northern-lights-may-be-visible-in-these-14-us-states-on-june-25",
      "image_url": "https://cdn.mos.cms.futurecdn.net/TS86zXv2V7NQBDcFcw2E2H.jpg",
      "summary": "Universe's 'missing' matter found! Northern lights may be visible in these 14 US States on June 25 By Daisy Dobrijevic published 12 hours ago Auroras may be visible from Alaska to South Dakota as a giant hole in the sun's atmosphere shakes up geomagnetic activity in the coming days. When you purchase through links on our site, we may earn...",
      "published": "Tue, 24 Jun 2025 15:00:00 GMT"
    },
    {
      "id": "433f291faa35eaa5b2b35f6858ec808e",
      "title": "After successfully entering Earth’s atmosphere, a European spacecraft is lost - Ars Technica",
      "source": "Ars Technica",
      "url": "https://arstechnica.com/space/2025/06/a-european-spacecraft-company-flies-its-vehicle-then-loses-it-after-reentry/",
      "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/6847cf4bb734a2e5b185eaab_Image-15-p-2000-1152x648.jpg",
      "summary": "After successfully entering Earth’s atmosphere, a European spacecraft is lost \"This partial success reflects both ambition and the inherent risks of innovation. \" The Mission Possible vehicle is seen during assembly. Credit: The Exploration Company A European company that seeks to develop orbital spacecraft for cargo, and eventually humans, took a step forward this week with a test flight that...",
      "published": "Tue, 24 Jun 2025 12:32:24 GMT"
    },
    {
      "id": "f8dc9555e9506c8bf1e0882a73c516e0",
      "title": "Construction on Mars takes a leap forward - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-mars.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 20.102.223. 140 : 14093ba7-8ed9-428d-8928-6d79819c",
      "published": "Tue, 24 Jun 2025 13:01:04 GMT"
    },
    {
      "id": "9812552e33c8d77412e3b7929f471d6d",
      "title": "Fossils from giant possum-like mammal that lived 60 million years ago found in Texas - ABC News - Breaking News, Latest News and Videos",
      "source": "ABC News - Breaking News, Latest News and Videos",
      "url": "https://abcnews.go.com/US/fossils-giant-possum-mammal-lived-60-million-years/story?id=123152315",
      "image_url": "https://i.abcnewsfe.com/a/2216ee0a-08cb-463e-a0db-18c4605a5aaa/fossil-possum-ht-jt-250624_1750779024745_hpMain_16x9.jpg?w=1600",
      "summary": "Fossils from giant possum-like mammal that lived 60 million years ago found in Texas The fossils were found at Big Bend National Park in Texas. Paleontologists have found fossilized remains of a giant possum-like mammal that lived 60 million years ago. The fossils, found at Big Bend National Park in Texas, belong to a group of ancient near-marsupials from the...",
      "published": "Tue, 24 Jun 2025 16:35:12 GMT"
    },
    {
      "id": "4aea1ccc89a243f35f3ea899b2796954",
      "title": "Chicago man's plan to honor astronomy-loving father ends in mishap - Chicago Sun-Times",
      "source": "Chicago Sun-Times",
      "url": "https://chicago.suntimes.com/news/2025/06/23/chicago-man-honors-late-dad-with-starman-style-tribute",
      "image_url": "https://cst.brightspotcdn.com/dims4/default/5000f2e/2147483647/strip/true/crop/2557x1460+0+724/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F88%2F8f%2F0537a00543bb8dedc22be5dd4d12%2Fimg-1835.jpeg",
      "summary": "Everyone deserves trustworthy local reporting. You help make that happen. Chicago man's plan to honor astronomy-loving father ends in mishap Griffin Lau and his brother celebrated their late father, Curtis Lau, a fan of space travel, in a special tribute by sending his ashes on a short trip to Earth’s orbit on a rocket that launched Monday from California, but...",
      "published": "Tue, 24 Jun 2025 02:07:00 GMT"
    },
    {
      "id": "24917d51c4f7d002e889d21e514a936f",
      "title": "Scientists have created healthy, fertile mice with two fathers - The Economist",
      "source": "The Economist",
      "url": "https://www.economist.com/science-and-technology/2025/06/24/scientists-have-created-healthy-fertile-mice-with-two-fathers",
      "image_url": "https://www.economist.com/content-assets/images/20250628_STP506.jpg",
      "summary": "Science & technology | Dad bods Scientists have created healthy, fertile mice with two fathers Bipaternal human children, though, are still far away",
      "published": "Tue, 24 Jun 2025 15:51:46 GMT"
    },
    {
      "id": "a9299edc27c54f386aece666effac86b",
      "title": "Natural History Museum to display rare dog-sized dinosaur - BBC",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cglzy4zndp0o",
      "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/dd73/live/124ac190-5109-11f0-a466-d54f65b60deb.jpg",
      "summary": "Dog-sized dinosaur that ran around feet of giants discovered Reporting fromNatural History Museum, London The full name of the new species is Enigmacursor mollyborthwickae dinosaur A labrador-sized dinosaur was wrongly categorised when it was found and is actually a new species, scientists have discovered. Its new name is Enigmacursor - meaning puzzling runner - and it lived about 150 million...",
      "published": "Tue, 24 Jun 2025 23:14:05 GMT"
    },
    {
      "id": "c8e1aa12178c18fc905b0033cfd25af5",
      "title": "Something Strange Is Happening 1,700 Miles Beneath Your Feet. Now We Know Why. - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/something-strange-happening-1-700-130000574.html",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/zvVcX6ryPMEg8jTG5Yvk_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/279f822709448b2edbe6b52a75743e15",
      "summary": "Trump vents frustration with Israel and Iran Abortion in America 3 years after repeal Something Strange Is Happening 1,700 Miles Beneath Your Feet. Now We Know Why. Tue, June 24, 2025 at 1:00 PM UTC Something Strange Is Happening Beneath Your Feet Paolo Carnassale - Getty Images \"Hearst Magazines and Yahoo may earn commission or revenue on some items through...",
      "published": "Tue, 24 Jun 2025 13:00:00 GMT"
    },
    {
      "id": "a9067f861ba9ba74bc4622d3976ddb26",
      "title": "2032 'City-Killer' Impact Threatens Earth's Satellites, Study Finds - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/2032-city-killer-impact-threatens-earths-satellites-study-finds",
      "image_url": "https://www.sciencealert.com/images/2025/06/city_killer_satellite_impact_header.jpg",
      "summary": "2032 'City-Killer' Impact Threatens Earth's Satellites, Study Finds If a huge asteroid smashes into the Moon in 2032, the gigantic explosion would send debris streaming towards Earth that would threaten satellites and create a spectacular meteor shower, according to researchers. Earlier this year there were briefly fears that the 60-metre-wide (200-foot-wide) asteroid called 2024 YR4, which is big enough to...",
      "published": "Tue, 24 Jun 2025 01:25:54 GMT"
    },
    {
      "id": "047b97aa6824e70fc43b5cb8ab55e196",
      "title": "Why the Shortest Day of Your Life Could Happen This Summer - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/why-the-shortest-day-of-your-life-could-happen-this-summer-2000619219",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/earth-and-moon-1200x675.jpg",
      "summary": "Why the Shortest Day of Your Life Could Happen This Summer This year's shortest day—Earth's fastest single rotation—will likely fall on July 9, July 22, or August 5. Published June 24, 2025 | Comments (10) | The Earth might complete its fastest spin on record sometime this summer. © NASA/JPL/USGS Earth might be about to spin out its fastest day...",
      "published": "Tue, 24 Jun 2025 13:25:07 GMT"
    },
    {
      "id": "a4cbe32a71d0e16e80bfa4e98cc6b144",
      "title": "Scientists found some of the \"missing matter\" in the universe after searching for decades - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/scientists-think-they-found-some-of-the-missing-matter-in-the-universe-cosmic-filaments/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/24122729/cosmic-filament_four-galaxy-clusters_missing-matter_ESA_1m.jpg",
      "summary": "Scientists found some of the \"missing matter\" in the universe after searching for decades Cosmologists have known for decades that only a sliver of the universe is made of the same stuff as people, planets, and pets. Analyses of the cosmic microwave background by the Planck satellite pinned ordinary matter to just under five percent of everything that exists. Surveys...",
      "published": "Tue, 24 Jun 2025 18:42:39 GMT"
    },
    {
      "id": "24feda1a9a7423bd6faf4c1be6f4f25a",
      "title": "A failed Soviet Venus probe from the '70s crashed to Earth in May — why was it so hard to track? - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/launches-spacecraft/a-failed-soviet-venus-probe-from-the-70s-crashed-to-earth-in-may-why-was-it-so-hard-to-track",
      "image_url": "https://cdn.mos.cms.futurecdn.net/HQQJ5fYvwyexxoLrrbpLW4.jpg",
      "summary": "Universe's 'missing' matter found! Space Exploration Launches & Spacecraft A failed Soviet Venus probe from the '70s crashed to Earth in May — why was it so hard to track? By Leonard David published yesterday \"Being off even a little bit represents hundreds or thousands of kilometers in distance on the surface of the Earth. \" When you purchase through...",
      "published": "Mon, 23 Jun 2025 17:00:00 GMT"
    },
    {
      "id": "32b983d789b20ba5a76a1c897179b09f",
      "title": "This Deep-Sea Blood-Red Squid’s Rare Footage Will Leave You Breathless—Captured for the First Time Ever - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/this-deep-sea-blood-red-squids-rare-footage-will-leave-you-breathless-captured-for-the-first-time-ever/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/blood-red-squid.jpg",
      "summary": "This Deep-Sea Blood-Red Squid’s Rare Footage Will Leave You Breathless—Captured for the First Time Ever A rare blood-red squid has been filmed for the first time, revealing an elusive creature from the depths of the Antarctic Ocean. Scientists have captured stunning footage of this mysterious species never before seen in its natural habitat. This Deep-Sea Blood-Red Squid’s Rare Footage Will...",
      "published": "Tue, 24 Jun 2025 12:31:00 GMT"
    },
    {
      "id": "b6b2f30225ca1f331337400b425cb666",
      "title": "NASA Satellite That’s Been Dead for 57 Years Sends Mysterious Signal to Earth - Gizmodo",
      "source": "Gizmodo",
      "url": "https://gizmodo.com/nasa-satellite-thats-been-dead-for-57-years-sends-mysterious-signal-to-earth-2000619464",
      "image_url": "https://gizmodo.com/app/uploads/2025/06/relay_1_2-1200x675.jpg",
      "summary": "NASA Satellite That’s Been Dead for 57 Years Sends Mysterious Signal to Earth Relay-2 emitted a powerful fast radio burst that lasted for less than 30 nanoseconds. Published June 24, 2025 | Comments (35) | An illustration of the Relay-2 satellite. NASA A little over a year ago, scientists in Australia picked up a brief burst of electromagnetic radiation. The...",
      "published": "Tue, 24 Jun 2025 16:05:27 GMT"
    },
    {
      "id": "49bd5c75f57b2208a6dc2d758e1dc6fe",
      "title": "Mysterious “Dragon Man” Skull Identified As Denisovan - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/mysterious-dragon-man-skull-identified-as-denisovan/",
      "image_url": "https://scitechdaily.com/images/Harbin-Skull.jpg",
      "summary": "Home»Science»Mysterious “Dragon Man” Skull Identified As Denisovan Mysterious “Dragon Man” Skull Identified As Denisovan A picture of the Harbin skull. Credit: Fu et al. , Cell, 2025 The Harbin skull confirms Denisovan ancestry and expands their known range using protein and DNA analysis from dental calculus. What did Denisovans look like, despite their known genetic contributions to modern East Asian...",
      "published": "Mon, 23 Jun 2025 08:26:29 GMT"
    }
  ]
}