{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-28 08:00:57",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "eb2a3a57b153c1c8b800f5c844286ffb",
      "title": "Obscure rock formation in Canada may contain the world's oldest minerals - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/planet-earth/geology/rocks-in-canada-may-be-oldest-on-earth-dating-back-4-16-billion-years",
      "image_url": "https://cdn.mos.cms.futurecdn.net/vm6tSwL8pJoNR9tCnwAgRm.jpg",
      "summary": "Rocks in Canada may be oldest on Earth, dating back 4. 16 billion years By Ben Turner published 12 hours ago The rocks could offer insight into Earth's primordial crust and the environment that gave birth to life. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. (Image credit: David Hutt...",
      "published": "Fri, 27 Jun 2025 19:38:19 GMT"
    },
    {
      "id": "d7509565f494cc09e714ee9dbdf94d7b",
      "title": "Rare daytime fireball bright enough to be seen from orbit may have punched a hole in a house in Georgia - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/rare-daytime-fireball-bright-enough-to-be-seen-from-orbit-may-have-punched-a-hole-in-a-house-in-georgia",
      "image_url": "https://cdn.mos.cms.futurecdn.net/nyDmuZZTXppn2TbJZrdKZf.gif",
      "summary": "Daytime fireball meteorite hits house! Rare daytime fireball bright enough to be seen from orbit may have punched a hole in a house in Georgia By Anthony Wood published 18 hours ago The fireball was bright enough to be spotted by a lightning-tracking satellite from orbit. When you purchase through links on our site, we may earn an affiliate commission.",
      "published": "Fri, 27 Jun 2025 13:45:37 GMT"
    },
    {
      "id": "647ffc7eef8c8ece2fbc2d097ed7620d",
      "title": "Janet Petro's Embrace The Challenge Update 27 June 2025: \"Voluntary Workforce Shaping\" - NASA Watch",
      "source": "NASA Watch",
      "url": "https://nasawatch.com/ask-the-administrator/janet-petros-embrace-the-challenge-update-27-june-2025-voluntary-workforce-shaping/",
      "image_url": null,
      "summary": "Verify you are human by completing the action below. nasawatch.com needs to review the security of your connection before proceeding. Performance & security by Cloudflare",
      "published": "Fri, 27 Jun 2025 19:37:24 GMT"
    },
    {
      "id": "b6270f6ac580bdfbb35c8df74456c245",
      "title": "Chile observatory captures the universe with 3,200-megapixel camera - Reuters",
      "source": "Reuters",
      "url": "https://www.reuters.com/science/chile-observatory-captures-universe-with-3200-megapixel-camera-2025-06-27/",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Fri, 27 Jun 2025 12:49:11 GMT"
    },
    {
      "id": "8697d90fd625e907bb390f543dba2235",
      "title": "'Zombie' Fungus Caught Bursting From Host Bodies 99 Million Years Ago - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/zombie-fungus-caught-bursting-from-host-bodies-99-million-years-ago",
      "image_url": "https://www.sciencealert.com/images/2025/06/zombie-fungus-in-amber.jpg",
      "summary": "'Zombie' Fungus Caught Bursting From Host Bodies 99 Million Years Ago Fungi have been invading the brains of insect hosts for millions of years. (Zhuang et al. , Proc. R. Soc. B., 2025) Scientists have caught ancient parasitic fungi in the act of bursting from insect hosts, in dramatic scenes frozen in amber. Dating back almost 100 million years, these...",
      "published": "Fri, 27 Jun 2025 04:55:56 GMT"
    },
    {
      "id": "9c9840aa9b7f985d938780e544dd4f92",
      "title": "New SLS booster design suffers anomaly during test - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/new-sls-booster-design-suffers-anomaly-during-test/",
      "image_url": "https://spacenews.com/wp-content/uploads/2025/06/slsbole-debris-june2025.jpeg",
      "summary": "Covering the business and politics of space New SLS booster design suffers anomaly during test Debris flies away from the nozzle of the BOLE solid rocket booster during a static-fire test June 26. Credit: NASA webcast WASHINGTON — A new version of the solid rocket booster being developed for the Space Launch System experienced an anomaly during a test firing...",
      "published": "Fri, 27 Jun 2025 15:29:52 GMT"
    },
    {
      "id": "2ff30678ea8821238adbbfbdb8ce2bae",
      "title": "Scientists discover rare planet at the edge of the Milky Way using space-time phenomenon predicted by Einstein - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/space/scientists-discover-rare-planet-at-the-edge-of-the-milky-way-using-space-time-phenomenon-predicted-by-einstein",
      "image_url": "https://cdn.mos.cms.futurecdn.net/5NEBV786zgPDE4dBetTPB7.jpg",
      "summary": "Scientists discover rare planet at the edge of the Milky Way using space-time phenomenon predicted by Einstein By Ben Turner published 14 hours ago Using gravitational microlensing, scientists have discovered a rare, large planet at the edge of the Milky Way. The planet is only the third to be found on the outskirts of our galaxy's dense central bulge. When...",
      "published": "Fri, 27 Jun 2025 18:08:31 GMT"
    },
    {
      "id": "04a9534b88c756d7506edffe72643375",
      "title": "Webb telescope discovers and photographs its first exoplanet - TechSpot",
      "source": "TechSpot",
      "url": "https://www.techspot.com/news/108469-webb-telescope-discovers-photographs-first-exoplanet.html",
      "image_url": "https://www.techspot.com/images2/news/bigimage/2025/06/2025-06-26-image-27.jpg",
      "summary": ".st0{fill-rule:evenodd;clip-rule:evenodd;} Webb telescope discovers and photographs its first exoplanet Webb spies distant exoplanet using infrared imagery By Shawn Knight June 26, 2025 at 12:53 PM Serving tech enthusiasts for over 25 years. TechSpot means tech analysis and advice you can trust. WHAT JUST HAPPENED? The James Webb space telescope has captured what is likely to be the first exoplanet discovered...",
      "published": "Thu, 26 Jun 2025 17:53:29 GMT"
    },
    {
      "id": "c1405d00c9efb23a4ec0ac5fccca5b97",
      "title": "Bootid meteor shower 2025 peaks tonight — Here's what you need to know - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/bootid-meteor-shower-2025-peaks-tonight-heres-what-you-need-to-know",
      "image_url": "https://cdn.mos.cms.futurecdn.net/SgKJPJNj9D2CkiWqSjYAim.jpg",
      "summary": "Rubin Observatory's 1st stunning images! Bootid meteor shower 2025 peaks tonight: Here's what you need to know By Anthony Wood published 18 hours ago The meteor shower radiant can be found in the constellation Bootes. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A meteor captured crossing the Milky Way...",
      "published": "Fri, 27 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "8eac334bb060d3001a16ed69ba1cf900",
      "title": "Scientists Uncover Ancient Apex Predators that Dominated the Oceans 100 Million Years Ago - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/ancient-apex-predators-dominated-oceans/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/scientists-uncover-ancient-apex-predators-that-dominated-the-oceans-100-million-years-ago.jpg",
      "summary": "Scientists Uncover Ancient Apex Predators that Dominated the Oceans 100 Million Years Ago Scientists have uncovered startling evidence that ancient apex predators ruled the oceans 100 million years ago. Image credit: Shutterstock | Indian Defence Review A groundbreaking study published in Science has revealed that ancient squids were not only abundant but also dominated the oceans around 100 million years...",
      "published": "Fri, 27 Jun 2025 17:25:00 GMT"
    },
    {
      "id": "1af2f9263b1e7de598950fe7eb4b6828",
      "title": "Discovery of 'mini halo' points to how the early universe was formed - Phys.org",
      "source": "Phys.org",
      "url": "https://phys.org/news/2025-06-discovery-mini-halo-early-universe.html",
      "image_url": null,
      "summary": "Please complete security verification This request seems a bit unusual, so we need to confirm that you're human. Please press and hold the button until it turns completely green. Thank you for your cooperation! If you believe this is an error, please contact our support team. 172.214.175. 241 : 8c44a97b-c735-4db6-9cd9-e69063b8",
      "published": "Thu, 26 Jun 2025 23:00:01 GMT"
    },
    {
      "id": "48f4d9570bd571eb66587e94857824c0",
      "title": "Hello, neighbor! See the Andromeda galaxy like never before in stunning new image from NASA's Chandra telescope (video) - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/hello-neighbor-see-the-andromeda-galaxy-like-never-before-in-stunning-new-image-from-nasas-chandra-telescope-video",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Ku3YoMfWSg2NHNcvTAFhkm.png",
      "summary": "Daytime fireball meteorite hits house! Hello, neighbor! See the Andromeda galaxy like never before in stunning new image from NASA's Chandra telescope (video) By Robert Lea published 16 hours ago Created as a tribute to dark matter pioneer Vera Rubin, the image was created with the aid of a vast array of telescopes. When you purchase through links on our...",
      "published": "Fri, 27 Jun 2025 16:00:00 GMT"
    },
    {
      "id": "c0d9be5cf5a842d557dabaf7d53bea18",
      "title": "NASA Mars Orbiter Learns New Moves After Nearly 20 Years in Space - NASA (.gov)",
      "source": "NASA (.gov)",
      "url": "https://www.nasa.gov/missions/mars-reconnaissance-orbiter/nasa-mars-orbiter-learns-new-moves-after-nearly-20-years-in-space/",
      "image_url": "https://www.nasa.gov/wp-content/uploads/2025/06/1-pia04918-mro-artists-concept.jpg",
      "summary": "NASA Mars Orbiter Learns New Moves After Nearly 20 Years in Space An antenna sticks out like whiskers from NASA’s Mars Reconnaissance Orbiter in this artist’s concept of the spacecraft, which has been orbiting the Red Planet since 2006. This antenna is part of SHARAD, a radar that peers below the Martian surface. The Mars Reconnaissance Orbiter is testing a...",
      "published": "Thu, 26 Jun 2025 16:12:28 GMT"
    },
    {
      "id": "7512f13cce988fc2870779cc6017ca46",
      "title": "Human remains lost after memorial spaceflight capsule crashes into the sea - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/private-spaceflight/human-remains-lost-after-memorial-spaceflight-capsule-crashes-into-the-sea",
      "image_url": "https://cdn.mos.cms.futurecdn.net/dupdZWeHxumkDBnTrerueG.jpg",
      "summary": "Universe's 'missing' matter found! Space Exploration Private Spaceflight Human remains lost after memorial spaceflight capsule crashes into the sea By Josh Dinner published 2 days ago Things almost went exactly as planned. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. (Image credit: The Exploration) A space capsule included on a...",
      "published": "Thu, 26 Jun 2025 18:00:15 GMT"
    },
    {
      "id": "b69f9c7fcd70c3cedc80468df7e1ba16",
      "title": "NASA’s Webb Digs into Structural Origins of Disk Galaxies - NASA Science (.gov)",
      "source": "NASA Science (.gov)",
      "url": "https://science.nasa.gov/missions/webb/nasas-webb-digs-into-structural-origins-of-disk-galaxies/",
      "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/webb-STScI-01JXX1TQRCDE8F92WV13SF4NE7-1K.jpg",
      "summary": "NASA’s Webb Digs into Structural Origins of Disk Galaxies Astronomers pulled from NASA’s James Webb Space Telescope’s data to analyze a sample of 111 edge-on galaxies. The team’s analysis suggests that thick disk formation occurs first, and thin disk formation follows. Full image and caption below. Credits: NASA, ESA, CSA, T. Tsukui (Australian National University). Image: A Sample of Galaxy...",
      "published": "Thu, 26 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "c08ecbfb1760f30ab8a185e8e6764409",
      "title": "\"Rhythmic surges\" detected in Africa where a new ocean is forming - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/fresh-lava-from-deep-earth-mantle-pulses-burst-onto-land-where-new-ocean-is-forming/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/27191219/Ethiopian-rift_Erta-Ale-volcano_Africa_mantle-pulse_lava_ocean-forming_USouthampton_1m.jpg",
      "summary": "Scientists find fresh lava from Earth's mantle bursting onto the surface where a new ocean is forming Deep beneath the Earth’s surface, in a layer called the mantle, heat builds up and pulses, causing rock to slowly rise toward the crust. This movement is known as a mantle upwelling, and it plays a major role in forming volcanoes, breaking continents...",
      "published": "Sat, 28 Jun 2025 01:18:55 GMT"
    },
    {
      "id": "427f02f8f61cf7e5fe291a6c602d1873",
      "title": "15 Million-Year-Old Evidence Reveals the Cambrian Explosion May Have Happened Earlier - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/15-m-year-old-evidence-cambrian-explosion/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/15-million-year-old-evidence-reveals-the-cambrian-explosion-may-have-happened-earlier.jpg",
      "summary": "15 Million-Year-Old Evidence Reveals the Cambrian Explosion May Have Happened Earlier New fossil evidence suggests the Cambrian Explosion, once thought to have occurred 530 million years ago, may have begun 15 million years earlier. Image credit: Canva | Indian Defence Review The Cambrian Explosion, a crucial turning point in Earth’s evolutionary history, traditionally dates back to around 530 million years...",
      "published": "Fri, 27 Jun 2025 19:15:00 GMT"
    },
    {
      "id": "369300c5625487fb429b275c099cd144",
      "title": "Scientists May Have Just Discovered the First Ever Pieces of Mercury - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/scientists-discovered-first-pieces-mercury/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-May-Have-Just-Discovered-the-First-Ever-Pieces-of-Mercury.jpg",
      "summary": "Scientists May Have Just Discovered the First Ever Pieces of Mercury Meteorites from mercury? The groundbreaking discovery that could change everything. Credit: ESA | The Daily Galaxy --Great Discoveries Channel Scientists may have solved a longstanding mystery in the study of Mercury. For the first time, pieces of the Solar System’s innermost planet could be on Earth, potentially shedding light...",
      "published": "Fri, 27 Jun 2025 19:30:00 GMT"
    },
    {
      "id": "c90f07b7cc4c71a767a7603d5982b766",
      "title": "Mysterious 'runner' dinosaur a sign there are more Jurassic secrets to unlock beneath western US - Live Science",
      "source": "Live Science",
      "url": "https://www.livescience.com/animals/dinosaurs/enigmatic-runner-dinosaur-from-colorado-helps-rewrite-understanding-of-several-jurassic-species",
      "image_url": "https://cdn.mos.cms.futurecdn.net/xo3Jr8Q8uibzkBRRafaknc.jpg",
      "summary": "Animals Extinct species Dinosaurs Mysterious 'runner' dinosaur a sign there are more Jurassic secrets to unlock beneath western US By Patrick Pester published 2 days ago The discovery of Enigmacursor mollyborthwickae, a dog-size \"runner\" dinosaur, has left researchers re-evaluating Nanosaurus and several other US dinosaurs from the Morrison Formation in Colorado. When you purchase through links on our site, we...",
      "published": "Thu, 26 Jun 2025 17:54:29 GMT"
    },
    {
      "id": "a453334c6b28787f98d21db138b39d96",
      "title": "Get Ready for the Moon and Mars Show: A Celestial Spectacle You Can’t Miss - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/the-moon-and-mars-show-celestial-spectacle/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/Get-Ready-for-the-Moon-and-Mars-Show-A-Celestial-Spectacle-You-Cant-Miss.jpg",
      "summary": "Get Ready for the Moon and Mars Show: A Celestial Spectacle You Can’t Miss This weekend, witness a stunning celestial show as the Moon and Mars align in a rare close conjunction. Image credit: KPNO/NOIRLab/NSF/AURA/J. Winsky | The Daily Galaxy --Great Discoveries Channel Skywatchers around the world have the perfect opportunity this weekend to witness a dazzling celestial show featuring...",
      "published": "Fri, 27 Jun 2025 16:30:00 GMT"
    }
  ]
}