{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-06-16 14:54:16",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "61717609b9b6e06ba73f6b999fea53f1",
      "title": "Scientists Discover Bizarre Signals Coming From Ice in Antarctica - futurism.com",
      "source": "futurism.com",
      "url": "https://futurism.com/bizarre-ice-signals-antarctica",
      "image_url": "https://wordpress-assets.futurism.com/2025/06/bizarre-ice-signals-antarctica.jpg",
      "summary": "JUN 15, 11:15 AM EDT by NOOR AL-SIBAI Scientists Discover Bizarre Signals Coming From Ice in Antarctica \"We still don't actually have an explanation. \" / Earth & Energy/ Anarctica/ Cosmic Particles/ Neutrinos Image by Stephanie Wissel / Penn State Some strange radio signals are broadcasting out of Antarctic ice, and the researchers who found them don't know why. Using...",
      "published": "Sun, 15 Jun 2025 15:15:42 GMT"
    },
    {
      "id": "fc858a66ec1b358241f03bf2631c7373",
      "title": "Scientists Detect Unusual Airborne Toxin in the United States for the First Time - SciTechDaily",
      "source": "SciTechDaily",
      "url": "https://scitechdaily.com/scientists-detect-unusual-airborne-toxin-in-the-united-states-for-the-first-time/",
      "image_url": "https://scitechdaily.com/images/Dust-Cloud-Over-Farm.jpg",
      "summary": "Home»Earth»Scientists Detect Unusual Airborne Toxin in the United States for the First Time Scientists Detect Unusual Airborne Toxin in the United States for the First Time Researchers unexpectedly discovered toxic airborne pollutants in Oklahoma. The image above depicts a field in Oklahoma. Credit: Shutterstock University of Colorado Boulder researchers made the first-ever airborne detection of Medium Chain Chlorinated Paraffins (MCCPs)...",
      "published": "Mon, 16 Jun 2025 03:57:38 GMT"
    },
    {
      "id": "cac040e0ce819b76ebb44f971a8ba213",
      "title": "NASA Teams Up With India to Launch First-of-Its-Kind $1.5 Billion Satellite - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/nasa-teams-up-with-india-to-launch-first-of-its-kind-1-5-billion-satellite",
      "image_url": "https://www.sciencealert.com/images/2025/06/SatelliteOverEarth.jpg",
      "summary": "NASA Teams Up With India to Launch First-of-Its-Kind $1. 5 Billion Satellite By STEVE PETRIE, THE CONVERSATION Artist’s concept of the NISAR satellite in orbit over Earth. (NASA/JPL-Caltech) In a few days, a new satellite that can detect changes on Earth's surface down to the centimetre, in almost real time and no matter the time of day or weather conditions,...",
      "published": "Mon, 16 Jun 2025 01:48:48 GMT"
    },
    {
      "id": "b60b3efb7525b47786eba43c80b840ea",
      "title": "Scientists Are Getting Closer to Finding Evidence of the Fifth Force - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/scientists-getting-closer-finding-evidence-135800701.html",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/HqTaatna5owj.H0.9Y0Fmg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/84199ca296ef6ac2c3dc5858d9d1a3ac",
      "summary": "Arrest in Minn. lawmaker attack New tax could hit family abroad Scientists Are Getting Closer to Finding Evidence of the Fifth Force Sat, June 14, 2025 at 1:58 PM UTC Could Asteroids Help Us Find the Fifth Force? NASA - Getty Images \"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links. \" Here’s what...",
      "published": "Sat, 14 Jun 2025 13:58:00 GMT"
    },
    {
      "id": "85c7eb634122331427292d4fc7c762c3",
      "title": "James Webb Space Telescope Has Spotted Something “Abnormal, Chaotic, and Strange” 60 Light-Years from Earth - The Debrief",
      "source": "The Debrief",
      "url": "https://thedebrief.org/james-webb-space-telescope-has-spotted-something-abnormal-chaotic-and-strange-60-light-years-from-earth/",
      "image_url": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/06/14-Herculis-c.jpg",
      "summary": "Artist's impression of 14 Herculis c (Credit: Exoplanetedu95/CC 3. 0) Astronomers have observed a planetary system 60 light-years from Earth that has been characterized as “abnormal, chaotic, and strange” with the help of NASA’s James Webb Space Telescope (JWST). The JWST’s sensitive Near-Infrared Camera, or NIRCam, imaged one of two planets known to encircle the star 14 Herculis, which is...",
      "published": "Sun, 15 Jun 2025 15:52:36 GMT"
    },
    {
      "id": "53d8952ac82f9021139b68429b374296",
      "title": "Study finds creature that may hold the key to bring limb regeneration to humans - WKRC",
      "source": "WKRC",
      "url": "https://local12.com/news/nation-world/study-finds-creature-key-limb-regeneration-future-advancement-new-possibilities-regenerative-medicine-unlock-process-acid-understanding-abilities-humans",
      "image_url": "https://local12.com/resources/media2/16x9/1914/986/3x0/90/e29550c3-f6c2-4fec-9d65-3047cb74173e-1.PNG",
      "summary": "Study finds creature that may hold the key to bring limb regeneration to humans by WKRC/CNN NewsourceSun, June 15th 2025 at 10:52 PM The axolotl, a small salamander known for its remarkable ability to regrow entire limbs, is at the center of groundbreaking research that could unlock new possibilities in regenerative medicine. (CNN Newsource) UNDATED (WKRC/CNN Newsource) - The axolotl,...",
      "published": "Sun, 15 Jun 2025 02:52:36 GMT"
    },
    {
      "id": "93178987b8f367bf32747bdc9cc4dc88",
      "title": "Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/carbon-dioxide-removal-ocean-oxygen-crisis/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/study-warns-carbon-dioxide-removal-methods-could-trigger-ocean-oxygen-crisis-1200x727.jpg",
      "summary": "Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis Marine carbon dioxide removal methods could dangerously accelerate ocean oxygen depletion. Study Warns: Carbon Dioxide Removal Methods Could Trigger Ocean Oxygen Crisis | Indian Defence Review A recent study published in Environmental Research Letters explores the potentially harmful consequences of certain marine carbon dioxide removal (mCDR) techniques, particularly their...",
      "published": "Sun, 15 Jun 2025 15:45:00 GMT"
    },
    {
      "id": "85ac9e1d0a503c860df565e7f28e82bc",
      "title": "Chilling First-Ever Footage of a Blood-Red Squid in the Antarctic Abyss - Indian Defence Review",
      "source": "Indian Defence Review",
      "url": "https://indiandefencereview.com/chilling-footage-blood-red-squid-antarctic/",
      "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/06/scuba-diving-credit-shuter-stock.png",
      "summary": "Chilling First-Ever Footage of a Blood-Red Squid in the Antarctic Abyss Deep in the icy waters of the Antarctic, a rare glimpse of the Gonate squid has left scientists in awe—an unprecedented encounter with a creature of the midnight zone. Chilling First-Ever Footage of a Blood-Red Squid in the Antarctic Abyss Credit: Shuter Stock | Indian Defence Review In an...",
      "published": "Sat, 14 Jun 2025 13:30:00 GMT"
    },
    {
      "id": "c0a2f5e7d43d03ba847dd9bb2ca66351",
      "title": "NASA sets new potential launch date for Ax-4 mission to ISS - SpaceNews",
      "source": "SpaceNews",
      "url": "https://spacenews.com/nasa-sets-new-potential-launch-date-for-ax-4-mission-to-iss/",
      "image_url": "https://spacenews.com/wp-content/uploads/2024/07/International-Space-Station-in-2021-scaled.webp",
      "summary": "Covering the business and politics of space NASA sets new potential launch date for Ax-4 mission to ISS The International Space Station, photographed in 2021. Credit: NASA PARIS — NASA says a private astronaut mission could launch to the International Space Station as soon as June 19 as it works to understand an air leak on the Russian segment of...",
      "published": "Sun, 15 Jun 2025 09:12:14 GMT"
    },
    {
      "id": "0cd3ca039dd77bd82f9d2faa27c397ac",
      "title": "New model helps to figure out which distant planets may host life - Space",
      "source": "Space",
      "url": "https://www.space.com/astronomy/solar-system/new-model-helps-to-figure-out-which-distant-planets-may-host-life",
      "image_url": "https://cdn.mos.cms.futurecdn.net/Q5mZXzCUvvGcDDBXxTZZ6A.jpg",
      "summary": "New model helps to figure out which distant planets may host life By Daniel Apai published yesterday The search for life beyond Earth is a holy grail quest for many experts, but finding where to look is a core issue. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. An artist's...",
      "published": "Sun, 15 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "bc246f581840e56d6419dd712dd1f7cf",
      "title": "New Pluto-Like Planet Discovered In Solar System — What To Know - Forbes",
      "source": "Forbes",
      "url": "https://www.forbes.com/sites/jamiecartereurope/2025/06/15/new-pluto-like-planet-discovered-in-solar-system---what-to-know/",
      "image_url": "https://imageio.forbes.com/specials-images/imageserve/684ad310f9bfdb46916d20b1/0x0.jpg?format=jpg&crop=2550,1435,x0,y1516,safe&height=900&width=1600&fit=bounds",
      "summary": "New Pluto-Like Planet Discovered In Solar System — What To Know ByJamie Carter, Senior Contributor. An award-winning reporter writing about stargazing and the night sky. Astronomers have found a distant celestial body — potentially a dwarf planet — orbiting the sun from more than twice as far as Pluto. Found by astronomers at the Institute for Advanced Study in Princeton,...",
      "published": "Sun, 15 Jun 2025 10:00:00 GMT"
    },
    {
      "id": "4f513d971fee4f3996596aacbc7a4a2f",
      "title": "520-million-year-old fossil discovered with brains and guts still intact, stunning the lead scientist - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/fossil-euarthropod-youti-yuanshi-lived-520-million-years-ago-insect-evolution/",
      "image_url": "https://cff2.earth.com/uploads/2024/08/15144514/fossil-discovery_Youti-yuanshi_guts_520-million-years_1m.jpg",
      "summary": "520-million-year-old fossil discovered with brains and guts still intact, stunning the lead scientist The Cambrian period, around 520 million years ago, was an age of experimentation. Life in the seas was trying out every possible body plan, searching for combinations that worked. One line of creatures, the euarthropods, hit on a winner: segmented bodies, paired jointed limbs, and a knack...",
      "published": "Sun, 15 Jun 2025 21:04:26 GMT"
    },
    {
      "id": "ef931cf8cade4e8139414cc51210edaa",
      "title": "NASA Satellite Glimpses Giant Volcano Peeking Above The Clouds of Mars - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/nasa-satellite-glimpses-giant-volcano-peeking-above-the-clouds-of-mars",
      "image_url": "https://www.sciencealert.com/images/2025/06/arsia-mons-header.jpg",
      "summary": "NASA Satellite Glimpses Giant Volcano Peeking Above The Clouds of Mars The new panorama from the Odyssey orbiter captured clouds, a volcanic peak, and the layering of Mars's atmosphere. (NASA/JPL-Caltech/ASU) A spacecraft's-eye view over the landscapes of Mars has just given us a first-of-its-kind glimpse of the giant, ancient edifice known as Arsia Mons. The NASA satellite Odyssey captured the...",
      "published": "Sun, 15 Jun 2025 19:00:24 GMT"
    },
    {
      "id": "8feda75ddd161c647dfbc7705d84b4a0",
      "title": "Cosmic mystery, unknown phenomenon: this perfect floating circle in space is baffling scientists. - Stewartville Star",
      "source": "Stewartville Star",
      "url": "https://thinkstewartville.com/2025/06/15/cosmic-mystery-unknown-phenomenon-this-perfect-floating-circle-in-space-is-baffling-scientists/",
      "image_url": "https://thinkstewartville.com/wp-content/uploads/2025/06/thinkstewartville.com-auto-draft-6480846130354-2025-06-12t145303.231.jpg",
      "summary": "Cosmic mystery, unknown phenomenon: this perfect floating circle in space is baffling scientists. Published on 06/15/2025 at 10:33 pm· © Stewartville Star - Cosmic mystery, unknown phenomenon: this perfect floating circle in space is baffling scientists. The Australian SKA Pathfinder Telescope recently discovered a celestial object with an almost perfect spherical shape. The scientific community has never been confronted with...",
      "published": "Mon, 16 Jun 2025 02:33:00 GMT"
    },
    {
      "id": "e0668b536e73de2bacc425b4bf52118f",
      "title": "14,000-year-old mummified 'puppies' weren't dogs at all, new research shows - KSL News",
      "source": "KSL News",
      "url": "https://www.ksl.com/article/51330097/14000-year-old-mummified-puppies-werent-dogs-at-all-new-research-shows",
      "image_url": "https://img.ksl.com/slc/3089/308952/30895286.jpg?filter=kslv2/responsive_story_lg",
      "summary": "14,000-year-old mummified 'puppies' weren't dogs at all, new research shows By Ashley Strickland, CNN | Posted - June 15, 2025 at 10:45 a. m. The well-preserved remains of 14,000-year-old wolf cub siblings were found in northern Siberia in 2011 and 2015. (Sergey Fedorov, North-Eastern Federal University) New research reveals 14,000-year-old Siberian \"puppies\" were actually wolf pups. Analysis of genetic data...",
      "published": "Sun, 15 Jun 2025 15:29:00 GMT"
    },
    {
      "id": "5394fce103ae892ead35c2fd1ce1aa3e",
      "title": "Huge breakthrough as ancient lost world discovered under ice in Antarctica - Daily Express",
      "source": "Daily Express",
      "url": "https://www.express.co.uk/news/world/2068756/Huge-breakthrough-as-ancient-lost-world-discovered-under-ice-in-Antarctica",
      "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6229894.jpg",
      "summary": "Puzzles Horoscopes Express Rated Shop Paper Newsletters Huge breakthrough as ancient lost world discovered under ice in Antarctica Scientists used ice-penetrating radar to discover the hidden land deep below Antarctica's ice sheet. 21:54, Sat, Jun 14, 2025 | UPDATED: 21:59, Sat, Jun 14, 2025 An ancient world has been discovered below Antarctica (Image: Getty) An ancient lost world hidden for...",
      "published": "Sat, 14 Jun 2025 20:54:00 GMT"
    },
    {
      "id": "fc14120ad9cc2a9bcaf644d3458c19d3",
      "title": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/hundreds-of-mysterious-giant-viruses-discovered-lurking-in-the-ocean",
      "image_url": "https://www.sciencealert.com/images/2025/06/pandora-virus.jpg",
      "summary": "Hundreds of Mysterious Giant Viruses Discovered Lurking in The Ocean Pandoravirus salinus, a species of giant virus identified in 2013. (© IGS CNRS-AMU) Scientists have just discovered hundreds of new giant viruses, in a comprehensive study covering oceans across the globe. The team behind the study, marine biologist Benjamin Minch and virologist Mohammad Moniruzzaman from the University of Miami, used...",
      "published": "Mon, 16 Jun 2025 06:42:09 GMT"
    },
    {
      "id": "dd78d769e398e3b23acc952041c258c6",
      "title": "Researchers Use Trapped-Ion Quantum Computer to Tackle Tricky Protein Folding Problems - The Quantum Insider",
      "source": "The Quantum Insider",
      "url": "https://thequantuminsider.com/2025/06/15/researchers-use-trapped-ion-quantum-computer-to-tackle-tricky-protein-folding-problems/",
      "image_url": "https://thequantuminsider.com/wp-content/uploads/2025/06/Screenshot-2025-06-15-at-4.29.51 AM-1.png",
      "summary": "Researchers Use Trapped-Ion Quantum Computer To Tackle Tricky Protein Folding Problems Researchers used a 36-qubit trapped-ion quantum computer and a specialized algorithm to solve protein folding problems involving up to 12 amino acids, reportedly the largest such demonstration to date on real quantum hardware. The system applied a non-variational quantum optimization method, BF-DCQO, to find optimal or near-optimal folding configurations...",
      "published": "Sun, 15 Jun 2025 11:59:19 GMT"
    },
    {
      "id": "57f2bebe6ff12ecc33800209bcac420d",
      "title": "Scientists have discovered 'third state' between life and death - WTTE",
      "source": "WTTE",
      "url": "https://myfox28columbus.com/news/nation-world/scientists-discovered-third-state-between-life-death-new-functions-reality-change-breakthrough-finding-understand-biological-research-cells-organisms-people-living-host-survive",
      "image_url": "https://myfox28columbus.com/resources/media/70b22b3a-3d55-4607-87ee-507483999039-large16x9_AP21274072243610.jpg?1633114060815",
      "summary": "Scientists have discovered 'third state' between life and death by WKRCSun, June 15th 2025 at 9:54 PM Scientists were diving into a mysterious biological phenomenon known as the \"third state,\" where cells of a deceased organism can adopt new functions after death. (NIAID-RML via AP, FILE) UNDATED (WKRC) - Scientists were diving into a mysterious biological phenomenon known as the...",
      "published": "Sun, 15 Jun 2025 01:54:50 GMT"
    },
    {
      "id": "5d2957201b7759f316bfdf9bdb8f810d",
      "title": "Light Squeezed Out of Darkness in Surprising Quantum Simulation - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/light-squeezed-out-of-darkness-in-surprising-quantum-simulation",
      "image_url": "https://www.sciencealert.com/images/2025/06/light_from_nothing_header.jpg",
      "summary": "Light Squeezed Out of Darkness in Surprising Quantum Simulation (Paper Boat Creative/Getty Images) A careful alignment of three powerful lasers could generate a mysterious fourth beam of light that is throttled out of the very darkness itself. What sounds like occult forces at work has been confirmed by a simulation of the kinds of quantum effects we might expect to...",
      "published": "Mon, 16 Jun 2025 02:32:43 GMT"
    }
  ]
}