{
  "metadata": {
    "source_file": "data/news_science.json",
    "generation_time": "2025-07-01 14:23:11",
    "total_articles": 20
  },
  "articles": [
    {
      "id": "6ba172b30c98804933bf4e277209f5be",
      "title": "Scientists Just Discovered a Creature That Breaks the Rules of Life - Yahoo",
      "source": "Yahoo",
      "url": "https://www.yahoo.com/news/scientists-just-discovered-creature-breaks-053515983.html",
      "image_url": "https://media.zenfs.com/en/men_s_journal_718/7afd515b6032e44a252bcc3975c1cad6",
      "summary": "Tillis retiring after Trump attack Scientists Just Discovered a Creature That Breaks the Rules of Life Tue, July 1, 2025 at 5:35 AM UTC In the ever-expanding universe of microscopic life, scientists have uncovered something that might force us to redraw the boundaries of what counts as “alive. ” Meet Sukunaarchaeum mirabile, a tiny cellular oddity recently discovered by researchers...",
      "published": "Tue, 01 Jul 2025 05:35:00 GMT"
    },
    {
      "id": "329ba4628f7276eafe1c96d3c5cd5f8a",
      "title": "Near Antarctica, Saltier Seas Mean Less Ice, Study Finds - The New York Times",
      "source": "The New York Times",
      "url": "https://www.nytimes.com/2025/06/30/climate/antarctic-sea-ice-salinity.html",
      "image_url": null,
      "summary": "No content available for summarization.",
      "published": "Mon, 30 Jun 2025 21:04:22 GMT"
    },
    {
      "id": "c328a1bf3fc9e3100ae91b3ba1aaa7ab",
      "title": "First Glimpse of a Cotton Candy Nebula: New Images from Vera C. Rubin Observatory Reveal Stunning Cosmic Beauty - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/cotton-candy-nebula-vera-c-rubin/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/First-Glimpse-of-a-Cotton-Candy-Nebula-New-Images-from-Vera-C.-Rubin-Observatory-Reveal-Stunning-Cosmic-Beauty.jpg",
      "summary": "First Glimpse of a Cotton Candy Nebula: New Images from Vera C. Rubin Observatory Reveal Stunning Cosmic Beauty The Trifid Nebula shines in stunning detail in the first close-up image from the Vera C. Rubin Observatory, offering a breathtaking view of cosmic creation. Image credit: RubinObs/NOIRLab/SLAC/NSF/DOE/AURA | The Daily Galaxy --Great Discoveries Channel The Vera C. Rubin Observatory has unveiled...",
      "published": "Mon, 30 Jun 2025 14:00:00 GMT"
    },
    {
      "id": "d49658d522b6dad66f03278bc38ee04a",
      "title": "Budget Protest: People Spoke Out – Advocacy Groups Did Nothing - NASA Watch",
      "source": "NASA Watch",
      "url": "https://nasawatch.com/activism/budget-protest-people-spoke-out-advocacy-groups-did-nothing/",
      "image_url": null,
      "summary": "Verify you are human by completing the action below. nasawatch.com needs to review the security of your connection before proceeding. Performance & security by Cloudflare",
      "published": "Mon, 30 Jun 2025 16:33:02 GMT"
    },
    {
      "id": "9772b3bd8730f469025b73f1fa6714bb",
      "title": "World Asteroid Day 2025: Watch live views of near-Earth asteroids for free online on June 30 - Space",
      "source": "Space",
      "url": "https://www.space.com/stargazing/world-asteroid-day-2025",
      "image_url": "https://cdn.mos.cms.futurecdn.net/8w59hzqWAvnRUyPCS5ng5n.jpg",
      "summary": "Daytime fireball meteorite hits house! World Asteroid Day 2025: Watch live views of near-Earth asteroids for free online on June 30 By Anthony Wood published yesterday Because you don’t wanna miss a thing. When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A visualization of near-Earth asteroids (Image credit: NASA) World...",
      "published": "Mon, 30 Jun 2025 13:33:05 GMT"
    },
    {
      "id": "8cc024f65a85f1adf1031578b84942ad",
      "title": "Was ancient Mars habitable? NASA's Perseverance rover is grinding into a 'weird, uncooperative' rock to find out - Space",
      "source": "Space",
      "url": "https://www.space.com/space-exploration/mars-rovers/was-ancient-mars-habitable-nasas-perseverance-rover-is-grinding-into-a-weird-uncooperative-rock-to-find-out",
      "image_url": "https://cdn.mos.cms.futurecdn.net/7UrHy3yVTnMC2eM4NcCKqL.png",
      "summary": "Daytime fireball meteorite hits house! Space Exploration Missions Mars Rovers Was ancient Mars habitable? NASA's Perseverance rover is grinding into a 'weird, uncooperative' rock to find out By Samantha Mathewson published 19 hours ago NASA's Perseverance rover is digging deeper into Mars' geologic past as it begins grinding into rock surfaces to expose material that could hold clues to the...",
      "published": "Mon, 30 Jun 2025 19:00:00 GMT"
    },
    {
      "id": "dc67606859b9cd05a3ac6b90002c3aca",
      "title": "The Oceans on Enceladus Are Highly Alkaline - Universe Today",
      "source": "Universe Today",
      "url": "https://www.universetoday.com/articles/the-oceans-on-enceladus-are-highly-alkaline",
      "image_url": "https://www.universetoday.com/article_images/pia19656_labeled_updated_690w.jpg__1240x510_q85_subsampling-2_20250627_155033.jpg",
      "summary": "The Oceans on Enceladus Are Highly Alkaline By Laurence Tognetti, MSc - June 30, 2025 at 2:50 AM UTC | Planetary Science Illustration of the interior of Saturn's moon Enceladus showing a global liquid water ocean between its rocky core and icy crust. Image Credit: JPL What can the pH level of the subsurface ocean on Enceladus tell us about...",
      "published": "Mon, 30 Jun 2025 02:50:00 GMT"
    },
    {
      "id": "15314cc854c4ce50f051012b03850d79",
      "title": "NASA to Provide Coverage of Progress 92 Launch, Space Station Docking - NASA (.gov)",
      "source": "NASA (.gov)",
      "url": "https://www.nasa.gov/news-release/nasa-to-provide-coverage-of-progress-92-launch-space-station-docking/",
      "image_url": "https://www.nasa.gov/wp-content/uploads/2025/06/progress-92-advisory-june-30.jpg",
      "summary": "NASA to Provide Coverage of Progress 92 Launch, Space Station Docking The Roscosmos Progress 90 cargo craft approaches the International Space Station for a docking to the Poisk module delivering nearly three tons of food, fuel, and supplies replenishing the Expedition 72 crew. NASA will provide live coverage of the launch and docking of a Roscosmos cargo spacecraft delivering approximately...",
      "published": "Mon, 30 Jun 2025 19:03:36 GMT"
    },
    {
      "id": "b7e807d0b09e90d61c31a1ab32ab59d8",
      "title": "How can the James Webb Space Telescope see so far? - The Conversation",
      "source": "The Conversation",
      "url": "https://theconversation.com/how-can-the-james-webb-space-telescope-see-so-far-257421",
      "image_url": "https://images.theconversation.com/files/672026/original/file-20250603-56-52fim0.png?ixlib=rb-4.1.0&rect=0%2C723%2C4159%2C2079&q=45&auto=format&w=1356&h=668&fit=crop",
      "summary": "This is a James Webb Space Telescope image of NGC 604, a star-forming region about 2. 7 million light-years from Earth. NASA/ESA/CSA/STScI How can the James Webb Space Telescope see so far? Published: June 30, 2025 8:31am EDT Assistant Professor of Astronomy and Astrophysics, University of Maryland, Baltimore County Adi Foord does not work for, consult, own shares in or...",
      "published": "Mon, 30 Jun 2025 12:31:18 GMT"
    },
    {
      "id": "edc56b01fdf4c5a775223514bbd2fa1f",
      "title": "New Satellite Network to Scan Earth Every 20 Minutes, Revolutionizing Global Wildfire Monitoring - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/new-satellite-network-wildfire-monitoring/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/New-Satellite-Network-to-Scan-Earth-Every-20-Minutes-Revolutionizing-Global-Wildfire-Monitoring.jpg",
      "summary": "New Satellite Network to Scan Earth Every 20 Minutes, Revolutionizing Global Wildfire Monitoring A new satellite system will scan the Earth every 20 minutes, providing real-time wildfire detection to help save lives and protect communities. Image credit: Muon Space | The Daily Galaxy --Great Discoveries Channel A new satellite initiative by Muon Space promises to change the way we detect...",
      "published": "Mon, 30 Jun 2025 16:10:00 GMT"
    },
    {
      "id": "843d38579902eba840ae2a4656f45302",
      "title": "Long-dead satellite emits strong radio signal, puzzling astronomers - CNN",
      "source": "CNN",
      "url": "https://www.cnn.com/2025/06/30/science/satellite-strange-radio-signal-relay-2",
      "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/unknown-1-20250626134501571.jpg?c=16x9&q=w_800,c_fill",
      "summary": "Long-dead satellite emits strong radio signal, puzzling astronomers Updated 8:52 PM EDT, Mon June 30, 2025 The ASKAP radio telescope in Western Australia picked up a powerful radio signal from a NASA satellite that stopped working in 1967. Alex Cherney/CSIRO Astronomers in Australia picked up a strange radio signal in June 2024 — one near our planet and so powerful...",
      "published": "Tue, 01 Jul 2025 00:52:00 GMT"
    },
    {
      "id": "ce85650eda3bec1b844c64cdd155eb23",
      "title": "Forget running and swimming — study finds this sport adds 10 years to your life - Tom's Guide",
      "source": "Tom's Guide",
      "url": "https://www.tomsguide.com/wellness/fitness/forget-running-and-swimming-study-finds-this-sport-adds-10-years-to-your-life",
      "image_url": "https://cdn.mos.cms.futurecdn.net/RE2QMc8pagtJMny3GcKtX7.jpg",
      "summary": "Forget running and swimming — study finds this sport adds 10 years to your life By Jane McGuire published 7 hours ago When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. While running and swimming are both fantastic ways to build cardiovascular fitness and strengthen your muscles, if you’re not a...",
      "published": "Tue, 01 Jul 2025 07:38:59 GMT"
    },
    {
      "id": "1ee2fa26089d0ee904ca88563be034a6",
      "title": "Geologists say these rocks are the oldest ever found on Earth - Earth.com",
      "source": "Earth.com",
      "url": "https://www.earth.com/news/earths-oldest-known-rocks-formed-over-four-billion-years-ago/",
      "image_url": "https://cff2.earth.com/uploads/2025/06/27102230/old-rocks.jpg",
      "summary": "Geologists say these rocks are the oldest ever found on Earth The story of Earth begins long before forests, oceans, or even life itself. Deep beneath our feet lie ancient stones that silently preserve the secrets of our planet’s earliest days. These fragments of Earth’s crust, forged during a time of violent formation and fiery beginnings, are nearly impossible to...",
      "published": "Mon, 30 Jun 2025 07:00:00 GMT"
    },
    {
      "id": "058230d016cea80c0731eea92f3daee1",
      "title": "Look: NASA Satellite Images Reveal Mysterious Blast Site of 1908 Tunguska Event that Scorched Remote Siberia - The Debrief",
      "source": "The Debrief",
      "url": "https://thedebrief.org/look-nasa-satellite-images-reveal-mysterious-blast-site-of-1908-tunguska-event-that-scorched-remote-siberia/",
      "image_url": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/06/Tunguska-blast-EO-image-boxed.jpg",
      "summary": "(Credit: NASA/Earth Observatory) A fiery explosion tore through the skies over Eastern Siberia on the morning of June 30, 1908, decimating more than 830 square miles of frozen taiga in what remains the largest asteroid-related blast in recorded history. Known as the Tunguska event, today it serves as a stark reminder of potential dangers presented by space objects that cross...",
      "published": "Mon, 30 Jun 2025 19:12:52 GMT"
    },
    {
      "id": "27d7cac321c5f1f86e1371ffca01bc7e",
      "title": "Space Cargo of Human Remains And Cannabis Lost at Sea Following Mission Failure - ScienceAlert",
      "source": "ScienceAlert",
      "url": "https://www.sciencealert.com/space-cargo-of-human-remains-and-cannabis-lost-at-sea-following-mission-failure",
      "image_url": "https://www.sciencealert.com/images/2025/07/nyx_capsule_entry.jpg",
      "summary": "Space Cargo of Human Remains And Cannabis Lost at Sea Following Mission Failure By MATTHEW WILLIAMS, UNIVERSE TODAY Artist's impression of The Exploration Company's Nyx capsule in orbit. (The Exploration Company) We've sent some pretty interesting payloads to space since the first satellite (Sputnik 1) launched on October 4th, 1957. As access to space has increased, thanks largely to the...",
      "published": "Tue, 01 Jul 2025 03:05:20 GMT"
    },
    {
      "id": "3691745d72d4e43ad56c805028bae4ba",
      "title": "A Massive Impact Crater Has Been Found Beneath Chesapeake Bay - The Daily Galaxy",
      "source": "The Daily Galaxy",
      "url": "https://dailygalaxy.com/2025/06/massive-impact-crater-found-chesapeake-bay/",
      "image_url": "https://dailygalaxy.com/wp-content/uploads/2025/06/A-Massive-Impact-Crater-Has-Been-Found-Beneath-Chesapeake-Bay.jpg",
      "summary": "A Massive Impact Crater Has Been Found Beneath Chesapeake Bay 35 million years ago, an asteroid struck the Atlantic Ocean, creating a giant crater now hidden beneath Chesapeake Bay. Credit: Canva | The Daily Galaxy --Great Discoveries Channel A monumental discovery has revealed that an asteroid struck the East Coast of North America roughly 35 million years ago, leaving behind...",
      "published": "Mon, 30 Jun 2025 17:30:00 GMT"
    },
    {
      "id": "52bdbd279f369aab4b2968fdb624dbcd",
      "title": "Scientists discover ancient radio signals from distant galaxy cluster - AOL.com",
      "source": "AOL.com",
      "url": "https://www.aol.com/scientists-discover-ancient-radio-signals-231911343.html",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/WVz9vOrhZ.7WJJKDX2yTOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_fox_news_articles_947/b10ffecab1ead2894d0c8952d8e11f2e",
      "summary": "Scientists discover ancient radio signals from distant galaxy cluster Sat, June 28, 2025 at 6:19 PM CDT Astronomers studying a distant galaxy cluster stumbled upon ancient radio signals that might hold clues to the formation of the early universe. While studying the distant galaxy cluster known as SpARCS1049, astronomers detected faint mysterious radio waves, according to a study published in...",
      "published": "Tue, 01 Jul 2025 10:08:35 GMT"
    },
    {
      "id": "73c6cdb05767a761841c86666b6cb0b9",
      "title": "James Webb Telescope Unlocks the Deep Structural Secrets of Disk Galaxies, Revealing How the Universe Built Its Greatest Shapes - Rude Baguette",
      "source": "Rude Baguette",
      "url": "https://www.rudebaguette.com/en/2025/06/james-webb-telescope-unlocks-the-deep-structural-secrets-of-disk-galaxies-revealing-how-the-universe-built-its-greatest-shapes/",
      "image_url": "https://www.rudebaguette.com/wp-content/uploads/2025/06/unveiling-cosmic-secrets-nasas-jwst-reveals-astonishing-insights-into-origins-of-disk-galaxies-challenging-everything-we-thought-we-knew.jpg",
      "summary": "James Webb Telescope Unlocks the Deep Structural Secrets of Disk Galaxies, Revealing How the Universe Built Its Greatest Shapes Astronomers have made a groundbreaking discovery using the James Webb Space Telescope, unveiling the intricate origins of disk galaxies and providing unprecedented insights into the formation of the Milky Way's thick and thin disks. Eirwen WilliamsJune 30, 2025 at 4:46 PM7...",
      "published": "Mon, 30 Jun 2025 20:46:58 GMT"
    },
    {
      "id": "c830dac00c19d8cdf3d3e92adf7d2a06",
      "title": "New Dog-Sized Dinosaur Had Quite the Tail - Newser",
      "source": "Newser",
      "url": "https://www.newser.com/story/371135/new-dog-sized-dinosaur-had-quite-the-tail.html",
      "image_url": "https://img2-azrcdn.newser.com/image/1619507-12-20250630120002.jpeg",
      "summary": "New Dog-Sized Dinosaur Had Quite the Tail Rare, nearly complete skeleton reveals secrets of small Jurassic-era dinosaurs Posted Jun 30, 2025 11:30 AM CDT The nearly complete skeleton of a dinosaur dubbed Enigmacursor mollyborthwickae, which was about the size of a dog, but with a much larger tail. (Natural History Museum/David Aaron Gallery) Hidden among the giants of the Jurassic...",
      "published": "Mon, 30 Jun 2025 16:30:00 GMT"
    },
    {
      "id": "2a189d6e548d3cdad2fe3c97d4741b78",
      "title": "Scientists sound alarm over lab-made human DNA as 'God-like' project moves forward - Daily Mail",
      "source": "Daily Mail",
      "url": "https://www.dailymail.co.uk/sciencetech/article-14855031/Scientists-warn-catastrophic-risks-labs-play-God-human-DNA.html",
      "image_url": "https://i.dailymail.co.uk/1s/2025/06/30/14/99857571-0-image-m-19_1751290016408.jpg",
      "summary": "Scientists sound alarm over lab-made human DNA as 'God-like' project moves forward READ MORE: Police spark outcry for using 'unethical' mind-reading technology on suspects against their will By OSHEEN YADAV FOR DAILYMAIL. COM PUBLISHED: 12:15 EDT, 30 June 2025 | UPDATED: 14:36 EDT, 30 June 2025 Scientists have taken a bold and controversial step toward creating synthetic human DNA from...",
      "published": "Mon, 30 Jun 2025 16:15:56 GMT"
    }
  ]
}